/********************************************************/
/* @file DTO459_VDV_main.h								*/
/* App(Flash)領域のmain制御								*/
/* 														*/
/* App(Flash)領域のmain制御をする。						*/
/* <ul>													*/
/* <li>AppのMain処理。									*/
/* <li>10msec周期タイマ割込み処理。						*/
/* </ul>												*/
/* 														*/
/********************************************************/
/* @author      Y.Sorimachi								*/
/* @date        2013/--/--								*/
/********************************************************/ 
/* @page */

#ifndef	DTO459_VDV_MAIN_H
#define	DTO459_VDV_MAIN_H

#include "type.h"

/********************************************************/
/*	外部マクロ											*/
/********************************************************/

/********************************************************/
/*	定数宣言											*/
/********************************************************/

/********************************************************/
/*	外部関数											*/
/********************************************************/
/** 
 * /// App(Flash)領域のmain処理
 * 
 * @author	Y.Sorimachi
 * @date	2013/--/--
 * @note	Appのメイン処理を行う。
 */ 
void App_Main( void );

/** 
 * タイマ割込み実行処理
 * 
 * @author	Y.Sorimachi
 * @date	2013/--/--
 * @note	10msecのタイマ割込み関数から実行される処理。
 */ 
void App_main_IntTimerRun( void );

/********************************************************/
/* 関数名称		： App_main_Term						*/
/* 機能の説明	： 終了処理								*/
/* 引数			： void									*/
/* 戻り値		： void									*/
/* 作成者		： (OFT)Toguchi							*/
/* 作成日		： 16/10/21								*/
/* 備考			： 										*/
/********************************************************/
void App_main_Term( void );

#endif	/* DTO459_VDV_MAIN_H */
