/********************************************************/
/* file reg_setting.h									*/
/* レジスタ設定用ヘッダファイル							*/
/* 														*/
/* レジスタの設定をする。								*/
/* <ul>													*/
/* <li>レジスタの初期化を行う							*/
/* <li>レジスタの再設定を行う							*/
/* <li>10msec周期のタイマ割込みを開始する				*/
/* <li>ウォッチドッグタイマをリセットする				*/
/* </ul>												*/
/* 														*/
/********************************************************/
/* author      Y.Sorimachi								*/
/* date        2013/--/--								*/
/********************************************************/
 
#ifndef __REG_SETTING_H__
#define __REG_SETTING_H__

#include "type.h"

/********************************************************/
/*	外部マクロ											*/
/********************************************************/

/********************************************************/
/*	定数宣言											*/
/********************************************************/

/********************************************************/
/*	外部関数											*/
/********************************************************/
/** 
 * /// レジスタ初期化
 *
 * author	Y.Sorimachi
 * date		2013/--/--
 * note		レジスタの初期化処理を行う。
 */ 
void Reg_setting_Init( void );

/********************************************************/
/* 関数名称		: Reg_setting_Term						*/
/* 機能の説明	: レジスタ終了設定						*/
/* 引数			: void									*/
/* 戻り値		: void									*/
/* 作成者		: (OFT)Toguchi							*/
/* 作成日		: 16/10/21								*/
/* 備考			: 										*/
/********************************************************/
void Reg_setting_Term( void );

/** 
 * /// タイマ割込み開始
 *
 * author	Y.Sorimachi
 * date		2013/--/--
 * note		10msec周期のタイマ割込みを開始する。
 */ 
void Reg_setting_TimerStart( void );

/** 
 * /// ウォッチドッグタイマリセット
 *
 * author	Y.Sorimachi
 * date		2013/--/--
 * note		ウォッチドッグタイマをリセットする。
 */ 
void Reg_setting_WtdRestart( void );


/** 
 * /// 割込みマスク許可設定
 */ 
void Reg_setting_EnableIntMask(void);

/** 
 * /// 割込みマスク禁止設定
 */ 
void Reg_setting_DisableIntMask(void);

#endif	/* __REG_SETTING_H__ */
