/************************************************************************************************/
/* 客先名		:	機種依存モジュール															*/
/* 機種名		:	-																			*/
/* ﾏｲｺﾝｿﾌﾄﾃｰﾏ名	:	-																			*/
/*==============================================================================================*/
/* 作成ﾌｧｲﾙ名	:	SSFTxxx_FR81_Wdt_Drv_Config.h												*/
/* 				:	WDTﾄﾞﾗｲﾊﾞｺﾝﾌｨｸﾞﾍｯﾀﾞﾞ														*/
/*==============================================================================================*/
/* 対象ﾏｲｺﾝ		:	MB91570 Series																*/
/*==============================================================================================*/
/* 作成ﾊﾞｰｼﾞｮﾝ	:	020101																		*/
/* 作成年月日	:	2014.02.10																	*/
/* 作成者		:	K.Uchiyama																	*/
/*----------------------------------------------------------------------------------------------*/
/* 変更履歴		:																				*/
/* [010101]		:	新規作成																	*/
/* [010102]		:																				*/
/* [010103]		:	間欠起動時の処理追加														*/
/* [020101]		:	外部WDT未実装の場合に処理を空関数とするコンフィグ追加						*/
/************************************************************************************************/
#ifndef __MB91570_WDT_DRV_CONFIG_H__
#define __MB91570_WDT_DRV_CONFIG_H__

/* 内部定数 */
#ifdef __MB91570_WDT_DRV_INTERNAL__
/********************************************************************************/
/*   Include File                                                               */
/*------------------------------------------------------------------------------*/
/*      ﾍｯﾀﾞｰﾌｧｲﾙのｲﾝｸﾙｰﾄﾞ文は、下記ﾌｧｲﾙに記載すること                          */
/********************************************************************************/
#include "SSFTSTD_FR81_Port_Drv.h"
#include "SSFTSTD_FR81_SystemClock_Drv.h"

/*==============================================================================*/
/*	セクション配置（機種依存）													*/
/*==============================================================================*/
#ifdef _VDV_BOOT
#pragma segment CODE=RAMCODE	/* Boot処理ではWDTドライバはRAMで動作させる */
#endif /* _VDV_BOOT */

/*==============================================================================*/
/*	typedef定義																	*/
/*==============================================================================*/

/*==============================================================================*/
/*	define定義																	*/
/*==============================================================================*/
#define WDT0_START		(0x55)						/* 内部WDT0起動値 */
													/*	<07-00>	CPAT	: 01010101	(ウォッチドッグタイマ0クリアビット 内部WDT0起動値)	*/

#define WDT0_REVERSE	(WDT0_START ^ 0xFFU)		/* 内部WDT0反転値 */

#define WDT1_CLEAR		(0xA5)						/* 内部WDT1クリア値 */
													/*	<07-00>	CPAT	:10100101	(ウォッチドッグタイマ1クリアビット 内部WDT1クリア値)	*/

#define INIT_WDTCR0		(0x0C)		/*	ウォッチドッグ制御レジスタ */
									/*	<07>	-		: 0		(予約bit)	*/
									/*	<06>	RSTP	: 0		(ストップモード検出リセット許可ビット 未検出)	*/
									/*	<05-04>	WDG1	: 00	(予約bit)	*/
									/*	<03-00>	WT		: 1100	(ウォッチドッグタイマ周期選択ビット PCLK*2^21サイクル)	*/
									/* ------------------------------------------------------------------- */


#define INIT_WDTCR0_INTERVAL_WAKEUP		(0x0C)		/*	ウォッチドッグ制御レジスタ(間欠起動時) */
													/*	<07>	-		: 0		(予約bit)	*/
													/*	<06>	RSTP	: 0		(ストップモード検出リセット許可ビット 未検出)	*/
													/*	<05-04>	WDG1	: 00	(予約bit)	*/
													/*	<03-00>	WT		: 1100	(ウォッチドッグタイマ周期選択ビット PCLK*2^21サイクル)	*/
													/* ------------------------------------------------------------------- */

#define STOP_WDTCR0		(0x0C)		/* INIT_WDTCR0と同じ設定値 */

#define HWWDTDRV_PORT_TURN	(0x01)	/* WDT_DRV_HWWDT==1 の時、有効：外部WDTポート レベル反転用 */
#define HWWDTDRV_WAIT_TIME	(0x7F)	/* WDT_DRV_HWWDT==1 の時、有効：外部WDTのエッジ入力認識待機時間(CCLK = 2MHz, 1ms以上) */

#endif								/* __MB91570_WDT_DRV_INTERNAL__ */

/* 外部公開定数 */

/*==============================================================================*/
/*	define定義（外部非公開：外部での使用禁止）									*/
/*==============================================================================*/
#define WDT_DRV_HWWDT	0	/* 外部WDT未実装時、ポートクセス処理無効化のためのコンフィグ(対象関数はHWWdtDrv_*) */
							/* 0:対象関数の処理がコンパイルされない（無効） */
							/* 1:対象関数の処理がコンパイルされる（有効） */

/*==============================================================================*/
/*	define定義（外部公開）														*/
/*==============================================================================*/



#endif	/*	__MB91570_WDT_DRV_CONFIG_H__ 	*/
