/********************************************************************************/
/* 客先名		:	標準モジュール												*/
/* 機種名		:	SSFT														*/
/* ﾏｲｺﾝｿﾌﾄﾃｰﾏ名	:	PF															*/
/*==============================================================================*/
/* 作成ﾌｧｲﾙ名	:	SSFTSTD_FR81_Eep_Drv.h										*/
/* 				:	EEPROMﾄﾞﾗｲﾊﾞﾍｯﾀﾞ											*/
/*==============================================================================*/
/* 対象ﾏｲｺﾝ		:	MB91570 Series												*/
/*==============================================================================*/
/* 作成ﾊﾞｰｼﾞｮﾝ	:	050101														*/
/* 作成年月日	:	2015.01.12													*/
/* 作成者		:	M.Koide														*/
/*------------------------------------------------------------------------------*/
/* 変更履歴		:																*/
/* [010201]		:	・ROM容量削減対応											*/
/* [010202]     :   ・コメントアウト修正										*/
/* [010204]		:	レジスタの定義名変更に伴いドライババージョンの更新			*/
/* [020101]		:	128K-bit対応(連続リードIF追加)								*/
/* [020201]		:	関数マクロ(WAIT)追加、書込み中の書込み許可削除				*/
/* [030101]		:	SPI通信(DMA)対応											*/
/* [030201]		:	32bit対応,SDESエラー対応									*/
/* [040101]		:	SPIアクセス開始IF関数追加									*/
/* [050101]		:	連続リードIF関数変更、SPIドライバIF関数名修正				*/
/********************************************************************************/
#ifndef	__MB91570_EEP_DRV_H__
#define	__MB91570_EEP_DRV_H__

/*** START_INC ***/
/********************************************************************************/
/*   Include File                                                               */
/*------------------------------------------------------------------------------*/
/*      ﾍｯﾀﾞｰﾌｧｲﾙのｲﾝｸﾙｰﾄﾞ文は、下記ﾌｧｲﾙに記載すること                          */
/********************************************************************************/
#include "SSFTxxx_FR81_Eep_Drv_Config.h"

/*==============================================================================*/
/*	外部定数																	*/
/*==============================================================================*/
#ifdef	_VERSION_CONST_DEFINE
UI_8 const C_EEPDRV_VER[6] = {	/* EEPROMドライバ ドライババージョンNo(050101) */
	0x00U,								/* xx "0" */
	0x05U,								/* xx "5" */
	0x00U,								/* yy "0" */
	0x01U,								/* yy "1" */
	0x00U,								/* zz "0" */
	0x01U								/* zz "1" */
};
#endif	/*	_VERSION_CONST_DEFINE	*/

/*==============================================================================*/
/*	関数ﾌﾟﾛﾄﾀｲﾌﾟ宣言（外部公開）												*/
/*==============================================================================*/
extern UI_8	EepDrv_ChkBusy(void);
extern UI_16 EepDrv_ReadDataWord(UI_16 adr);
extern void	EepDrv_WriteDataWord(UI_16 adr, UI_16 data);
extern void	EepDrv_Disable(void);
extern void	EepDrv_Enable(void);
#if (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_32K ) || (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_64K ) ||\
	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_128K)		/* EEPROMサイズ:32K[bit]以上 */
extern void EepDrv_StartSpiAccess(void);
extern void EepDrv_ReadDataNByte( const UI_16 addr, const UI_16 read_size, UI_8 read_data[] );
extern SI_8 EepDrv_GetTimeout(void);
extern void EepDrv_ReadDataNByteFast( const UI_16 addr, const UI_16 read_size, UI_8 read_data[] );
extern SI_8 EepDrv_ReadDataNByteFastFinish(void);
#endif

#endif	/* __MB91570_EEP_DRV_H__ */
