/************************************************************************************************/
/* 客先名		:	標準モジュール																*/
/* 機種名		:	SSFT																		*/
/* ﾏｲｺﾝｿﾌﾄﾃｰﾏ名	:	PF																			*/
/*==============================================================================================*/
/* 作成ﾌｧｲﾙ名	:	SSFTSTD_FR81_SystemClock_Drv.h												*/
/* 				:	ｼｽﾃﾑｸﾛｯｸﾄﾞﾗｲﾊﾞﾍｯﾀﾞ															*/
/*==============================================================================================*/
/* 対象ﾏｲｺﾝ		:	MB91570 Series																*/
/*==============================================================================================*/
/* 作成ﾊﾞｰｼﾞｮﾝ	:	020102																		*/
/* 作成年月日	:	2014.01.23																	*/
/* 作成者		:	K.Uchiyama																	*/
/*----------------------------------------------------------------------------------------------*/
/* 変更履歴		:																				*/
/* [010101]		:	新規作成																	*/
/* [010102]		:	クロック設定修正															*/
/* [010103]		:	標準IF対応。起動種別の名称変更												*/
/* [020101]		:	外バス分周(TCLK)設定用の外部IF追加											*/
/* [020102]		:	QAC対応。																	*/
/************************************************************************************************/
#ifndef __MB91570_SYSTEMCLOCK_DRV_H__
#define __MB91570_SYSTEMCLOCK_DRV_H__

/*** START_INC ***/
/********************************************************************************/
/*   Include File                                                               */
/*------------------------------------------------------------------------------*/
/*      ﾍｯﾀﾞｰﾌｧｲﾙのｲﾝｸﾙｰﾄﾞ文は、下記ﾌｧｲﾙに記載すること                          */
/********************************************************************************/
#include "SSFTxxx_FR81_SystemClock_Drv_Config.h"

/*==============================================================================*/
/*	typedef定義（外部公開）														*/
/*==============================================================================*/
/* なし */

/*==============================================================================*/
/*	外部定数																	*/
/*==============================================================================*/
#ifdef	_VERSION_CONST_DEFINE
UI_8 const C_SYSTEMCLOCKDRV_VER[6] = {	/* システムクロックドライバ ドライババージョンNo(020102) */
	0x00,								/* xx "0" */
	0x02,								/* xx "2" */
	0x00,								/* yy "0" */
	0x01,								/* yy "1" */
	0x00,								/* zz "0" */
	0x02								/* zz "2" */
};
#endif	/*	__MB91570_SYSTEMCLOCK_DRV_H__ 	*/

/* クロック種類 */
typedef enum {
	E_SYSCLK_INIT = 0,		/* 0x00：	（メインクロックの2分周） 		*/
	E_SYSCLK_MCLK_DV2,		/* 0x01：	（メインクロックの2分周）		*/
	E_SYSCLKDRV_PS_SEL,		/* 0x10：	（PLL/SSCGクロック）			*/
	E_SYSCLKDRV_SBCLK		/* 0x11：	（サブクロック）				*/
} E_CLKDRV_SRCCLOCKTYPE;


/*==============================================================================*/
/*	関数ﾌﾟﾛﾄﾀｲﾌﾟ宣言（外部公開）												*/
/*==============================================================================*/
extern void SysClkDrv_UsecWait(UI_16 wait_time);

extern void SysClkDrv_Init( E_INIT_TYPE req );
extern void SysClkDrv_Refresh(void);
extern void SysClkDrv_Sleep(void);

extern void SysClkDrv_SetTCLK(UI_8 select_clk);
#endif	/*	__MB91570_SYSTEMCLOCK_DRV_H__ 	*/

