/********************************************************************************/
/* 客先名		:	機種依存モジュール											*/
/* 機種名		:	-															*/
/* ﾏｲｺﾝｿﾌﾄﾃｰﾏ名	:	-															*/
/*==============================================================================*/
/* 作成ﾌｧｲﾙ名	:	SSFTxxx_FR81_Eep_Drv_Config.h								*/
/* 				:	EEPROMﾄﾞﾗｲﾊﾞｺﾝﾌｨｸﾞﾍｯﾀﾞﾞ										*/
/*==============================================================================*/
/* 対象ﾏｲｺﾝ		:	MB91570 Series												*/
/*==============================================================================*/
/* 作成ﾊﾞｰｼﾞｮﾝ	:	050101														*/
/* 作成年月日	:	2015.01.12													*/
/* 作成者		:	M.Koide														*/
/*------------------------------------------------------------------------------*/
/* 変更履歴		:																*/
/* [010103]		:	新規作成													*/
/* [010202]		:	・コメントアウト修正										*/
/* [020101]		:	128K-bit対応(Wait時間調整)									*/
/* [020201]		:	#define設定値修正											*/
/* [030101]		:	SPI通信(DMA)対応											*/
/* [030201]		:	32bit対応,SDESエラー対応									*/
/* [040101]		:	SPIアクセス開始IF関数追加									*/
/* [050101]		:	連続リードIF関数変更、SPIドライバIF関数名修正				*/
/********************************************************************************/
#ifndef __MB91570_EEP_DRV_CONFIG_H__
#define	__MB91570_EEP_DRV_CONFIG_H__

#ifdef __MB91570_EEP_DRV_INTERNAL__

/*** START_INC ***/
/********************************************************************************/
/*   Include File                                                               */
/*------------------------------------------------------------------------------*/
/*      ﾍｯﾀﾞｰﾌｧｲﾙのｲﾝｸﾙｰﾄﾞ文は、下記ﾌｧｲﾙに記載すること                          */
/********************************************************************************/
#include	"SSFTSTD_FR81_Port_Drv.h"
#include	"SSFTSTD_FR81_SystemClock_Drv.h"
//#include	"SSFTSTD_FR81_Spi_Drv.h"
#include	"SSFTSTD_FR81_Dmac_Drv.h"

/*==============================================================================*/
/*	define定義（機種依存）														*/
/*==============================================================================*/
/* 内部定数 */
/*==============================================================================*/
/* EEPROMのアクセスシーケンスに応じて、下記のウェイト時間を変更すること			*/
/*==============================================================================*/
#define		EEPROM_WAIT_TCSS()
#define		EEPROM_WAIT_TSKH_CONTINUE()		D_NOP10();D_NOP10();D_NOP10();D_NOP10();D_NOP10();D_NOP2()
#define		EEPROM_WAIT_TSKL_CONTINUE()		D_NOP10();D_NOP10();D_NOP10();D_NOP10();D_NOP10()
#define		EEPROM_WAIT_TSKH_PREREAD()		D_NOP10();D_NOP10();D_NOP10();D_NOP10();D_NOP10();D_NOP2()
#define		EEPROM_WAIT_TSKL_PREREAD()		D_NOP10();D_NOP10();D_NOP10();D_NOP10();D_NOP10()

#define		EEPROM_WAIT_TSKH()				D_NOP10();D_NOP10();D_NOP10();D_NOP10();D_NOP10();D_NOP2()
#define		EEPROM_WAIT_TSKL()				D_NOP10();D_NOP10();D_NOP10();D_NOP10();D_NOP10()

#define		EEPROM_WAIT_TDIS()
#define		EEPROM_WAIT_TDIH()
#define		EEPROM_WAIT_TSV()				D_NOP10();D_NOP10();D_NOP10();D_NOP10();D_NOP10()

#define		EEP_SPI_WAIT_MAXBLOCK			55190U	/* EEPROM-SPI-DMA通信(連続リード最大サイズ)タイムアウト時間(55.19ms) */
/* 最大ブロックサイズのEEPROM-SPI通信通信時間より算出する事 */
/* 参考 EEPROM-SPI-DMA通信(16K-BYTE)通信時間 */
/* 27595[us] = 16K * 8[bit] * (1/4.758[MHz]) */		/* ※SPI通信周波数 4.758[MHz] */
/* タイムアウト時間は通信時間に2倍のマージン */
/* 55190[us] = 27595[us] * 2 */

#define		EEP_SPI_WAIT_1BYTE				4U		/* EEPROM-SPI通信(8bit)タイムアウト時間(4us) */
/* EEPROM-SPI通信(8bit)通信時間 */
/* 1.68[us] =  8[bit] * (1/4.758[MHz]) */			/* ※SPI通信周波数 4.758[MHz] */
/* タイムアウト時間は通信時間に2倍のマージン */
/* 3.36[us] = 1.68[us] * 2 */

/* ※SPI通信周波数 = 周辺クロック周波数 / 4 */
/* 4.758[MHz] = 19.03325 / 4 */

#define		EEP_SPI_WATCH					1U		/* EEPROM-SPI通信(8bit)監視周期[μs](1μs周期) */

#endif /* __MB91570_EEP_DRV_INTERNAL__ */

/* 外部公開定数  */
/*==============================================================================*/
/* EEPROM最大アドレス(word単位)はマイコン、周辺デバイス依存のため変更しないこと */
/*==============================================================================*/
/* EEPROM最大アドレス(word単位) */
#define		EEPROM_ADDR_MAX_1K		(0x003FU)	/*	64[word]	*/
#define		EEPROM_ADDR_MAX_2K		(0x007FU)	/* 128[word]	*/
#define		EEPROM_ADDR_MAX_4K		(0x00FFU)	/* 256[word]	*/
#define		EEPROM_ADDR_MAX_8K		(0x01FFU)	/* 512[word]	*/
#define		EEPROM_ADDR_MAX_16K		(0x03FFU)	/* 1024[word]	*/
#define		EEPROM_ADDR_MAX_32K		(0x07FFU)	/* 2048[word]	*/
#define		EEPROM_ADDR_MAX_64K		(0x0FFFU)	/* 4096[word]	*/
#define		EEPROM_ADDR_MAX_128K	(0x1FFFU)	/* 8192[word]	*/

/*==============================================================================*/
/* EEPROMアクセス手法															*/
/*==============================================================================*/
#define EEPROM_ACCESS_PORT		0U
#define EEPROM_ACCESS_SPI		1U
#define EEPROM_ACCESS_SPI_FAST	2U

/* EEPROMのアクセス手法に応じて上記から選択すること							*/
/* 但し、EEPROM_ACCESS_SPI,EEPROM_ACCESS_SPI_FASTはEEPROM最大アドレスが32K-BIT以上のみ選択可能 */
#define EEPROM_ACCESS_TYPE EEPROM_ACCESS_PORT

/*==============================================================================*/
/* EEPROMを使用する環境に応じて上記から選択すること								*/
/*==============================================================================*/
#define		EEPROM_ADR_MAX	EEPROM_ADDR_MAX_16K		/* 16K選択 */


#endif	/* __MB91570_EEP_DRV_CONFIG_H__	*/
