/************************************************************************************************/
/* 客先名		:	標準モジュール																*/
/* 機種名		:	SSFT																		*/
/* ﾏｲｺﾝｿﾌﾄﾃｰﾏ名	:	PF																			*/
/*==============================================================================================*/
/* 作成ﾌｧｲﾙ名	:	SSFTSTD_FR81_Flash_Drv.h													*/
/* 				:	ﾌﾗｯｼｭ書き換えﾄﾞﾗｲﾊﾞﾍｯﾀﾞ														*/
/*==============================================================================================*/
/* 対象ﾏｲｺﾝ		:	MB91570 Series																*/
/*==============================================================================================*/
/* 作成ﾊﾞｰｼﾞｮﾝ	:	010101																		*/
/* 作成年月日	:	2012.07.13																	*/
/* 作成者		:	K.Horikawa																	*/
/*----------------------------------------------------------------------------------------------*/
/* 作成ﾊﾞｰｼﾞｮﾝ	:	020101																		*/
/* 作成年月日	:	2013.11.25																	*/
/* 作成者		:	Litong																		*/
/*----------------------------------------------------------------------------------------------*/
/* 変更履歴		:																				*/
/* [040101]		:	データフラッシュドライバ作成に伴い、										*/
/*					ワークフラッシュ用のレジスタアクセスの処理を削除							*/
/************************************************************************************************/
#ifndef __MB91570_FLASH_DRV_H__
#define __MB91570_FLASH_DRV_H__

/*** START_INC ***/
/********************************************************************************/
/*   Include File                                                               */
/*------------------------------------------------------------------------------*/
/*      ﾍｯﾀﾞｰﾌｧｲﾙのｲﾝｸﾙｰﾄﾞ文は、下記ﾌｧｲﾙに記載すること                          */
/********************************************************************************/
#include "SSFTxxx_FR81_Flash_Drv_Config.h"

/*==============================================================================*/
/*	typedef定義（外部公開）														*/
/*==============================================================================*/
/* ﾌﾗｯｼｭﾄﾞﾗｲﾊﾞのｽﾃｰﾀｽのenum列 */
typedef enum e_flashdrv_state{
	E_FLASHDRV_IDLE			= 0	,		/* ﾌﾗｯｼｭﾄﾞﾗｲﾊﾞのｽﾃｰﾀｽ:ｱｲﾄﾞﾙ				*/
	E_FLASHDRV_WRITE			,		/* ﾌﾗｯｼｭﾄﾞﾗｲﾊﾞのｽﾃｰﾀｽ:書き込み中		*/
	E_FLASHDRV_ERASE			,		/* ﾌﾗｯｼｭﾄﾞﾗｲﾊﾞのｽﾃｰﾀｽ:消去中			*/
	E_FLASHDRV_WRITE_ERROR		,		/* ﾌﾗｯｼｭﾄﾞﾗｲﾊﾞのｽﾃｰﾀｽ:書き込み失敗		*/
	E_FLASHDRV_ERASE_ERROR				/* ﾌﾗｯｼｭﾄﾞﾗｲﾊﾞのｽﾃｰﾀｽ:消去失敗			*/
}E_FLASHDRV_STATE;

/*==============================================================================*/
/*	外部定数																	*/
/*==============================================================================*/
#ifdef	_VERSION_CONST_DEFINE
UI_8 const C_FLASHDRV_VER[6] = {		/* ﾌﾗｯｼｭﾄﾞﾗｲﾊﾞﾊﾞｰｼﾞｮﾝ No(040202) */
	0x00U,								/* xx "0" */
	0x04U,								/* xx "4" */
	0x00U,								/* yy "0" */
	0x02U,								/* yy "2" */
	0x00U,								/* zz "0" */
	0x02U								/* zz "2" */
};
#endif	/*	_VERSION_CONST_DEFINE 	*/

/*==============================================================================*/
/*	define定義（外部公開）														*/
/*==============================================================================*/
#define D_FLASHDRV_DATASIZE		(2U)			/* 書込みﾃﾞｰﾀｻｲｽﾞ:2ﾊﾞｲﾄ			*/

/*==============================================================================*/
/*	関数ﾌﾟﾛﾄﾀｲﾌﾟ宣言（外部公開）												*/
/*==============================================================================*/

extern void FlashDrv_Init( E_INIT_TYPE req );
extern void FlashDrv_Sleep( void );
extern void FlashDrv_Refresh( void );

#ifdef FLASH_DRV_REPRGM_ENABLE
extern SI_8 FlashDrv_Read( T_FlashDrv_Addr read_addr, UI_8 *read_data, UI_16 data_size );
extern SI_8 FlashDrv_Write( T_FlashDrv_Addr write_addr, const UI_8 *write_data, UI_16 data_size );
extern SI_8 FlashDrv_Erase( T_FlashDrv_Addr erase_addr );
extern E_FLASHDRV_STATE FlashDrv_CheckStatus( void );
extern SI_8 FlashDrv_Enable( void );
extern SI_8 FlashDrv_Disable( void );
#endif	/* FLASH_DRV_REPRGM_ENABLE */

#endif	/*	__MB91570_FLASH_DRV_H__ 	*/

