/************************************************************************************************/
/* 客先名		:	標準モジュール																*/
/* 機種名		:	SSFT																		*/
/* ﾏｲｺﾝｿﾌﾄﾃｰﾏ名	:	PF																			*/
/*==============================================================================================*/
/* 作成ﾌｧｲﾙ名	:	SSFTSTD_FR81_ReloadTimer_Drv.h												*/
/* 				:	PWMドライバヘッダ															*/
/*==============================================================================================*/
/* 対象ﾏｲｺﾝ		:	MB91570 Series																*/
/*==============================================================================================*/
/* 作成ﾊﾞｰｼﾞｮﾝ	:	010104																		*/
/* 作成年月日	:	2013.05.23																	*/
/* 作成者		:	K.Uchiyama																	*/
/*----------------------------------------------------------------------------------------------*/
/* 変更履歴		:																				*/
/* [010101]		:	新規作成																	*/
/* [010102]		:																				*/
/* 	12.11.27	:	機種対応。4pulse出力分解の変更。4μsとする。								*/
/* 				:	CH23の極性を変更。															*/
/* [010103]		:																				*/
/* 	13.2.8		:	FR81S対応																	*/
/* [010104]		:	標準IF対応。起動種別の名称変更												*/
/************************************************************************************************/
#ifndef __MB91570_PWM_DRV_H__
#define __MB91570_PWM_DRV_H__

/*** START_INC ***/
/********************************************************************************/
/*   Include File                                                               */
/*------------------------------------------------------------------------------*/
/*      ﾍｯﾀﾞｰﾌｧｲﾙのｲﾝｸﾙｰﾄﾞ文は、下記ﾌｧｲﾙに記載すること                          */
/********************************************************************************/
#include "SSFTxxx_FR81_PWM_Drv_Config.h"

/*==============================================================================*/
/*	定数定義（外部公開）														*/
/*==============================================================================*/
#ifdef	_VERSION_CONST_DEFINE
UI_8 const C_PWMDRV_VER[6] = {		/* PWMドライバ ドライババージョンNo(020101) */
	0x00,							/* xx"0" */
	0x02,							/* xx"2" */
	0x00,							/* yy"0" */
	0x01,							/* yy"1" */
	0x00,							/* zz"0" */
	0x01							/* zz"1" */
};
#endif	/*	_VERSION_CONST_DEFINE 	*/

/*==============================================================================*/
/*	関数ﾌﾟﾛﾄﾀｲﾌﾟ宣言（外部公開）												*/
/*==============================================================================*/
extern void PWMDrv_Init( E_INIT_TYPE req );
extern void PWMDrv_Sleep( void );
extern void PWMDrv_Refresh( void );

extern SI_8 PWMDrv_SetDutyCycle( E_PWM_DRV_PPG_CH ch, UI_16 cycle, UI_16 duty );
extern SI_8 PWMDrv_SetDutyCycleSync( E_PWM_DRV_PPG_CH ch1, UI_16 cycle, UI_16 duty1, E_PWM_DRV_PPG_CH ch2, UI_16 duty2 );
extern SI_8 PWMDrv_ReqIntrClr( E_PWM_DRV_PPG_CH ch );
extern SI_8 PWMDrv_ReqIntrDisable( E_PWM_DRV_PPG_CH ch );
extern SI_8 PWMDrv_ReqIntrEnable( E_PWM_DRV_PPG_CH ch );

#endif	/*	__MB91570_XXX_H__ 	*/

