/************************************************************************************************/
/* 客先名		:	標準モジュール																*/
/* 機種名		:	SSFT																		*/
/* ﾏｲｺﾝｿﾌﾄﾃｰﾏ名	:	PF																			*/
/*==============================================================================================*/
/* 作成ﾌｧｲﾙ名	:	SSFTSTD_FR81_Dmac_Drv.h														*/
/* 				:	DMACﾄﾞﾗｲﾊﾞﾍｯﾀﾞ																*/
/*==============================================================================================*/
/* 対象ﾏｲｺﾝ		:	MB91570 Series																*/
/*==============================================================================================*/
/* 作成ﾊﾞｰｼﾞｮﾝ	:	010301																		*/
/* 作成年月日	:	2015.02.06																	*/
/* 作成者		:	k.uchiyama																	*/
/*----------------------------------------------------------------------------------------------*/
/* 変更履歴		:																				*/
/* [010101]		:	新規作成																	*/
/* [010102]		:	標準IF対応																	*/
/* [010103]		:	DMAC 転送設定を可変に変更。また転送状態取得、転送要求クリアの設定関数追加。	*/
/* [010301]		:	DMA転送抑止レベルの変更。													*/
/************************************************************************************************/
#ifndef __MB91570_DMAC_DRV_H__
#define __MB91570_DMAC_DRV_H__

/*** START_INC ***/
/********************************************************************************/
/*   Include File                                                               */
/*------------------------------------------------------------------------------*/
/*      ﾍｯﾀﾞｰﾌｧｲﾙのｲﾝｸﾙｰﾄﾞ文は、下記ﾌｧｲﾙに記載すること                          */
/********************************************************************************/
#include "SSFTxxx_FR81_Dmac_Drv_Config.h"


/*==============================================================================*/
/*	typedef定義（外部公開）														*/
/*==============================================================================*/
typedef struct {
	E_DMACDRV_CH	dmac_ch;					/* DMAC転送チャンネル */
	UI_8			dmac_mode;					/* DMAC 転送モード */
	UI_8			dmac_bussize;				/* DMAC 転送サイズ */
	UI_8			dmac_blocksize;				/* DMAC ブロックサイズ	 */
	UI_8			dmac_move_from_add;			/* DMAC 転送元のアドレス増減固定設定 */
	UI_8			dmac_move_to_add;			/* DMAC 転送先のアドレス増減固定設定 */
	UI_16			dmac_data_forword_number;	/* DMAC転送回数 */
	UI_32			dmac_forword_from_add;		/* DMAC転送元アドレス */
	UI_32			dmac_forword_to_add;		/* DMAC転送先アドレス */
} T_DmacDrv_Info;


typedef UI_16	T_DmacDrv_State;	/* マイコンに合わせて DMA転送状態を定義     */
									/* FR81マイコンの転送状態は、UI_16として使用  */

/*==============================================================================*/
/*	定数定義（外部公開）														*/
/*==============================================================================*/
#ifdef	_VERSION_CONST_DEFINE
UI_8 const C_DMACDRV_VER[6] = {		/* DMACドライバ ドライババージョンNo(010301) */
	0x00,							/* xx"0" */
	0x01,							/* xx"1" */
	0x00,							/* yy"0" */
	0x03,							/* yy"3" */
	0x00,							/* zz"0" */
	0x01,							/* zz"1" */
};
#endif	/*	_VERSION_CONST_DEFINE 	*/

/*==============================================================================*/
/*	関数ﾌﾟﾛﾄﾀｲﾌﾟ宣言（外部公開）												*/
/*==============================================================================*/

extern void DmacDrv_Ctrl( const T_DmacDrv_Info* dmac );
extern void DmacDrv_IntrTransComplete(E_DMACDRV_CH ch);
extern T_DmacDrv_State DmacDrv_GetTransState( E_DMACDRV_CH ch );
extern SI_8 DmacDrv_SetDmaClrReqReg( E_DMACDRV_ICSEL num, UI_8 select);

extern void DmacDrv_Init( E_INIT_TYPE req );
extern void DmacDrv_Sleep( void );
extern void DmacDrv_Refresh( void );

#endif	/*	__MB91570_DMAC_DRV_H__ 	*/

