/************************************************************************************************/
/* 客先名		:	標準モジュール																*/
/* 機種名		:	SSFT																		*/
/* ﾏｲｺﾝｿﾌﾄﾃｰﾏ名	:	PF																			*/
/*==============================================================================================*/
/* 作成ﾌｧｲﾙ名	:	SSFTSTD_FR81_ReloadTimer_Drv.h												*/
/* 				:	ﾘﾛｰﾄﾞﾀｲﾏﾄﾞﾗｲﾊﾞﾍｯﾀﾞ															*/
/*==============================================================================================*/
/* 対象ﾏｲｺﾝ		:	MB91570 Series																*/
/*==============================================================================================*/
/* 作成ﾊﾞｰｼﾞｮﾝ	:	020201																		*/
/* 作成年月日	:	2015.12.09																	*/
/* 作成者		:	R.Hiroi																		*/
/*----------------------------------------------------------------------------------------------*/
/* 変更履歴		:																				*/
/* [010101]		:	新規作成																	*/
/*				:	J36A対応。レジスタ設定値変更。												*/
/* [010102]		:	標準IF対応。起動種別の名称変更												*/
/*				:	標準IF対応の指摘刈り取り													*/
/* 2013.11.19	:	アンダーフローフラグ取得IF追加												*/
/* [020101]		:	上記「アンダーフローフラグ取得IF追加」を正式にVM登録						*/
/* [020201]		:	タイマ値取得関数の修正														*/
/************************************************************************************************/
#ifndef __MB91570_RELOADTIMER_DRV_H__
#define __MB91570_RELOADTIMER_DRV_H__

/*** START_INC ***/
/********************************************************************************/
/*   Include File                                                               */
/*------------------------------------------------------------------------------*/
/*      ﾍｯﾀﾞｰﾌｧｲﾙのｲﾝｸﾙｰﾄﾞ文は、下記ﾌｧｲﾙに記載すること                          */
/********************************************************************************/
#include "SSFTxxx_FR81_ReloadTimer_Drv_Config.h"

/*==============================================================================*/
/*	typedef定義（外部公開）														*/
/*==============================================================================*/
typedef UI_16	T_ReloadTimeDrv_Cnt;	/* マイコンに合わせて T_ReloadTimeDrv_Cntを定義     */
										/* FR81マイコンのシングルモードは、UI_16として使用  */
typedef UI_32	T_ReloadTimeDrv_ReloadRegAddr;
										/* マイコンに合わせて T_ReloadTimeDrv_ReloadRegAddrを定義     */
										/* FR81マイコンでは、UI_32として使用  */

/*==============================================================================*/
/*	定数定義（外部公開）														*/
/*==============================================================================*/
#ifdef	_VERSION_CONST_DEFINE
UI_8 const C_RELOADTIMERDRV_VER[6] = {		/* リロードタイマドライバ ドライババージョンNo(020201) */
	0x00,							/* xx"0" */
	0x02,							/* xx"2" */
	0x00,							/* yy"0" */
	0x02,							/* yy"2" */
	0x00,							/* zz"0" */
	0x01,							/* zz"1" */
};
#endif	/*	_VERSION_CONST_DEFINE 	*/
/*==============================================================================*/
/*	関数ﾌﾟﾛﾄﾀｲﾌﾟ宣言（外部公開）												*/
/*==============================================================================*/

extern void ReloadTmDrv_Ctrl( E_RELOADTIMERDRV_CH ch, T_ReloadTimeDrv_Cnt cycle, UI_8 act );
extern void ReloadTmDrv_ReqUnderFlowClr( E_RELOADTIMERDRV_CH ch );
extern UI_8 ReloadTmDrv_ReqUnderFlowGet( E_RELOADTIMERDRV_CH ch );
extern T_ReloadTimeDrv_Cnt ReloadTmDrv_GetTm( E_RELOADTIMERDRV_CH ch );

extern void ReloadTmDrv_Init( E_INIT_TYPE req );
extern void ReloadTmDrv_Sleep( void );
extern void ReloadTmDrv_Refresh( void );
extern UI_8 ReloadTmDrv_GetTmCntEnaStat( E_RELOADTIMERDRV_CH ch );
extern T_ReloadTimeDrv_ReloadRegAddr ReloadTmDrv_GetReloadRegAddr( E_RELOADTIMERDRV_CH ch );

#endif	/*	__MB91570_RELOADTIMER_DRV_H__ */

