/********************************************************************************/
/* 客先名		:	標準モジュール												*/
/* 機種名		:	SSFT														*/
/* ﾏｲｺﾝｿﾌﾄﾃｰﾏ名	:	PF															*/
/*==============================================================================*/
/* 作成ﾌｧｲﾙ名	:	SSFTSTD_FR81_Eep_Drv.c										*/
/* 				:	EEPROMドライバ(MicroWire)ﾓｼﾞｭｰﾙ								*/
/*==============================================================================*/
/* 対象ﾏｲｺﾝ		:	MB91570 Series												*/
/*==============================================================================*/
/* 作成ﾊﾞｰｼﾞｮﾝ	:	050101														*/
/* 作成年月日	:	2015.01.12													*/
/* 作成者		:	M.Koide														*/
/*------------------------------------------------------------------------------*/
/* 変更履歴		:																*/
/* [010101]		:	新規作成													*/
/* [010102]		:																*/
/* [010103]		:	・ポートアクセス処理の変更									*/
/* [010105]		:	・typedef削除												*/
/*					・SDES対応													*/
/*					・アクセスシーケンスの見直し								*/
/*					・EEPROMサイズ 16KBに対応									*/
/* [010201]		:	・ROM容量削減対応											*/
/* [010202]     :   ・コメントアウト修正										*/
/* [010204]		:	レジスタの定義名変更										*/
/* [020101]		:	128K-bit対応(連続リードIF追加)								*/
/* [020201]		:	関数マクロ(WAIT)追加、書込み中の書込み許可削除				*/
/* [030101]		:	SPI通信(DMA)対応											*/
/* [030201]		:	32bit対応,SDESエラー対応									*/
/*					EepDrv_ReadDataNWordFast()に対して							*/
/*					・引数:read_size=0の時のガード処理追加						*/
/*					・SPIレジスタ名直接記載箇所修正								*/
/* [040101]		:	SPIアクセス開始IF関数追加									*/
/* [050101]		:	連続リードIF関数変更、SPIドライバIF関数名修正				*/
/********************************************************************************/

/*** START_INC ***/
/********************************************************************************/
/*   Include File                                                               */
/*------------------------------------------------------------------------------*/
/*      ﾍｯﾀﾞｰﾌｧｲﾙのｲﾝｸﾙｰﾄﾞ文は、下記ﾌｧｲﾙに記載すること                          */
/********************************************************************************/
#include	"SSFTSTD_Macro.h"
#include	"SSFTSTD_Type.h"
#include	"mb91570.h"

#define		__MB91570_EEP_DRV_INTERNAL__
#include	"SSFTSTD_FR81_Eep_Drv.h"

/********************************************************************************/
/*	内部マクロ定義																*/
/********************************************************************************/
#if (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_32K ) || (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_64K ) ||\
	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_128K)		/* EEPROMサイズ:32K[bit]以上 */
/* ポート、SPI、SPI高速アクセス用 */
#define EEP_STAT_WIP	(0x01U)						/* EEPROMステータスレジスタ.WIP(書込み中:1):BIT0 */
#if (EEPROM_ACCESS_TYPE == EEPROM_ACCESS_SPI_FAST) || (EEPROM_ACCESS_TYPE == EEPROM_ACCESS_SPI)
/* SPI、SPI高速アクセス用 */
#define EEP_DUMMY_CMD	(0U)
#define EEP_RDSTAT_CMD	(1U)
#define EEP_RD_CMD		(2U)
#define EEP_WR_CMD		(3U)
#define EEP_WRENBL_CMD	(4U)
#define EEP_WRDSBL_CMD	(5U)
#define EEP_CMD_MAX		(6U)
#endif
#endif

/********************************************************************************/
/*	内部データ型定義															*/
/********************************************************************************/
/* Bit/Byteアクセス用構造体 */

typedef	union {			/* 1[byte]単位で操作 */
	UI_16	WORD;		/* (2[byte] data) */
	struct {
		UI_8	H;
		UI_8	L;
	} BYTE;
} WORD_BYTE;

typedef	union {			/* 1[byte]単位で操作 */
	UI_32	DWORD;		/* (4[byte] data) */
	struct {
		UI_8	HH;
		UI_8	HL;
		UI_8	LH;
		UI_8	LL;
	} BYTE;
	struct {
		UI_16	H;
		UI_16	L;
	} WORD;
} DWORD_BYTE;

typedef	union {			/* 1[byte],2[byte]単位で操作 */
	UI_32	DWORD;		/* (4[byte] data) */
	struct {
		UI_16	H;
		UI_16	L;
	} WORD;
	struct {
		UI_8	HH;
		UI_8	HL;
		UI_8	LH;
		UI_8	LL;
	} BYTE;
} DWORD_WORD_BYTE;

typedef	union {			/* 1[bit]単位で操作 */
	UI_8	BYTE;		/* (1[byte] data) */
	struct {
		BITFIELD	B7:1;
		BITFIELD	B6:1;
		BITFIELD	B5:1;
		BITFIELD	B4:1;
		BITFIELD	B3:1;
		BITFIELD	B2:1;
		BITFIELD	B1:1;
		BITFIELD	B0:1;
	} BIT;
} BYTE_BIT;

typedef	union {			/* 1[bit]単位で操作 */
	UI_16	WORD;		/* (2[byte] data) */
	struct {
		BITFIELD	B15:1;
		BITFIELD	B14:1;
		BITFIELD	B13:1;
		BITFIELD	B12:1;
		BITFIELD	B11:1;
		BITFIELD	B10:1;
		BITFIELD	B09:1;
		BITFIELD	B08:1;
		BITFIELD	B07:1;
		BITFIELD	B06:1;
		BITFIELD	B05:1;
		BITFIELD	B04:1;
		BITFIELD	B03:1;
		BITFIELD	B02:1;
		BITFIELD	B01:1;
		BITFIELD	B00:1;
	} BIT;
} WORD_BIT;


/*==============================================================================*/
/*	内部変数																	*/
/*==============================================================================*/
#if (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_32K ) || (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_64K ) ||\
	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_128K)		/* EEPROMサイズ:32K[bit]以上 */
#if (EEPROM_ACCESS_TYPE == EEPROM_ACCESS_SPI_FAST)	/* SPI高速アクセス用 */
static T_DmacDrv_Info EepTxDmacInfo;				/* Eeprom送信用DMAC制御情報 */
static T_DmacDrv_Info EepRxDmacInfo;				/* Eeprom受信用DMAC制御情報 */
#endif
#if (EEPROM_ACCESS_TYPE == EEPROM_ACCESS_SPI_FAST) || (EEPROM_ACCESS_TYPE == EEPROM_ACCESS_SPI)
/* SPI、SPI高速アクセス用 */
static SI_8	Eep_spi_timeout;						/* Eeprom(SPI)ドライバでのタイムアウト発生有無 */
#endif
#endif


/*================================================================================================*/
/* $$$$	Definition of data table                                                                  */
/*================================================================================================*/
#if (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_32K ) || (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_64K ) ||\
	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_128K)		/* EEPROMサイズ:32K[bit]以上 */
#if (EEPROM_ACCESS_TYPE == EEPROM_ACCESS_SPI_FAST) || (EEPROM_ACCESS_TYPE == EEPROM_ACCESS_SPI)
/* SPI、SPI高速アクセス用 */
static const UI_8 C_EepCmd[EEP_CMD_MAX] =
{
	0xFFU,			/* [0]ダミーデーター */
	0x05U,			/* [1]Eepromステータスレジスタ読込み */
	0x03U,			/* [2]Eepromデータ読込み */
	0x02U,			/* [3]Eepromデータ書込み */
	0x06U,			/* [4]Eepromデータ書込み許可 */
	0x04U,			/* [5]Eepromデータ書込み禁止 */
};
#endif
#endif

/****************************************************************************************/
/*	内部静的関数定義																	*/
/****************************************************************************************/
/*	注意点:	・外部で使用しないものについてはstatic関数とする。							*/
/*			・必要に応じてinline展開すること											*/
/*				→ EEPROM初期読込処理時間短縮対策等										*/
/*			・inline展開する際はROM容量に気をつけること									*/
/****************************************************************************************/

#if (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_32K ) || (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_64K ) ||\
	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_128K)		/* EEPROMサイズ:32K[bit]以上 */
/* ポートアクセス、SPI、SPI高速アクセス共通 */
static void eep_drv_chip_select(void);				/* CS(有効),DI,SKのLow設定処理 */
static void eep_drv_chip_notselect(void);			/* CS(無効),DI,SKのHigh設定処理 */
static UI_8 eepdrv_read_statreg(void);				/* ステータスレジスタリード(8[bit]) */
#if (EEPROM_ACCESS_TYPE == EEPROM_ACCESS_SPI_FAST) || (EEPROM_ACCESS_TYPE == EEPROM_ACCESS_SPI)
/* SPI、SPI高速アクセス用 */
static void eep_read_cmd(UI_16 addr);				/* リードコマンド設定 */
static void spi_cmd_tx( UI_8 eepcmd );				/* SPIコマンド送信 */
static void spi_byte_tx(const UI_8 *byte);			/* SPIデータ送信 */
static void spi_byte_tx_wait(void);					/* SPI送信待ち(1BYTE) */
static UI_8 spi_byte_rx(void);						/* SPI受信(1BYTE) */
#else
/* ポートアクセス用 */
static void eep_drv_di_send_16(UI_16 data_in);		/* EEPROM DI送信(16[bit]) */
static UI_8 eep_drv_do_receive_8(void);				/* EEPROM DO受信(8[bit]) */
static UI_16 eep_drv_do_receive_16(void);			/* EEPROM DO受信(16[bit]) */
static void eep_drv_sk_edge(void);					/* SK有効edge(->H->L)設定処理 */
static void eep_drv_di_setup(void);					/* DI setup時間用wait設定処理 */
static void eep_drv_di_hold(void);					/* DI hold時間用wait設定処理 */
#endif
#else
/* EEPROMサイズ:1,2,4,8,16K[bit]*/
#if		(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_8K) || (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_16K)
static	void	eep_drv_di_send_10(UI_16 data_in);	/* EEPROM DI送信(10[bit]) */
#elif	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_1K)
static	void	eep_drv_di_send_6(UI_8 data_in);	/* EEPROM DI送信(6[bit]) */
#endif
static	void	eep_drv_di_send_8(UI_8 data_in);	/* EEPROM DI送信(8[bit]) */
static	UI_16	eep_drv_do_receive_16(void);		/* EEPROM DO受信(16[bit]) */
static void eep_drv_chip_select(void);				/* CS有効edge(->H)及びDI,SKのLow設定処理 */
static void eep_drv_sk_edge_continue(void);			/* SK有効edge(->H->L)設定処理（次もSK edgeの場合) */
static void eep_drv_sk_edge_preread(void);			/* SK有効edge(->H->L)設定処理 (次が3点多数決の場合) */
static void eep_drv_sk_edge(void);					/* SK有効edge(->H->L)設定処理 (次もSK edgeの場合には使用禁止) */
static void eep_drv_di_setup(void);					/* DI setup時間用wait設定処理 */
static void eep_drv_di_hold(void);					/* DI hold時間用wait設定処理 */
static void eep_drv_do_read_tsv(void);				/* CS立ち上げ後DO読込前のwait設定処理 */
#endif

#if (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_32K ) || (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_64K ) ||\
	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_128K)		/* EEPROMサイズ:32K[bit]以上 */
#if (EEPROM_ACCESS_TYPE == EEPROM_ACCESS_SPI)		/* SPIアクセス用関数 開始 */
/****************************************************************************************/
/*	[モジュール名]	eep_drv_chip_select	[名称]	CS有効レベル設定						*/
/*======================================================================================*/
/*	[処理概要]	・CSポートを LOWに設定する。											*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_chip_select(void)									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・CSセットアップ時間調整用												*/
/****************************************************************************************/
static void eep_drv_chip_select(void)
{
	R_PO_EEPMW_CS = D_LOW;	/* CSをL出力 */
}

/****************************************************************************************/
/*	[モジュール名]	eep_drv_chip_notselect	[名称]	CS無効レベル設定					*/
/*======================================================================================*/
/*	[処理概要]	・CSポートを HIGHに設定する。											*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_chip_notselect(void)								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・CS非アクティブ設定													*/
/****************************************************************************************/
static void eep_drv_chip_notselect(void)
{
	R_PO_EEPMW_CS = D_HIGH;	/* CSをH出力 */
}

/****************************************************************************************/
/*	[モジュール名]	eepdrv_read_statreg	[名称]	ステータスレジスタ読み出し				*/
/*======================================================================================*/
/*	[処理概要]	ステータスレジスタ読み出し												*/
/*======================================================================================*/
/*	[記述形式]	UI_8 eepdrv_read_statreg(void)											*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_8 statreg															*/
/*======================================================================================*/
/*	[ 備  考 ]																			*/
/****************************************************************************************/
static UI_8 eepdrv_read_statreg(void)
{
	UI_8 statreg;

	/* CS = L */
	eep_drv_chip_select();

	/* ステータスレジスタ読み出し命令:8bit 00000101 */
	spi_cmd_tx( EEP_RDSTAT_CMD );

	/* ステータスレジスタ読み出し */
	statreg = spi_byte_rx();

	/* CS = H */
	eep_drv_chip_notselect();
	return statreg;
}

/****************************************************************************************/
/*	[モジュール名]	eep_read_cmd					[名称]リードコマンド用設定			*/
/*======================================================================================*/
/*	[処理概要]	リードコマンドとアドレスを送信する。									*/
/*======================================================================================*/
/*	[記述形式]	void eep_read_cmd(addr)													*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16 addr			読み込みアドレス									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
static void eep_read_cmd(UI_16 addr)
{
	UI_16	read_addr;
	UI_8	spi_tx;

	Eep_spi_timeout = D_OK;

	/* 全40bit 命令:8bit,アドレス:16bit,データ:16bit(2bye) */
	read_addr = addr & 0x3FFFU;	/* 上位2bitマスク */

	/* CS = L */
	eep_drv_chip_select();
	
	/* READ命令:8bit 0x03(00000011) */
	spi_cmd_tx( EEP_RD_CMD );

	spi_tx = (UI_8)((read_addr & 0xFF00u) >> 8);	/* 上位アドレス送信 */
	spi_byte_tx(&spi_tx);

	spi_tx = (UI_8)(read_addr & 0x00FFu);			/* 下位アドレス送信 */
	spi_byte_tx(&spi_tx);
}

/****************************************************************************************/
/*	[モジュール名]	spi_cmd_tx						[名称]SPIのコマンド送信				*/
/*======================================================================================*/
/*	[処理概要]	SPI通信による1BYTE(コマンド)の送信を行なう。							*/
/*======================================================================================*/
/*	[記述形式]	void spi_cmd_tx( UI_8 eepcmd )											*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_8 eepcmd			Eepromコマンドインデックス							*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	Eep_spi_timeout:D_NG(タイムアウト発生),D_OK(タイムアウト未発生)			*/
/****************************************************************************************/
static void spi_cmd_tx( UI_8 eepcmd )
{
	SpiDrv_SetTxData( EEP_USED_CH, &C_EepCmd[eepcmd], D_NULL );		/* 引数に指定されたコマンド送信 */
	spi_byte_tx_wait();
}

/****************************************************************************************/
/*	[モジュール名]	spi_byte_tx						[名称]SPIの1BYTE送信				*/
/*======================================================================================*/
/*	[処理概要]	SPI通信による1BYTE(データ,アドレス)の送信を行なう。						*/
/*======================================================================================*/
/*	[記述形式]	void spi_byte_tx( const UI_8 *byte )									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_8 *byte			送信データ(1byte)									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	Eep_spi_timeout:D_NG(タイムアウト発生),D_OK(タイムアウト未発生)			*/
/****************************************************************************************/
static void spi_byte_tx( const UI_8 *byte )
{
	SpiDrv_SetTxData( EEP_USED_CH, byte, D_NULL );
	spi_byte_tx_wait();
}

/****************************************************************************************/
/*	[モジュール名]	spi_byte_tx_wait				[名称]SPIの1BYTE送信待ち			*/
/*======================================================================================*/
/*	[処理概要]	SPI通信による1BYTEの送信完了(受信完了)を待つ。							*/
/*======================================================================================*/
/*	[記述形式]	void spi_byte_tx_wait(void)												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	Eep_spi_timeout:D_NG(タイムアウト発生),D_OK(タイムアウト未発生)			*/
/****************************************************************************************/
static void spi_byte_tx_wait( void )
{
	SI_8 spi_rx_stat;
	UI_16 cnt;
	UI_8 read_dummy;

	spi_rx_stat = SpiDrv_GetRxStat( EEP_USED_CH );
	for ( cnt = 0U; ( Eep_spi_timeout == D_OK ) && ( spi_rx_stat == D_NG ); cnt++ ) {
		SysClkDrv_UsecWait(EEP_SPI_WATCH);
		spi_rx_stat = SpiDrv_GetRxStat( EEP_USED_CH );
		if (cnt >= EEP_SPI_WAIT_1BYTE) {
			Eep_spi_timeout = D_NG;
		}
	}
	read_dummy = SpiDrv_GetRxData( EEP_USED_CH );	/* 受信データ読込みによりRDRF(受信データフル)クリア */
	SpiDrv_ClrErr( EEP_USED_CH );					/* 受信エラーフラグクリア */
}
/****************************************************************************************/
/*	[モジュール名]	spi_byte_rx						[名称]SPIの1BYTE受信				*/
/*======================================================================================*/
/*	[処理概要]	SPI通信による1BYTEの受信を行なう。										*/
/*======================================================================================*/
/*	[記述形式]	UI_8 spi_byte_rx( void )												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_8	read_data					受信データ(1BYTE)					*/
/*======================================================================================*/
/*	[ 備  考 ]	ダミーデータを送信する事で受信実施										*/
/*				Eep_spi_timeout:D_NG(タイムアウト発生),D_OK(タイムアウト未発生)			*/
/****************************************************************************************/
static UI_8 spi_byte_rx( void )
{
	UI_8 read_data;
	SI_8 spi_rx_stat;
	UI_16 cnt;

	SpiDrv_SetTxData( EEP_USED_CH, &C_EepCmd[EEP_DUMMY_CMD], D_NULL );	/* ダミー送信 */
	spi_rx_stat = SpiDrv_GetRxStat( EEP_USED_CH );
	for ( cnt = 0U; ( Eep_spi_timeout == D_OK ) && ( spi_rx_stat == D_NG ); cnt++ ) {
		SysClkDrv_UsecWait(EEP_SPI_WATCH);
		spi_rx_stat = SpiDrv_GetRxStat( EEP_USED_CH );
		if (cnt >= EEP_SPI_WAIT_1BYTE) {
			Eep_spi_timeout = D_NG;
		}
	}
	read_data = SpiDrv_GetRxData( EEP_USED_CH );	/* 受信データ読込みによりRDRF(受信データフル)クリア */
	SpiDrv_ClrErr( EEP_USED_CH );					/* 受信エラーフラグクリア */

	return read_data;
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_StartSpiAccess	[名称]	SPIアクセス開始						*/
/*======================================================================================*/
/*	[処理概要]	SPIアクセスを開始する。													*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_StartSpiAccess(void)										*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	SPIドライバ開始関数をコール												*/
/****************************************************************************************/
void EepDrv_StartSpiAccess(void)
{
	SpiDrv_Start( EEP_USED_CH );			/* SPI通信開始要求 */
}
/****************************************************************************************/
/*	[モジュール名]	EepDrv_ChkBusy	[名称]	Busy check									*/
/*======================================================================================*/
/*	[処理概要]	Busy checkを行う。														*/
/*======================================================================================*/
/*	[記述形式]	UI_8 EepDrv_ChkBusy(void)												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_8	busy					Busy状態か否か(TRUE/FALSE)				*/
/*======================================================================================*/
/*	[ 備  考 ]	ステータスレジスタを読み出し、ビジーチェック							*/
/****************************************************************************************/
UI_8 EepDrv_ChkBusy(void)
{
	UI_8 ret_val = D_FALSE;		/* ビジーでない */
	UI_8 statreg;

	/* タイムアウト有無はIF関数実施毎の情報の為、IF関数の最初でのみ初期化 */
	Eep_spi_timeout = D_OK;

	/* レジスタアクセスによるビジーチェック */
	/* 全16bit 命令:8bit,ステータス:8bit */
	statreg = eepdrv_read_statreg();

	if ( (statreg & EEP_STAT_WIP) == EEP_STAT_WIP) { /* ステータスレジスタ.WIP == 書込み中(1) */
		ret_val = D_TRUE;	/* ビジー */
	}
	return	ret_val;
}


/****************************************************************************************/
/*	[モジュール名]	EepDrv_ReadDataWord	[名称]	EEPROM address指定1word読み出し			*/
/*======================================================================================*/
/*	[処理概要]	EEPROM address指定1word読み出しを行なう。								*/
/*======================================================================================*/
/*	[記述形式]	UI_16 EepDrv_ReadDataWord(UI_16 adr)									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16	adr						読出address(1[word]単位)				*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_16	ret_val					読出data								*/
/*======================================================================================*/
/*	[ 備  考 ]	・本処理ではEWEN,EWDSは行わない。										*/
/****************************************************************************************/
UI_16 EepDrv_ReadDataWord(UI_16 adr)
{
	UI_16 read_wk;
	UI_16 read_word;

	/* タイムアウト有無はeep_read_cmd()で初期化 */

	/* リードコマンドとアドレス送信 */
	eep_read_cmd(adr << 1);			/* ワードアドレス→バイトアドレス */

	read_wk = (UI_16)spi_byte_rx();	/* 上位データ取得 */
	read_word = read_wk << 8U;
	read_wk = (UI_16)spi_byte_rx();	/* 下位データ取得 */
	read_word |= read_wk;

	/* CS = H */
	eep_drv_chip_notselect();
	return	read_word;
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_WriteDataWord	[名称]	EEPROM address指定1word書き込み		*/
/*======================================================================================*/
/*	[処理概要]	EEPROM address指定1word書き込みを行なう。								*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_WriteDataWord( UI_16 adr, UI_16 data)						*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16	adr						書込address(1[word]単位)				*/
/*				UI_16	data					書込data								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・本処理ではEWEN,EWDSは行わない。										*/
/****************************************************************************************/
void EepDrv_WriteDataWord(UI_16 adr, UI_16 data)
{
	UI_16	wr_addr;
	UI_8	tx_hi;
	UI_8	tx_lo;

	/* タイムアウト有無はIF関数実施毎の情報の為、IF関数の最初でのみ初期化 */
	Eep_spi_timeout = D_OK;

	/* 全40bit 命令:8bit,アドレス:16bit,データライト:16bit(2bye) */
	wr_addr = adr << 1U;		/* ワードアドレス→バイトアドレス */
	wr_addr &= 0x3FFFU;		/* 上位2bitマスク */

	/* CS = L */
	eep_drv_chip_select();

	/* WRITE命令:8bit 00000010 */
	spi_cmd_tx( EEP_WR_CMD );

	/* アドレス設定:16bit */
	tx_hi = (UI_8)(( wr_addr & 0xFF00U ) >> 8U);
	tx_lo = (UI_8)(wr_addr & 0x00FFU);

	spi_byte_tx(&tx_hi);
	spi_byte_tx(&tx_lo);

	/* データライト:16bit */
	tx_hi = (UI_8)(( data & 0xFF00U ) >> 8U);
	tx_lo = (UI_8)(data & 0x00FFU);

	spi_byte_tx(&tx_hi);
	spi_byte_tx(&tx_lo);

	/* CS = H */
	eep_drv_chip_notselect();
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_Disable	[名称]	EWDS(消去,書込禁止)							*/
/*======================================================================================*/
/*	[処理概要]	WRDI(消去,書込禁止)を行なう。											*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_Disable(void)												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・WRENしたまま放置することは厳禁とする。								*/
/****************************************************************************************/
void EepDrv_Disable(void)
{
	/* タイムアウト有無はIF関数実施毎の情報の為、IF関数の最初でのみ初期化 */
	Eep_spi_timeout = D_OK;

	/* 全8bit 命令:8bit */
	
	/* CS = L */
	eep_drv_chip_select();

	/* 書込み禁止(WRDI):00000100 */
	spi_cmd_tx( EEP_WRDSBL_CMD );

	/* CS = H */
	eep_drv_chip_notselect();
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_Enable	[名称]	EWEN(消去,書込許可)							*/
/*======================================================================================*/
/*	[処理概要]	WREN(書込許可)を行なう。												*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_Enable(void)												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・WRENしたまま放置することは厳禁とする。								*/
/****************************************************************************************/
void EepDrv_Enable(void)
{
	/* タイムアウト有無はIF関数実施毎の情報の為、IF関数の最初でのみ初期化 */
	Eep_spi_timeout = D_OK;

	/* 全8bit 命令:8bit */

	/* CS = L */
	eep_drv_chip_select();

	/* 書込み許可(WREN):00000110 */
	spi_cmd_tx( EEP_WRENBL_CMD );
	/* CS = H */
	eep_drv_chip_notselect();
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_ReadDataNByte	[名称]	EEPROM address指定連続読み出し		*/
/*======================================================================================*/
/*	[処理概要]	EEPROM address指定連続読み出しを行なう。								*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_ReadDataNByte												*/
/*						( const UI_16 addr, const UI_16 read_size, UI_8 read_data[] )	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16	addr					読出address(1[byte]単位)				*/
/*				UI_16 read_size					読出サイズ(1[byte]単位)					*/
/*				UI_8  read_data[]				読出データ(1[byte]単位)					*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無																		*/
/*======================================================================================*/
/*	[ 備  考 ]	・本処理ではEWEN,EWDSは行わない。										*/
/****************************************************************************************/
void EepDrv_ReadDataNByte( const UI_16 addr, const UI_16 read_size, UI_8 read_data[] )
{
	UI_16 i;

	/* タイムアウト有無はeep_read_cmd()で初期化 */

	/* リードコマンドとアドレス送信 */
	eep_read_cmd(addr);

	/* byte単位でセット */
	for (i = 0U; i < read_size; i++) {
		read_data[i] = spi_byte_rx();
	}

	/* CS = H */
	eep_drv_chip_notselect();
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_GetTimeout	[名称]	EEPROM用通信タイムアウト発生有無取得	*/
/*======================================================================================*/
/*	[処理概要]	SPI通信によるタイムアウト発生有無取得									*/
/*======================================================================================*/
/*	[記述形式]	SI_8 EepDrv_GetTimeout(void)											*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・タイムアウト発生時は、CPU故障、ソフト設定ミス							*/
/****************************************************************************************/
SI_8 EepDrv_GetTimeout(void)
{
	return Eep_spi_timeout;
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_ReadDataNByteFast											*/
/*									[名称]EEPROM address指定連続読み出し(DMA使用)		*/
/*======================================================================================*/
/*	[処理概要]	EEPROM address指定連続読み出しを行なう。								*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_ReadDataNByteFast											*/
/*						( const UI_16 addr, const UI_16 read_size, UI_8 read_data[] )	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16	addr					読出address(1[byte]単位)				*/
/*				UI_16 read_size					読出サイズ(1[byte]単位)					*/
/*				UI_8 read_data[]				読出データ(1[byte]単位)					*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無																		*/
/*======================================================================================*/
/*	[ 備  考 ]	SPIアクセスでは空関数。													*/
/****************************************************************************************/
void EepDrv_ReadDataNByteFast( const UI_16 addr, const UI_16 read_size, UI_8 read_data[] )
{
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_ReadDataNByteFastFinish										*/
/*												[名称]EEPROM高速連続読み出し用完了確認	*/
/*======================================================================================*/
/*	[処理概要]	EEPROM 高速連続読み出し用のDMAの完了確認を行なう。						*/
/*======================================================================================*/
/*	[記述形式]	SI_8 EepDrv_ReadDataNByteFastFinish(void)								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	D_NG:タイムアウト発生													*/
/*======================================================================================*/
/*	[ 備  考 ]	SPIアクセスでは空関数。													*/
/****************************************************************************************/
SI_8 EepDrv_ReadDataNByteFastFinish(void)
{
	return D_NG;
}
#endif	/* SPIアクセス用関数 終了 */

#if (EEPROM_ACCESS_TYPE == EEPROM_ACCESS_SPI_FAST)	/* SPI高速アクセス用関数 開始 */
/****************************************************************************************/
/*	[モジュール名]	eep_drv_chip_select	[名称]	CS有効レベル設定						*/
/*======================================================================================*/
/*	[処理概要]	・CSポートを LOWに設定する。											*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_chip_select(void)									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・CSセットアップ時間調整用												*/
/****************************************************************************************/
static void eep_drv_chip_select(void)
{
	R_PO_EEPMW_CS = D_LOW;	/* CSをL出力 */
}

/****************************************************************************************/
/*	[モジュール名]	eep_drv_chip_notselect	[名称]	CS無効レベル設定					*/
/*======================================================================================*/
/*	[処理概要]	・CSポートを HIGHに設定する。											*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_chip_notselect(void)								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・CS非アクティブ設定													*/
/****************************************************************************************/
static void eep_drv_chip_notselect(void)
{
	R_PO_EEPMW_CS = D_HIGH;	/* CSをH出力 */
}

/****************************************************************************************/
/*	[モジュール名]	eepdrv_read_statreg	[名称]	ステータスレジスタ読み出し				*/
/*======================================================================================*/
/*	[処理概要]	ステータスレジスタ読み出し												*/
/*======================================================================================*/
/*	[記述形式]	UI_8 eepdrv_read_statreg(void)											*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_8 statreg															*/
/*======================================================================================*/
/*	[ 備  考 ]																			*/
/****************************************************************************************/
static UI_8 eepdrv_read_statreg(void)
{
	UI_8 statreg;

	/* CS = L */
	eep_drv_chip_select();

	/* ステータスレジスタ読み出し命令:8bit 00000101 */
	spi_cmd_tx( EEP_RDSTAT_CMD );

	/* ステータスレジスタ読み出し */
	statreg = spi_byte_rx();

	/* CS = H */
	eep_drv_chip_notselect();
	return statreg;
}

/****************************************************************************************/
/*	[モジュール名]	eep_read_cmd					[名称]リードコマンド用設定			*/
/*======================================================================================*/
/*	[処理概要]	リードコマンドとアドレスを送信する。									*/
/*======================================================================================*/
/*	[記述形式]	void eep_read_cmd(addr)													*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16 addr			読み込みアドレス									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
static void eep_read_cmd(UI_16 addr)
{
	UI_16	read_addr;
	UI_8	spi_tx;

	Eep_spi_timeout = D_OK;

	/* 全40bit 命令:8bit,アドレス:16bit,データ:16bit(2bye) */
	read_addr = addr & 0x3FFFU;	/* 上位2bitマスク */

	/* CS = L */
	eep_drv_chip_select();
	
	/* READ命令:8bit 0x03(00000011) */
	spi_cmd_tx( EEP_RD_CMD );

	spi_tx = (UI_8)((read_addr & 0xFF00u) >> 8);	/* 上位アドレス送信 */
	spi_byte_tx(&spi_tx);

	spi_tx = (UI_8)(read_addr & 0x00FFu);			/* 下位アドレス送信 */
	spi_byte_tx(&spi_tx);
}

/****************************************************************************************/
/*	[モジュール名]	spi_cmd_tx						[名称]SPIのコマンド送信				*/
/*======================================================================================*/
/*	[処理概要]	SPI通信による1BYTE(コマンド)の送信を行なう。							*/
/*======================================================================================*/
/*	[記述形式]	void spi_cmd_tx( UI_8 eepcmd )											*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_8 eepcmd			Eepromコマンドインデックス							*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	Eep_spi_timeout:D_NG(タイムアウト発生),D_OK(タイムアウト未発生)			*/
/****************************************************************************************/
static void spi_cmd_tx( UI_8 eepcmd )
{
	SpiDrv_SetTxData( EEP_USED_CH, &C_EepCmd[eepcmd], D_NULL );		/* 引数に指定されたコマンド送信 */
	spi_byte_tx_wait();
}

/****************************************************************************************/
/*	[モジュール名]	spi_byte_tx						[名称]SPIの1BYTE送信				*/
/*======================================================================================*/
/*	[処理概要]	SPI通信による1BYTE(データ,アドレス)の送信を行なう。						*/
/*======================================================================================*/
/*	[記述形式]	void spi_byte_tx( const UI_8 *byte )									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_8 *byte			送信データ(1byte)									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	Eep_spi_timeout:D_NG(タイムアウト発生),D_OK(タイムアウト未発生)			*/
/****************************************************************************************/
static void spi_byte_tx( const UI_8 *byte )
{
	SpiDrv_SetTxData( EEP_USED_CH, byte, D_NULL );
	spi_byte_tx_wait();
}

/****************************************************************************************/
/*	[モジュール名]	spi_byte_tx_wait				[名称]SPIの1BYTE送信待ち			*/
/*======================================================================================*/
/*	[処理概要]	SPI通信による1BYTEの送信完了(受信完了)を待つ。							*/
/*======================================================================================*/
/*	[記述形式]	void spi_byte_tx_wait(void)												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	Eep_spi_timeout:D_NG(タイムアウト発生),D_OK(タイムアウト未発生)			*/
/****************************************************************************************/
static void spi_byte_tx_wait( void )
{
	SI_8 spi_rx_stat;
	UI_16 cnt;
	UI_8 read_dummy;

	spi_rx_stat = SpiDrv_GetRxStat( EEP_USED_CH );
	for ( cnt = 0U; ( Eep_spi_timeout == D_OK ) && ( spi_rx_stat == D_NG ); cnt++ ) {
		SysClkDrv_UsecWait(EEP_SPI_WATCH);
		spi_rx_stat = SpiDrv_GetRxStat( EEP_USED_CH );
		if (cnt >= EEP_SPI_WAIT_1BYTE) {
			Eep_spi_timeout = D_NG;
		}
	}

	read_dummy = SpiDrv_GetRxData( EEP_USED_CH );	/* 受信データ読込みによりRDRF(受信データフル)クリア */
	SpiDrv_ClrErr( EEP_USED_CH );					/* 受信エラーフラグクリア */
}
/****************************************************************************************/
/*	[モジュール名]	spi_byte_rx						[名称]SPIの1BYTE受信				*/
/*======================================================================================*/
/*	[処理概要]	SPI通信による1BYTEの受信を行なう。										*/
/*======================================================================================*/
/*	[記述形式]	UI_8 spi_byte_rx( void )												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_8	read_data					受信データ(1BYTE)					*/
/*======================================================================================*/
/*	[ 備  考 ]	ダミーデータを送信する事で受信実施										*/
/*				Eep_spi_timeout:D_NG(タイムアウト発生),D_OK(タイムアウト未発生)			*/
/****************************************************************************************/
static UI_8 spi_byte_rx( void )
{
	UI_8 read_data;
	SI_8 spi_rx_stat;
	UI_16 cnt;

	SpiDrv_SetTxData( EEP_USED_CH, &C_EepCmd[EEP_DUMMY_CMD], D_NULL );	/* ダミー送信 */
	spi_rx_stat = SpiDrv_GetRxStat( EEP_USED_CH );
	for ( cnt = 0U; ( Eep_spi_timeout == D_OK ) && ( spi_rx_stat == D_NG ); cnt++ ) {
		SysClkDrv_UsecWait(EEP_SPI_WATCH);
		spi_rx_stat = SpiDrv_GetRxStat( EEP_USED_CH );
		if (cnt >= EEP_SPI_WAIT_1BYTE) {
			Eep_spi_timeout = D_NG;
		}
	}

	read_data = SpiDrv_GetRxData( EEP_USED_CH );	/* 受信データ読込みによりRDRF(受信データフル)クリア */
	SpiDrv_ClrErr( EEP_USED_CH );					/* 受信エラーフラグクリア */

	return read_data;
}
/****************************************************************************************/
/*	[モジュール名]	EepDrv_StartSpiAccess	[名称]	SPIアクセス開始						*/
/*======================================================================================*/
/*	[処理概要]	SPIアクセスを開始する。													*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_StartSpiAccess(void)										*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	SPIドライバ開始関数をコール												*/
/****************************************************************************************/
void EepDrv_StartSpiAccess(void)
{
	SpiDrv_Start( EEP_USED_CH );			/* SPI通信開始要求 */
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_ChkBusy	[名称]	Busy check									*/
/*======================================================================================*/
/*	[処理概要]	Busy checkを行う。														*/
/*======================================================================================*/
/*	[記述形式]	UI_8 EepDrv_ChkBusy(void)												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_8	busy					Busy状態か否か(TRUE/FALSE)				*/
/*======================================================================================*/
/*	[ 備  考 ]	ステータスレジスタを読み出し、ビジーチェック							*/
/****************************************************************************************/
UI_8 EepDrv_ChkBusy(void)
{
	UI_8 ret_val = D_FALSE;		/* ビジーでない */
	UI_8 statreg;

	/* タイムアウト有無はIF関数実施毎の情報の為、IF関数の最初でのみ初期化 */
	Eep_spi_timeout = D_OK;

	/* レジスタアクセスによるビジーチェック */
	/* 全16bit 命令:8bit,ステータス:8bit */
	statreg = eepdrv_read_statreg();

	if ( (statreg & EEP_STAT_WIP) == EEP_STAT_WIP) { /* ステータスレジスタ.WIP == 書込み中(1) */
		ret_val = D_TRUE;	/* ビジー */
	}
	return	ret_val;
}


/****************************************************************************************/
/*	[モジュール名]	EepDrv_ReadDataWord	[名称]	EEPROM address指定1word読み出し			*/
/*======================================================================================*/
/*	[処理概要]	EEPROM address指定1word読み出しを行なう。								*/
/*======================================================================================*/
/*	[記述形式]	UI_16 EepDrv_ReadDataWord(UI_16 adr)									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16	adr						読出address(1[word]単位)				*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_16	ret_val					読出data								*/
/*======================================================================================*/
/*	[ 備  考 ]	・本処理ではEWEN,EWDSは行わない。										*/
/****************************************************************************************/
UI_16 EepDrv_ReadDataWord(UI_16 adr)
{
	UI_16 read_wk;
	UI_16 read_word;

	/* タイムアウト有無はeep_read_cmd()で初期化 */

	/* リードコマンドとアドレス送信 */
	eep_read_cmd(adr << 1);			/* ワードアドレス→バイトアドレス */

	read_wk = (UI_16)spi_byte_rx();	/* 上位データ取得 */
	read_word = read_wk << 8U;
	read_wk = (UI_16)spi_byte_rx();	/* 下位データ取得 */
	read_word |= read_wk;

	/* CS = H */
	eep_drv_chip_notselect();
	return	read_word;
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_WriteDataWord	[名称]	EEPROM address指定1word書き込み		*/
/*======================================================================================*/
/*	[処理概要]	EEPROM address指定1word書き込みを行なう。								*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_WriteDataWord( UI_16 adr, UI_16 data)						*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16	adr						書込address(1[word]単位)				*/
/*				UI_16	data					書込data								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・本処理ではEWEN,EWDSは行わない。										*/
/****************************************************************************************/
void EepDrv_WriteDataWord(UI_16 adr, UI_16 data)
{
	UI_16	wr_addr;
	UI_8	tx_hi;
	UI_8	tx_lo;

	/* タイムアウト有無はIF関数実施毎の情報の為、IF関数の最初でのみ初期化 */
	Eep_spi_timeout = D_OK;

	/* 全40bit 命令:8bit,アドレス:16bit,データライト:16bit(2bye) */
	wr_addr = adr << 1U;	/* ワードアドレス→バイトアドレス */
	wr_addr &= 0x3FFFU;		/* 上位2bitマスク */

	/* CS = L */
	eep_drv_chip_select();

	/* WRITE命令:8bit 00000010 */
	spi_cmd_tx( EEP_WR_CMD );

	/* アドレス設定:16bit */
	tx_hi = (UI_8)(( wr_addr & 0xFF00U ) >> 8U);
	tx_lo = (UI_8)(wr_addr & 0x00FFU);

	spi_byte_tx(&tx_hi);
	spi_byte_tx(&tx_lo);

	/* データライト:16bit */
	tx_hi = (UI_8)(( data & 0xFF00U ) >> 8U);
	tx_lo = (UI_8)(data & 0x00FFU);

	spi_byte_tx(&tx_hi);
	spi_byte_tx(&tx_lo);

	/* CS = H */
	eep_drv_chip_notselect();
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_Disable	[名称]	EWDS(消去,書込禁止)							*/
/*======================================================================================*/
/*	[処理概要]	WRDI(消去,書込禁止)を行なう。											*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_Disable(void)												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・WRENしたまま放置することは厳禁とする。								*/
/****************************************************************************************/
void EepDrv_Disable(void)
{
	/* タイムアウト有無はIF関数実施毎の情報の為、IF関数の最初でのみ初期化 */
	Eep_spi_timeout = D_OK;

	/* 全8bit 命令:8bit */

	/* CS = L */
	eep_drv_chip_select();

	/* 書込み禁止(WRDI):00000100 */
	spi_cmd_tx( EEP_WRDSBL_CMD );

	/* CS = H */
	eep_drv_chip_notselect();
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_Enable	[名称]	EWEN(消去,書込許可)							*/
/*======================================================================================*/
/*	[処理概要]	WREN(書込許可)を行なう。												*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_Enable(void)												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・WRENしたまま放置することは厳禁とする。								*/
/****************************************************************************************/
void EepDrv_Enable(void)
{
	/* タイムアウト有無はIF関数実施毎の情報の為、IF関数の最初でのみ初期化 */
	Eep_spi_timeout = D_OK;

	/* 全8bit 命令:8bit */

	/* CS = L */
	eep_drv_chip_select();
	
	/* 書込み許可(WREN):00000110 */
	spi_cmd_tx( EEP_WRENBL_CMD );
	/* CS = H */
	eep_drv_chip_notselect();
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_GetTimeout	[名称]	EEPROM用通信タイムアウト発生有無取得	*/
/*======================================================================================*/
/*	[処理概要]	SPI通信によるタイムアウト発生有無取得									*/
/*======================================================================================*/
/*	[記述形式]	SI_8 EepDrv_GetTimeout(void)											*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・タイムアウト発生時は、CPU故障、ソフト設定ミス							*/
/****************************************************************************************/
SI_8 EepDrv_GetTimeout(void)
{
	return Eep_spi_timeout;
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_ReadDataNByteFast											*/
/*									[名称]EEPROM address指定連続読み出し(DMA使用)		*/
/*======================================================================================*/
/*	[処理概要]	EEPROM address指定連続読み出しを行なう。								*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_ReadDataNByteFast											*/
/*						( const UI_16 addr, const UI_16 read_size, UI_8 read_data[] )	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16	addr					読出address(1[byte]単位)				*/
/*				UI_16 read_size					読出サイズ(1[byte]単位)					*/
/*				UI_8 read_data[]				読出データ(1[byte]単位)					*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無																		*/
/*======================================================================================*/
/*	[ 備  考 ]	・本処理ではEWEN,EWDSは行わない。										*/
/*	DMAによる連続読み出し完了する前に本関数を終了する為、読出データを取得する前に		*/
/*	EepDrv_ReadDataNByteFastFinish()コールし、DMA転送完了していることを確認すること。	*/
/*	EEPROM_ACCESS_TYPE:EEPROM_ACCESS_SPI_FAST(SPI高速アクセス用)の場合有効				*/
/****************************************************************************************/
void EepDrv_ReadDataNByteFast( const UI_16 addr, const UI_16 read_size, UI_8 read_data[] )
{
	UI_16 rx_dma_num;

	if ( read_size > 1U ) {
		/* タイムアウト有無はeep_read_cmd()で初期化 */
		eep_read_cmd(addr);

		/* 送信DMA設定 */
		/* 固定部分 */
		EepTxDmacInfo.dmac_mode = DMAC_MODE_BLOCK;								/* 転送モード:ブロック転送モード */
		EepTxDmacInfo.dmac_bussize = DMAC_TS_SIZE_BYTE;							/* 転送サイズ：8ビット */
		EepTxDmacInfo.dmac_blocksize = DMAC_BLKCNT_1;							/* ブロックサイズ：1回 */
		EepTxDmacInfo.dmac_move_from_add = DMAC_FROM_ADDRCNT_FIX;				/* 転送元アドレス:固定 */
		EepTxDmacInfo.dmac_move_to_add = DMAC_TO_ADDRCNT_FIX;					/* 転送先アドレス:固定 */
		EepTxDmacInfo.dmac_ch = DMAC_CH_EEP_SPI_TX;								/* DMAC転送チャンネル設定 */
		EepTxDmacInfo.dmac_forword_from_add = (T_SpiTransDataAddress)(&C_EepCmd[EEP_DUMMY_CMD]);
		/* DMAC転送元：ダミーデータ固定(0) */
		EepTxDmacInfo.dmac_forword_to_add = SpiDrv_GetTransDataAddress( EEP_USED_CH, SPI_TX_TYPE );	/* DMAC転送先：送信レジスタ */
		/* 可変部分 */
		rx_dma_num = read_size;
		EepTxDmacInfo.dmac_data_forword_number = rx_dma_num - 1U;				/* DMAC転送回数: 連続リードサイズ(BYTE) - 1*/
		DmacDrv_Ctrl( (const T_DmacDrv_Info*)&EepTxDmacInfo );

		/* 受信DMA設定 */
		/* 固定部分 */
		EepRxDmacInfo.dmac_mode = DMAC_MODE_BLOCK;								/* 転送モード:ブロック転送モード */
		EepRxDmacInfo.dmac_bussize = DMAC_TS_SIZE_BYTE;							/* 転送サイズ：8ビット */
		EepRxDmacInfo.dmac_blocksize = DMAC_BLKCNT_1;							/* ブロックサイズ：1回 */
		EepRxDmacInfo.dmac_move_from_add = DMAC_FROM_ADDRCNT_FIX;				/* 転送元アドレス:固定 */
		EepRxDmacInfo.dmac_move_to_add = DMAC_TO_ADDRCNT_INC;					/* 転送先アドレス:増加 */
		EepRxDmacInfo.dmac_ch = DMAC_CH_EEP_SPI_RX;								/* DMAC転送チャンネル設定 */
		EepRxDmacInfo.dmac_forword_from_add = SpiDrv_GetTransDataAddress( EEP_USED_CH, SPI_RX_TYPE );
		/* DMAC転送元：受信レジスタ */
		/* 可変部分 */
		EepRxDmacInfo.dmac_forword_to_add = (T_SpiTransDataAddress)read_data;	/* DMA転送先:連続リードバッファ */
		EepRxDmacInfo.dmac_data_forword_number = rx_dma_num;					/* DMAC転送回数:連続リードサイズ(BYTE) */
		DmacDrv_Ctrl( (const T_DmacDrv_Info*)&EepRxDmacInfo );

		SpiDrv_SetTxData( EEP_USED_CH, &C_EepCmd[EEP_DUMMY_CMD], D_NULL );		/* ダミーデータ送信(その後はDMAで送信) */
	}
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_ReadDataNByteFastFinish										*/
/*												[名称]EEPROM高速連続読み出し用完了確認	*/
/*======================================================================================*/
/*	[処理概要]	EEPROM 高速連続読み出し用のDMAの完了確認を行なう。						*/
/*======================================================================================*/
/*	[記述形式]	SI_8 EepDrv_ReadDataNByteFastFinish(void)								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	SI_8 timeout:タイムアウト発生有無(D_OK:未発生,D_NG:発生)				*/
/*======================================================================================*/
/*	[ 備  考 ]	EepDrv_ReadDataNByteFast()に対する完了確認用							*/
/*	EEPROM_ACCESS_TYPE:EEPROM_ACCESS_SPI_FAST(SPI高速アクセス用)の場合有効				*/
/****************************************************************************************/
SI_8 EepDrv_ReadDataNByteFastFinish(void)
{
	SI_8 eep_spi_nbyte_timeout;
	T_DmacDrv_State dma_stat;		/* DMAステータス */
	UI_32 cnt;

	/* タイムアウト有無はIF関数実施毎の情報の為、IF関数の最初でのみ初期化 */
	eep_spi_nbyte_timeout = D_OK;

	dma_stat = DmacDrv_GetTransState( DMAC_CH_EEP_SPI_RX ); /* DMA転送状態の取得 */
	
	for ( cnt = 0U; (eep_spi_nbyte_timeout == D_OK) &&
		((dma_stat & DMAC_STATE_COMPNORMAL) == 0U) &&
		((dma_stat & DMAC_STATE_COMPSUSPEND) == 0U) &&
		((dma_stat & DMAC_STATE_COMPUNUSUAL) == 0U); cnt++ ) {
		SysClkDrv_UsecWait(EEP_SPI_WATCH);
		dma_stat = DmacDrv_GetTransState( DMAC_CH_EEP_SPI_RX ); /* DMA転送状態の取得 */
		
		if (cnt >= EEP_SPI_WAIT_MAXBLOCK) {
			eep_spi_nbyte_timeout = D_NG;						/* タイムアウト発生*/
		}
	}
	/* CS = H */
	eep_drv_chip_notselect();

	return eep_spi_nbyte_timeout;
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_ReadDataNByte	[名称]	EEPROM address指定連続読み出し		*/
/*======================================================================================*/
/*	[処理概要]	EEPROM address指定連続読み出しを行なう。								*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_ReadDataNByte												*/
/*						( const UI_16 addr, const UI_16 read_size, UI_8 read_data[] )	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16	addr					読出address(1[byte]単位)				*/
/*				UI_16 read_size					読出サイズ(1[byte]単位)					*/
/*				UI_8 read_data[]				読出データ(1[byte]単位)					*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無																		*/
/*======================================================================================*/
/*	[ 備  考 ]	SPI高速アクセスでは空関数												*/
/****************************************************************************************/
void EepDrv_ReadDataNByte( const UI_16 addr, const UI_16 read_size, UI_8 read_data[] )
{
}

#endif	/* EEPROMサイズ:32K[bit]以上 SPI高速アクセス用関数 終了 */

#if (EEPROM_ACCESS_TYPE == EEPROM_ACCESS_PORT)	/* EEPROMサイズ:32K[bit]以上 ポートアクセス用関数 開始 */
/****************************************************************************************/
/*	[モジュール名]	eep_drv_chip_select	[名称]	CS有効レベル設定						*/
/*======================================================================================*/
/*	[処理概要]	・CSポートを LOWに設定する。											*/
/*				・DI、SKポートを LOW に設定する。										*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_chip_select(void)									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・CSアクティブ設定														*/
/****************************************************************************************/
static void eep_drv_chip_select(void)
{
	R_PO_EEPMW_DI = D_LOW;	/* DIをL出力 */
	R_PO_EEPMW_SK = D_LOW;	/* SKをL出力 */
	R_PO_EEPMW_CS = D_LOW;	/* CSをL出力 */
	EEPROM_WAIT_TCSS();
}

/****************************************************************************************/
/*	[モジュール名]	eep_drv_chip_notselect	[名称]	CS無効レベル設定					*/
/*======================================================================================*/
/*	[処理概要]	・CSポートを HIGHに設定する。											*/
/*				・DI、SKポートを HIGH に設定する。										*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_chip_notselect(void)								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・CS非アクティブ設定													*/
/****************************************************************************************/
static void eep_drv_chip_notselect(void)
{
	R_PO_EEPMW_CS = D_HIGH;	/* CSをH出力 */
	R_PO_EEPMW_DI = D_HIGH;	/* DIをH出力 */
	R_PO_EEPMW_SK = D_HIGH;	/* SKをH出力 */
}

/****************************************************************************************/
/*	[モジュール名]	eep_drv_sk_edge	[名称] SK有効edge(->H->L)設定処理					*/
/*======================================================================================*/
/*	[処理概要]	・SKポートを → HIGH → LOWに設定する。									*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_sk_edge(void)										*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・クロック周波数,SKクロック'H'時間,SKクロック'L'時間,					*/
/*					データ出力遅延時間調整用。											*/
/*				・実行前にSKポートがLOWであること										*/
/****************************************************************************************/
static void eep_drv_sk_edge(void)
{
	R_PO_EEPMW_SK = D_HIGH;	/* SKをH出力 */
	EEPROM_WAIT_TSKH();
	R_PO_EEPMW_SK = D_LOW;	/* SKをL出力 */
	EEPROM_WAIT_TSKL();
}

/****************************************************************************************/
/*	[モジュール名]	eep_drv_di_setup	[名称] DI setup時間用wait設定処理				*/
/*======================================================================================*/
/*	[処理概要]	・DIポートのセットアップ時間待機を行う。								*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_di_setup(void)										*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・DIセットアップ時間調整用												*/
/****************************************************************************************/
static void eep_drv_di_setup(void)
{
	EEPROM_WAIT_TDIS();
}

/****************************************************************************************/
/*	[モジュール名]	eep_drv_di_hold	[名称] DI hold時間用wait設定処理					*/
/*======================================================================================*/
/*	[処理概要]	・DIポートのホールド時間待機を行う。									*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_di_hold(void)										*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・DIホールド時間調整用													*/
/*				・DIホールド時間はeep_drv_sk_edge()で吸収								*/
/****************************************************************************************/
static void eep_drv_di_hold(void)
{
	EEPROM_WAIT_TDIH();
}

/****************************************************************************************/
/*	[モジュール名]	eepdrv_read_statreg	[名称]	ステータスレジスタ読み出し				*/
/*======================================================================================*/
/*	[処理概要]	ステータスレジスタ読み出し												*/
/*======================================================================================*/
/*	[記述形式]	UI_8 eepdrv_read_statreg(void)											*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_8 statreg															*/
/*======================================================================================*/
/*	[ 備  考 ]	EEPROM内のステータスレジスタリード										*/
/****************************************************************************************/
static UI_8 eepdrv_read_statreg(void)
{
	UI_8 statreg;

	/* SCK,SI,CS = L */
	eep_drv_chip_select();
	eep_drv_di_setup();

	/* ステータスレジスタ読み出し命令:8bit 00000101 */
	eep_drv_sk_edge();			/* 1 */
	eep_drv_sk_edge();			/* 2 */
	eep_drv_sk_edge();			/* 3 */
	eep_drv_sk_edge();			/* 4 */
	eep_drv_sk_edge();			/* 5 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = D_HIGH;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 6 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = D_LOW;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 7 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = D_HIGH;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 8 */

	/* ステータスレジスタ読み出し */
	statreg = eep_drv_do_receive_8();
	
	/* SCK,SI,CS = H */
	eep_drv_chip_notselect();
	return statreg;
}

/****************************************************************************************/
/*	[モジュール名]	eep_drv_di_send_16	[名称]	EEPROM DI送信(16[bit])					*/
/*======================================================================================*/
/*	[処理概要]	DI送信(16[bit])を行なう。												*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_di_send_16(UI_16 data_in)							*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16 data_in			送信data(16[bit])								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
static void eep_drv_di_send_16(UI_16 data_in)
{
	WORD_BIT	data;

	data.WORD = data_in;

	eep_drv_di_hold();
	R_PO_EEPMW_DI = data.BIT.B15;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 9 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = data.BIT.B14;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 10 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = data.BIT.B13;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 11 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = data.BIT.B12;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 12 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = data.BIT.B11;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 13 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = data.BIT.B10;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 14 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = data.BIT.B09;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 15 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = data.BIT.B08;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 16 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = data.BIT.B07;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 17 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = data.BIT.B06;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 18 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = data.BIT.B05;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 19 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = data.BIT.B04;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 20 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = data.BIT.B03;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 21 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = data.BIT.B02;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 22 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = data.BIT.B01;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 23 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = data.BIT.B00;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 24 */
}

/****************************************************************************************/
/*	[モジュール名]	eep_drv_do_receive_8	[名称]	EEPROM DO受信(8[bit])				*/
/*======================================================================================*/
/*	[処理概要]	DO受信(8[bit])を行なう。												*/
/*======================================================================================*/
/*	[記述形式]	static UI_8 eep_drv_do_receive_8(void)									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_8 ret_val.BYTE		受信data(8[bit])								*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
static UI_8 eep_drv_do_receive_8(void)
{
	BYTE_BIT	ret_val;
	UI_8		tmp;

	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B7 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B6 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B5 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B4 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B3 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B2 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B1 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B0 = tmp;

	eep_drv_sk_edge();

	return	ret_val.BYTE;
}
/****************************************************************************************/
/*	[モジュール名]	eep_drv_do_receive_16	[名称]	EEPROM DO受信(16[bit])				*/
/*======================================================================================*/
/*	[処理概要]	DO受信(16[bit])を行なう。												*/
/*======================================================================================*/
/*	[記述形式]	static UI_16 eep_drv_do_receive_16(void)								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_16 ret_val.WORD		受信data(16[bit])								*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
static UI_16 eep_drv_do_receive_16(void)
{
	WORD_BIT	ret_val;
	UI_8		tmp;

	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B15 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B14 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B13 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B12 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B11 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B10 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B09 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B08 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B07 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B06 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B05 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B04 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B03 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B02 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B01 = tmp;

	eep_drv_sk_edge();
	tmp = R_PI_EEPMW_DO;
	ret_val.BIT.B00 = tmp;

	eep_drv_sk_edge();

	return	ret_val.WORD;
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_StartSpiAccess	[名称]	SPIアクセス開始						*/
/*======================================================================================*/
/*	[処理概要]	SPIアクセスを開始する。													*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_StartSpiAccess(void)										*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	空関数																	*/
/****************************************************************************************/
void EepDrv_StartSpiAccess(void)
{
	/* 空関数 */
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_ChkBusy	[名称]	Busy check									*/
/*======================================================================================*/
/*	[処理概要]	Busy checkを行う。														*/
/*======================================================================================*/
/*	[記述形式]	UI_8 EepDrv_ChkBusy(void)												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_8	ret_val					Busy状態か否か(D_TRUE/D_FALSE)			*/
/*======================================================================================*/
/*	[ 備  考 ]	ステータスレジスタを読み出し、ビジーチェック							*/
/****************************************************************************************/
UI_8 EepDrv_ChkBusy(void)
{
	UI_8	ret_val = D_FALSE;		/* ビジーでない */
	UI_8	statreg;

	/* レジスタアクセスによるビジーチェック */
	/* 全16bit 命令:8bit,ステータス:8bit */
	statreg = eepdrv_read_statreg();

	if ( (statreg & EEP_STAT_WIP) == EEP_STAT_WIP) { /* ステータスレジスタ.BIT0(WIP) == 書込み中(1) */
		ret_val = D_TRUE;	/* ビジー */
	}
	return	ret_val;
}


/****************************************************************************************/
/*	[モジュール名]	EepDrv_ReadDataWord	[名称]	EEPROM address指定1word読み出し			*/
/*======================================================================================*/
/*	[処理概要]	EEPROM address指定1word読み出しを行なう。								*/
/*======================================================================================*/
/*	[記述形式]	UI_16 EepDrv_ReadDataWord(UI_16 adr)									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16	addr					読出address(1[word]単位)				*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_16	ret_val					読出data								*/
/*======================================================================================*/
/*	[ 備  考 ]	・本処理ではEWEN,EWDSは行わない。										*/
/****************************************************************************************/
UI_16 EepDrv_ReadDataWord(UI_16 adr)
{
	UI_16	ret_val;
	UI_16 read_addr;

	/* 全40bit 命令:8bit,アドレス:16bit,データ:16bit(2bye) */
	read_addr = adr << 1U;	/* ワードアドレス→バイトアドレス */
	read_addr &= 0x3FFFU;	/* 上位2bitマスク */

	/* SCK,SI,CS = L */
	eep_drv_chip_select();
	eep_drv_di_setup();

	/* READ命令:8bit 00000011 */
	eep_drv_sk_edge();			/* 1 */
	eep_drv_sk_edge();			/* 2 */
	eep_drv_sk_edge();			/* 3 */
	eep_drv_sk_edge();			/* 4 */
	eep_drv_sk_edge();			/* 5 */
	eep_drv_sk_edge();			/* 6 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = D_HIGH;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 7 */
	eep_drv_sk_edge();			/* 8 */

	/* アドレス設定:16bit */
	eep_drv_di_send_16(read_addr);

	eep_drv_di_hold();
	R_PO_EEPMW_DI = D_HIGH;			/* ダミー出力 */
	eep_drv_di_setup();

	/* データリード:16bit */
	ret_val = eep_drv_do_receive_16();						/* EEPROM DO受信(16[bit]) */

	/* SCK,SI,CS = H */
	eep_drv_chip_notselect();
	return	ret_val;
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_ReadDataNByte	[名称]	EEPROM address連続読み出し			*/
/*======================================================================================*/
/*	[処理概要]	EEPROM address指定連続読み出しを行なう。								*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_ReadDataNByte												*/
/*						( const UI_16 addr, const UI_16 read_size, UI_8 read_data[] )	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16	addr					読出address(1[byte]単位)				*/
/*				UI_16 read_size					読出サイズ(1[byte]単位)					*/
/*				UI_8  read_data[]				読出データ(1[byte]単位)					*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無																		*/
/*======================================================================================*/
/*	[ 備  考 ]	・本処理ではEWEN,EWDSは行わない。										*/
/****************************************************************************************/
void EepDrv_ReadDataNByte( const UI_16 addr, const UI_16 read_size, UI_8 read_data[] )
{
	UI_16 read_addr;
	UI_16 i;

	/* 全40bit 命令:8bit,アドレス:16bit,データ:16bit(2bye) */
	read_addr = addr & 0x3FFFU;	/* 上位2bitマスク */

	/* SCK,SI,CS = L */
	eep_drv_chip_select();
	eep_drv_di_setup();
	/* READ命令:8bit 00000011 */
	eep_drv_sk_edge();			/* 1 */
	eep_drv_sk_edge();			/* 2 */
	eep_drv_sk_edge();			/* 3 */
	eep_drv_sk_edge();			/* 4 */
	eep_drv_sk_edge();			/* 5 */
	eep_drv_sk_edge();			/* 6 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = D_HIGH;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 7 */
	eep_drv_sk_edge();			/* 8 */
	
	/* アドレス設定:16bit */
	eep_drv_di_send_16(read_addr);

	eep_drv_di_hold();
	R_PO_EEPMW_DI = D_HIGH;			/* ダミー出力 */
	eep_drv_di_setup();

	/* データリード:8bit * read_size  */
	for (i = 0U; i < read_size; i++) {
		read_data[i] = eep_drv_do_receive_8();						/* EEPROM DO受信(8[bit]) */
	}
	/* SCK,SI,CS = H */
	eep_drv_chip_notselect();
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_WriteDataWord	[名称]	EEPROM address指定1word書き込み		*/
/*======================================================================================*/
/*	[処理概要]	EEPROM address指定1word書き込みを行なう。								*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_WriteDataWord( UI_16 adr, UI_16 data)						*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16	adr						書込address(1[word]単位)				*/
/*				UI_16	data					書込data								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・本処理ではEWEN,EWDSは行わない。										*/
/****************************************************************************************/
void EepDrv_WriteDataWord(UI_16 adr, UI_16 data)
{
	UI_16 wr_addr;

	/* 全40bit 命令:8bit,アドレス:16bit,データライト:16bit(2bye) */
	wr_addr = adr << 1U;		/* ワードアドレス→バイトアドレス */
	wr_addr &= 0x3FFFU;		/* 上位2bitマスク */

	/* SCK,SI,CS = L */
	eep_drv_chip_select();
	eep_drv_di_setup();
	/* WRITE命令:8bit 00000010 */
	eep_drv_sk_edge();			/* 1 */
	eep_drv_sk_edge();			/* 2 */
	eep_drv_sk_edge();			/* 3 */
	eep_drv_sk_edge();			/* 4 */
	eep_drv_sk_edge();			/* 5 */
	eep_drv_sk_edge();			/* 6 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = D_HIGH;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 7 */

	eep_drv_di_hold();
	R_PO_EEPMW_DI = D_LOW;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 8 */

	/* アドレス設定:16bit */
	eep_drv_di_send_16(wr_addr);

	/* データライト:16bit */
	eep_drv_di_send_16(data);

	/* SCK,SI,CS = H */
	eep_drv_chip_notselect();
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_Disable	[名称]	EWDS(消去,書込禁止)							*/
/*======================================================================================*/
/*	[処理概要]	WRDI(消去,書込禁止)を行なう。											*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_Disable(void)												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・WRENしたまま放置することは厳禁とする。								*/
/****************************************************************************************/
void EepDrv_Disable(void)
{
	/* 全8bit 命令:8bit */

	/* SCK,SI,CS = L */
	eep_drv_chip_select();
	eep_drv_di_setup();
	/* 書込み禁止(WRDI):00000100 */
	/* 書込み禁止 bit1-5:0 */
	eep_drv_sk_edge();			/* 1 */
	eep_drv_sk_edge();			/* 2 */
	eep_drv_sk_edge();			/* 3 */
	eep_drv_sk_edge();			/* 4 */
	eep_drv_sk_edge();			/* 5 */

	/* 書込み禁止 bit6:1 */
	eep_drv_di_hold();
	R_PO_EEPMW_DI = D_HIGH;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 6 */

	/* 書込み禁止 bit7-8:0 */
	eep_drv_di_hold();
	R_PO_EEPMW_DI = D_LOW;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 7 */
	eep_drv_sk_edge();			/* 8 */

	/* SCK,SI,CS = H */
	eep_drv_chip_notselect();
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_Enable	[名称]	EWEN(消去,書込許可)							*/
/*======================================================================================*/
/*	[処理概要]	WREN(消去,書込許可)を行なう。											*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_Enable(void)												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・WRENしたまま放置することは厳禁とする。								*/
/****************************************************************************************/
void EepDrv_Enable(void)
{
	/* 全8bit 命令:8bit */

	/* SCK,SI,CS = L */
	eep_drv_chip_select();
	eep_drv_di_setup();

	/* 書込み許可(WREN):00000110 */
	/* 書込み許可 bit1-5:0 */
	eep_drv_sk_edge();			/* 1 */
	eep_drv_sk_edge();			/* 2 */
	eep_drv_sk_edge();			/* 3 */
	eep_drv_sk_edge();			/* 4 */
	eep_drv_sk_edge();			/* 5 */

	/* 書込み許可 bit6,7:1 */
	eep_drv_di_hold();
	R_PO_EEPMW_DI = D_HIGH;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 6 */
	eep_drv_sk_edge();			/* 7 */

	/* 書込み許可 bit8:0 */
	eep_drv_di_hold();
	R_PO_EEPMW_DI = D_LOW;
	eep_drv_di_setup();

	eep_drv_sk_edge();			/* 8 */

	/* SCK,SI,CS = H */
	eep_drv_chip_notselect();
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_ReadDataNByteFast											*/
/*									[名称]EEPROM address指定連続読み出し(DMA使用)		*/
/*======================================================================================*/
/*	[処理概要]	EEPROM address指定連続読み出しを行なう。								*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_ReadDataNByteFast											*/
/*						( const UI_16 addr, const UI_16 read_size, UI_8 read_data[] )	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16	addr					読出address(1[byte]単位)				*/
/*				UI_16 read_size					読出サイズ(1[byte]単位)					*/
/*				UI_8  read_data[]				読出データ(1[byte]単位)					*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無																		*/
/*======================================================================================*/
/*	[ 備  考 ]	ポートアクセスでは空関数。												*/
/****************************************************************************************/
void EepDrv_ReadDataNByteFast( const UI_16 addr, const UI_16 read_size, UI_8 read_data[] )
{
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_ReadDataNByteFastFinish										*/
/*												[名称]EEPROM高速連続読み出し用完了確認	*/
/*======================================================================================*/
/*	[処理概要]	EEPROM 高速連続読み出し用のDMAの完了確認を行なう。						*/
/*======================================================================================*/
/*	[記述形式]	SI_8 EepDrv_ReadDataNByteFastFinish(void)								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	D_NG:タイムアウト発生													*/
/*======================================================================================*/
/*	[ 備  考 ]	ポートアクセスでは空関数。												*/
/****************************************************************************************/
SI_8 EepDrv_ReadDataNByteFastFinish(void)
{
	return D_NG;
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_GetTimeout	[名称]	EEPROM用通信タイムアウト発生有無取得	*/
/*======================================================================================*/
/*	[処理概要]	SPI通信によるタイムアウト発生有無取得									*/
/*======================================================================================*/
/*	[記述形式]	SI_8 EepDrv_GetTimeout(void)											*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	D_NG:タイムアウト発生													*/
/*======================================================================================*/
/*	[ 備  考 ]	ポートアクセスでは空関数。												*/
/****************************************************************************************/
SI_8 EepDrv_GetTimeout(void)
{
	return D_NG;
}

#endif	/* EEPROMサイズ:32K[bit]以上 ポートアクセス用関数 終了 */
#else
/* EEPROMサイズ:16K以下[bit] ポートアクセス用関数 開始 */
/****************************************************************************************/
/*	[モジュール名]	eep_drv_chip_select	[名称] CS有効edge(->H)及びDI,SKのLow設定処理	*/
/*======================================================================================*/
/*	[処理概要]	・CSポートを → LOW → HIGH に設定する。								*/
/*				・DI、SKポートを LOW に設定する。										*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_chip_select(void)									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・CSセットアップ時間調整用												*/
/*				・万が一CSポートがHIGHとなっていても確実にLOWを入れる					*/
/****************************************************************************************/
static void eep_drv_chip_select(void)
{
	R_PO_EEPMW_CS = D_LOW;	/* CSをL出力 */
	R_PO_EEPMW_DI = D_LOW;	/* DIをL出力 */
	R_PO_EEPMW_SK = D_LOW;	/* SKをL出力 */
	R_PO_EEPMW_CS = D_HIGH;	/* CSをH出力 */
	EEPROM_WAIT_TCSS();
}

/****************************************************************************************/
/*	[モジュール名]	eep_drv_sk_edge_continue	[名称] SK有効edge(->H->L)設定処理		*/
/*======================================================================================*/
/*	[処理概要]	・SKポートを → HIGH → LOWに設定する。									*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_sk_edge_continue(void)								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・クロック周波数,SKクロック'H'時間,SKクロック'L'時間,					*/
/*					データ出力遅延時間調整用											*/
/*				・データ出力遅延時間は、（SKクロック'H'時間＋SKクロック'L'時間）で吸収	*/
/*				・次もSK edgeの場合にはこちらを使うこと									*/
/*					但し、実行前にSKポートがLOWであること								*/
/****************************************************************************************/
static void eep_drv_sk_edge_continue(void)
{
	R_PO_EEPMW_SK = D_HIGH;	/* SKをH出力 */
	EEPROM_WAIT_TSKH_CONTINUE();
	R_PO_EEPMW_SK = D_LOW;	/* SKをL出力 */
	EEPROM_WAIT_TSKL_CONTINUE();
}

/****************************************************************************************/
/*	[モジュール名]	eep_drv_sk_edge_preread	[名称] SK有効edge(->H->L)設定処理			*/
/*======================================================================================*/
/*	[処理概要]	・SKポート を → HIGH → LOWに設定する。								*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_sk_edge_preread(void)								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・クロック周波数,SKクロック'H'時間,SKクロック'L'時間,					*/
/*					データ出力遅延時間調整用											*/
/*				・次が3点多数決のDOポートの readの場合にのみ、こちらを使うこと。		*/
/*					但し、実行前にSKポートがLOWであること								*/
/*				・データ出力遅延時間は、（SKクロック'H'時間＋SKクロック'L'時間）で吸収	*/
/****************************************************************************************/
static void eep_drv_sk_edge_preread(void)
{
	R_PO_EEPMW_SK = D_HIGH;	/* SKをH出力 */
	EEPROM_WAIT_TSKH_PREREAD();
	R_PO_EEPMW_SK = D_LOW;	/* SKをL出力 */
	EEPROM_WAIT_TSKL_PREREAD();
}

/****************************************************************************************/
/*	[モジュール名]	eep_drv_sk_edge	[名称] SK有効edge(->H->L)設定処理					*/
/*======================================================================================*/
/*	[処理概要]	・SKポートを → HIGH → LOWに設定する。									*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_sk_edge(void)										*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・クロック周波数,SKクロック'H'時間,SKクロック'L'時間,					*/
/*					データ出力遅延時間調整用。											*/
/*				・次もSK edgeの場合には使用禁止											*/
/*				・実行前にSKポートがLOWであること										*/
/****************************************************************************************/
static void eep_drv_sk_edge(void)
{
	R_PO_EEPMW_SK = D_HIGH;	/* SKをH出力 */
	EEPROM_WAIT_TSKH();
	R_PO_EEPMW_SK = D_LOW;	/* SKをL出力 */
	EEPROM_WAIT_TSKL();
}

/****************************************************************************************/
/*	[モジュール名]	eep_drv_di_setup	[名称] DI setup時間用wait設定処理				*/
/*======================================================================================*/
/*	[処理概要]	・DIポートのセットアップ時間待機を行う。								*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_di_setup(void)										*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・DIセットアップ時間調整用												*/
/****************************************************************************************/
static void eep_drv_di_setup(void)
{
	EEPROM_WAIT_TDIS();
}

/****************************************************************************************/
/*	[モジュール名]	eep_drv_di_hold	[名称] DI hold時間用wait設定処理					*/
/*======================================================================================*/
/*	[処理概要]	・DIポートのホールド時間待機を行う。									*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_di_hold(void)										*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・DIホールド時間調整用													*/
/*				・DIホールド時間はeep_drv_sk_edge*()で吸収								*/
/****************************************************************************************/
static void eep_drv_di_hold(void)
{
	EEPROM_WAIT_TDIH();
}

/****************************************************************************************/
/*	[モジュール名]	eep_drv_do_read_tsv	[名称] CS立ち上げ後DO読込前のwait設定処理		*/
/*======================================================================================*/
/*	[処理概要]	・CSポート 立ち上げ後、DOポート 読込み前の待機を行う。					*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_do_read_tsv(void)									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・出力イネーブル時間調整用												*/
/****************************************************************************************/
static void eep_drv_do_read_tsv(void)
{
	EEPROM_WAIT_TSV();
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_ChkBusy	[名称]	Busy check									*/
/*======================================================================================*/
/*	[処理概要]	Busy checkを行う。														*/
/*======================================================================================*/
/*	[記述形式]	UI_8 EepDrv_ChkBusy(void)												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_8	ret					Busy状態か否か(TRUE/FALSE)					*/
/*======================================================================================*/
/*	[ 備  考 ]	・DOを3回連続でReadし、3回ともHIGHならばReadyと判定、さもなくばBusy。	*/
/*	1回でもBusy検出したら、それ以上はCheckしない。(3点多数決ではなく、3点HIGH一致)		*/
/*	・いつまでもBusyであった場合の処理は本関数の呼び出し元において行うこと。			*/
/****************************************************************************************/
UI_8 EepDrv_ChkBusy(void)
{
	UI_8	ret_val = D_FALSE;
											/*	CS	DI	DO	SK	送信	メモ			*/
											/*	---+---+---+---+-------+----------------*/
	eep_drv_chip_select();					/*	1	0	*	0			chip select		*/
	eep_drv_do_read_tsv();					/*											*/
	if ( R_PI_EEPMW_DO == D_LOW ) {			/*	1	0	B/R	0			busy check(1)	*/
		ret_val = D_TRUE;					/*											*/
	} else if								/*											*/
		( R_PI_EEPMW_DO == D_LOW ) {		/*	1	0	B/R	0			busy check(2)	*/
		ret_val = D_TRUE;					/*											*/
	} else if								/*											*/
		( R_PI_EEPMW_DO == D_LOW ) {		/*	1	0	B/R	0			busy check(3)	*/
		ret_val = D_TRUE;					/*											*/
	} else {								/*											*/
		/* do nothing */					/*											*/
	}										/*											*/
	R_PO_EEPMW_CS = D_LOW;					/*	0	0	*	0			chip not select	*/


	return	ret_val;
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_ReadDataWord	[名称]	EEPROM address指定1word読み出し			*/
/*======================================================================================*/
/*	[処理概要]	EEPROM address指定1word読み出しを行なう。								*/
/*======================================================================================*/
/*	[記述形式]	UI_16 EepDrv_ReadDataWord(UI_16 adr)									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16	adr						読出address(1[word]単位)				*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_16	ret_val					読出data								*/
/*======================================================================================*/
/*	[ 備  考 ]	・本処理ではEWEN,EWDSは行わない。										*/
/****************************************************************************************/
UI_16 EepDrv_ReadDataWord(UI_16 adr)
{
	UI_16	ret_val;
											/*	CS	DI	DO	SK	送信	メモ			*/
											/*	---+---+---+---+-------+----------------*/
	eep_drv_chip_select();					/*	1	0	*	0			chip select		*/
	R_PO_EEPMW_DI = D_HIGH;					/*	1	1	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge_continue();				/*	1	1	*	1/0	1		start bit		*/
	eep_drv_sk_edge();						/*	1	1	*	1/0	1		op-code(1)		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = D_LOW;					/*	1	0	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	0	*	1/0	0		op-code(2)		*/

															/* address送信 */
#if		(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_16K)
	eep_drv_di_send_10((adr & EEPROM_ADDR_MAX_16K));			/* EEPROM DI送信(10[bit])	*/
#elif	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_8K)
	eep_drv_di_send_10((adr & EEPROM_ADDR_MAX_8K));			/* EEPROM DI送信(10[bit])	*/
#elif	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_4K)
	eep_drv_di_send_8((UI_8)(adr & EEPROM_ADDR_MAX_4K));		/* EEPROM DI送信(8[bit])	*/
#elif	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_2K)
	eep_drv_di_send_8((UI_8)(adr & EEPROM_ADDR_MAX_2K));		/* EEPROM DI送信(8[bit])	*/
#elif	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_1K)
	eep_drv_di_send_6((UI_8)(adr & EEPROM_ADDR_MAX_1K));		/* EEPROM DI送信(6[bit])	*/
#else
#	error	Missing "EEPROM_ADR_MAX_TYPE" or not supported value.
#endif

															/* data受信 */
	ret_val = eep_drv_do_receive_16();						/* EEPROM DO受信(16[bit])	*/

	R_PO_EEPMW_CS = D_LOW;					/*	0	0	*	0			chip not select */

	return	ret_val;
}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_WriteDataWord	[名称]	EEPROM address指定1word書き込み		*/
/*======================================================================================*/
/*	[処理概要]	EEPROM address指定1word書き込みを行なう。								*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_WriteDataWord(UI_16 adr, UI_16 data)						*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16	adr						書込address(1[word]単位)				*/
/*				UI_16	data					書込data								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・本処理ではEWEN,EWDSは行わない。										*/
/****************************************************************************************/
void EepDrv_WriteDataWord(UI_16 adr, UI_16 data)
{
	WORD_BYTE	wdata;
	wdata.WORD = data;
											/*	CS	DI	DO	SK	送信	メモ			*/
											/*	---+---+---+---+-------+----------------*/
	eep_drv_chip_select();					/*	1	0	*	0			chip select		*/
	R_PO_EEPMW_DI = D_HIGH;					/*	1	1	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	1	*	1/0	1		start bit		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = D_LOW;					/*	1	0	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	0	*	1/0	0		op-code(1)		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = D_HIGH;					/*	1	1	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	1	*	1/0	1		op-code(2)		*/
	eep_drv_di_hold();						/*											*/

															/* address送信 */
#if		(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_16K)
	eep_drv_di_send_10((adr & EEPROM_ADDR_MAX_16K));			/* EEPROM DI送信(10[bit])	*/
#elif	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_8K)
	eep_drv_di_send_10((adr & EEPROM_ADDR_MAX_8K));			/* EEPROM DI送信(10[bit])	*/
#elif	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_4K)
	eep_drv_di_send_8((UI_8)(adr & EEPROM_ADDR_MAX_4K));		/* EEPROM DI送信(8[bit])	*/
#elif	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_2K)
	eep_drv_di_send_8((UI_8)(adr & EEPROM_ADDR_MAX_2K));		/* EEPROM DI送信(8[bit])	*/
#elif	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_1K)
	eep_drv_di_send_6((UI_8)(adr & EEPROM_ADDR_MAX_1K));		/* EEPROM DI送信(6[bit])	*/
#endif

															/* data送信 */
	eep_drv_di_send_8(wdata.BYTE.H);						/* EEPROM DI送信(8[bit])	*/
	eep_drv_di_send_8(wdata.BYTE.L);						/* EEPROM DI送信(8[bit])	*/

	R_PO_EEPMW_CS = D_LOW;					/*	0	0	*	0			chip not select	*/

}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_Disable	[名称]	EWDS(消去,書込禁止)							*/
/*======================================================================================*/
/*	[処理概要]	EWDS(消去,書込禁止)を行なう。											*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_Disable(void)												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・EWENしたまま放置することは厳禁とする。								*/
/****************************************************************************************/
void EepDrv_Disable(void)
{
											/*	CS	DI	DO	SK	送信	メモ			*/
											/*	---+---+---+---+-------+----------------*/
	eep_drv_chip_select();					/*	1	0	*	0			chip select		*/
	R_PO_EEPMW_DI = D_HIGH;					/*	1	1	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	1	*	1/0	1		start bit		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = D_LOW;					/*	1	0	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		op-code(1)		*/
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		op-code(2)		*/
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A9/A7/A5		*/
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A8/A6/A4		*/
#if		(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_8K) || (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_16K)
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A7				*/
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A6				*/
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A5				*/
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A4				*/
#elif	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_2K) || (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_4K)
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A5				*/
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A4				*/
#endif
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A3				*/
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A2				*/
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A1				*/
	eep_drv_sk_edge();						/*	1	0	*	1/0	0		A0				*/
	R_PO_EEPMW_CS = D_LOW;					/*	0	0	*	0			chip not select	*/

}

/****************************************************************************************/
/*	[モジュール名]	EepDrv_Enable	[名称]	EWEN(消去,書込許可)							*/
/*======================================================================================*/
/*	[処理概要]	EWEN(消去,書込許可)を行なう。											*/
/*======================================================================================*/
/*	[記述形式]	void EepDrv_Enable(void)												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・EWENしたまま放置することは厳禁とする。								*/
/****************************************************************************************/
void EepDrv_Enable(void)
{
											/*	CS	DI	DO	SK	送信	メモ			*/
											/*	---+---+---+---+-------+----------------*/
	eep_drv_chip_select();					/*	1	0	*	0			chip select		*/
	R_PO_EEPMW_DI = D_HIGH;					/*	1	1	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	1	*	1/0	1		start bit		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = D_LOW;					/*	1	0	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		op-code(1)		*/
	eep_drv_sk_edge();						/*	1	0	*	1/0	0		op-code(2)		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = D_HIGH;					/*	1	1	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge_continue();				/*	1	1	*	1/0	1		A9/A7/A5		*/
	eep_drv_sk_edge();						/*	1	1	*	1/0	1		A8/A6/A4		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = D_LOW;					/*	1	0	*	0							*/
	eep_drv_di_setup();						/*											*/
#if		(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_8K) || (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_16K)
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A7				*/
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A6				*/
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A5				*/
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A4				*/
#elif	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_2K) || (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_4K)
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A5				*/
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A4				*/
#endif
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A3				*/
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A2				*/
	eep_drv_sk_edge_continue();				/*	1	0	*	1/0	0		A1				*/
	eep_drv_sk_edge();						/*	1	0	*	1/0	0		A0				*/
	R_PO_EEPMW_CS = D_LOW;					/*	0	0	*	0			chip not select	*/

}

/****************************************************************************************/
/*	[モジュール名]	eep_drv_di_send_8	[名称]	EEPROM DI送信(8[bit])					*/
/*======================================================================================*/
/*	[処理概要]	DI送信(8[bit])を行なう。												*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_di_send_8(UI_8 data_in)								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_8 data_in			送信data(8[bit])								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・本処理は、単独で使用するためのものではない。例えば、write命令では、	*/
/*	op-code送信後のaddress送信,data送信(D15-D8, D7-D0に分割)に使用する、等。			*/
/*	・本処理呼出時、CSポートがHIGH、,DIポートはLOW, SKポートはLOWであること。			*/
/*  ・本処理ではCSは制御しない。														*/
/****************************************************************************************/
static void eep_drv_di_send_8(UI_8 data_in)
{
	BYTE_BIT	data;
	data.BYTE = data_in;
											/*	CS	DI	DO	SK	送信	メモ			*/
											/*	---+---+---+---+-------+----------------*/
	/* (初期状態) */						/*	1	0	*	0							*/
	R_PO_EEPMW_DI = data.BIT.B7;			/*	1	B7	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B7	*	1/0	B7		data bit-7		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B6;			/*	1	B6	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B6	*	1/0	B6		data bit-6		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B5;			/*	1	B5	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B5	*	1/0	B5		data bit-5		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B4;			/*	1	B4	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B4	*	1/0	B4		data bit-4		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B3;			/*	1	B3	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B3	*	1/0	B3		data bit-3		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B2;			/*	1	B2	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B2	*	1/0	B2		data bit-2		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B1;			/*	1	B1	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B1	*	1/0	B1		data bit-1		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B0;			/*	1	B0	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B0	*	1/0	B0		data bit-0		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = D_LOW;					/*	1	0	*	0							*/

}

/****************************************************************************************/
/*	[モジュール名]	eep_drv_di_send_10	[名称]	EEPROM DI送信(10[bit])					*/
/*======================================================================================*/
/*	[処理概要]	DI送信(10[bit])を行なう。												*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_di_send_10(UI_16 data_in)							*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_16 data_in			送信data(10[bit])								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・なし																	*/
/****************************************************************************************/
#if		(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_8K) || (EEPROM_ADR_MAX == EEPROM_ADDR_MAX_16K)
static void eep_drv_di_send_10(UI_16 data_in)
{
	WORD_BIT	data;
	data.WORD = data_in;
											/*	CS	DI	DO	SK	送信	メモ			*/
											/*	---+---+---+---+-------+----------------*/
	/* (初期状態) */						/*	1	0	*	0							*/
	R_PO_EEPMW_DI = data.BIT.B09;			/*	1	B9	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B9	*	1/0	B9		data bit-9		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B08;			/*	1	B8	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B8	*	1/0	B8		data bit-8		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B07;			/*	1	B7	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B7	*	1/0	B7		data bit-7		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B06;			/*	1	B6	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B6	*	1/0	B6		data bit-6		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B05;			/*	1	B5	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B5	*	1/0	B5		data bit-5		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B04;			/*	1	B4	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B4	*	1/0	B4		data bit-4		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B03;			/*	1	B3	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B3	*	1/0	B3		data bit-3		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B02;			/*	1	B2	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B2	*	1/0	B2		data bit-2		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B01;			/*	1	B1	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B1	*	1/0	B1		data bit-1		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B00;			/*	1	B0	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B0	*	1/0	B0		data bit-0		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = D_LOW;					/*	1	0	*	0							*/
}

/****************************************************************************************/
/*	[モジュール名]	eep_drv_di_send_6	[名称]	EEPROM DI送信(6[bit])					*/
/*======================================================================================*/
/*	[処理概要]	DI送信(6[bit])を行なう。												*/
/*======================================================================================*/
/*	[記述形式]	static void eep_drv_di_send_6(UI_8 data_in)								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_8 data_in			送信data(6[bit])								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	・本処理は、単独で使用するためのものではない。例えば、write命令では、	*/
/*	op-code送信後のaddress送信,data送信(D15-D8, D7-D0に分割)に使用する、等。			*/
/*	・・本処理呼出時、CSポートHIGH,DIポートがLOW,SKポートがLOWであること。				*/
/*	・6[bit]送信時は、上位2[bit]は無視される。											*/
/****************************************************************************************/
#elif	(EEPROM_ADR_MAX == EEPROM_ADDR_MAX_1K)
static void eep_drv_di_send_6(UI_8 data_in)
{
	BYTE_BIT	data;
	data.BYTE = data_in;
											/*	CS	DI	DO	SK	送信	メモ			*/
											/*	---+---+---+---+-------+----------------*/
	/* (初期状態) */						/*	1	0	*	0							*/
	R_PO_EEPMW_DI = data.BIT.B5;			/*	1	B5	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B5	*	1/0	B5		data bit-5		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B4;			/*	1	B4	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B4	*	1/0	B4		data bit-4		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B3;			/*	1	B3	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B3	*	1/0	B3		data bit-3		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B2;			/*	1	B2	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B2	*	1/0	B2		data bit-2		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B1;			/*	1	B1	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B1	*	1/0	B1		data bit-1		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = data.BIT.B0;			/*	1	B0	*	0							*/
	eep_drv_di_setup();						/*											*/
	eep_drv_sk_edge();						/*	1	B0	*	1/0	B0		data bit-0		*/
	eep_drv_di_hold();						/*											*/
	R_PO_EEPMW_DI = D_LOW;					/*	1	0	*	0							*/

}
#endif

/****************************************************************************************/
/*	[モジュール名]	eep_drv_do_receive_16	[名称]	EEPROM DO受信(16[bit])				*/
/*======================================================================================*/
/*	[処理概要]	DO受信(16[bit])を行なう。												*/
/*======================================================================================*/
/*	[記述形式]	static UI_16 eep_drv_do_receive_16(void)								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_8 tmp		受信data(16[bit])										*/
/*======================================================================================*/
/*	[ 備  考 ]	・本処理は、単独で使用するためのものではない。例えば、read命令では、	*/
/*	op-code,address送信後に本処理を呼び出して16bit受信する、等。(address auto increment	*/
/*	に簡単に対応するため、 D15-D0受信部のみを独立させている)							*/
/*	・本処理呼出時、CSポートがHIGH,DIポートがLOW,SKポートがLOWであること。				*/
/*	・DO信号線へのnoise対策のため、DOは3点多数決とする。								*/
/*	・本処理ではCSポート,DIポートは制御しない。											*/
/*					X = (A and B) or (B and C) or (C and A)								*/
/*						= A xor ((A xor B) and (A xor C))								*/
/*																						*/
/*						ABC	(AxorB)	(AxorC)	and	X=3点多数決								*/
/*						---+-------+-------+---+----									*/
/*						000	0		0		0	0										*/
/*						001	0		1		0	0										*/
/*						010	1		0		0	0										*/
/*						011	1		1		1	1										*/
/*						100	1		1		1	0										*/
/*						101	1		0		0	1										*/
/*						110	0		1		0	1										*/
/*						111	0		0		0	1										*/
/*																						*/
/*	本処理呼出直前にeep_drv_sk_edge()の使用は禁止。eep_drv_sk_edge_continue()を使う事。	*/
/*	(SK clock pulse幅が短くなりすぎる場合がある為)inline展開される場合には特に注意。	*/
/****************************************************************************************/
static UI_16 eep_drv_do_receive_16(void)
{
	WORD_BIT	ret_val;
	UI_8		tmp;
											/*	CS	DI	DO	SK	送信	メモ			*/
											/*	---+---+---+---+-------+----------------*/
	/* (初期状態) */						/*	1	0	*	0							*/
	eep_drv_sk_edge_preread();				/*	1	0	*	1/0	0						*/
	tmp = R_PI_EEPMW_DO;					/*											*/
	ret_val.BIT.B15 = tmp;					/*											*/
											/*	1	0	D15	0			D15				*/
	eep_drv_sk_edge_preread();				/*	1	0	*	1/0	0						*/
	tmp = R_PI_EEPMW_DO;					/*											*/
	ret_val.BIT.B14 = tmp;					/*											*/
											/*	1	0	D14	0			D14				*/
	eep_drv_sk_edge_preread();				/*	1	0	*	1/0	0						*/
	tmp = R_PI_EEPMW_DO;					/*											*/
	ret_val.BIT.B13 = tmp;					/*											*/
											/*	1	0	D13	0			D13				*/
	eep_drv_sk_edge_preread();				/*	1	0	*	1/0	0						*/
	tmp = R_PI_EEPMW_DO;					/*											*/
	ret_val.BIT.B12 = tmp;					/*											*/
											/*	1	0	D12	0			D12				*/
	eep_drv_sk_edge_preread();				/*	1	0	*	1/0	0						*/
	tmp = R_PI_EEPMW_DO;					/*											*/
	ret_val.BIT.B11 = tmp;					/*											*/
											/*	1	0	D11	0			D11				*/
	eep_drv_sk_edge_preread();				/*	1	0	*	1/0	0						*/
	tmp = R_PI_EEPMW_DO;					/*											*/
	ret_val.BIT.B10 = tmp;					/*											*/
											/*	1	0	D10	0			D10				*/
	eep_drv_sk_edge_preread();				/*	1	0	*	1/0	0						*/
	tmp = R_PI_EEPMW_DO;					/*											*/
	ret_val.BIT.B09 = tmp;					/*											*/
											/*	1	0	D9	0			D9				*/
	eep_drv_sk_edge_preread();				/*	1	0	*	1/0	0						*/
	tmp = R_PI_EEPMW_DO;					/*											*/
	ret_val.BIT.B08 = tmp;					/*											*/
											/*	1	0	D8	0			D8				*/
	eep_drv_sk_edge_preread();				/*	1	0	*	1/0	0						*/
	tmp = R_PI_EEPMW_DO;					/*											*/
	ret_val.BIT.B07 = tmp;					/*											*/
											/*	1	0	D7	0			D7				*/
	eep_drv_sk_edge_preread();				/*	1	0	*	1/0	0						*/
	tmp = R_PI_EEPMW_DO;					/*											*/
	ret_val.BIT.B06 = tmp;					/*											*/
											/*	1	0	D6	0			D6				*/
	eep_drv_sk_edge_preread();				/*	1	0	*	1/0	0						*/
	tmp = R_PI_EEPMW_DO;					/*											*/
	ret_val.BIT.B05 = tmp;					/*											*/
											/*	1	0	D5	0			D5				*/
	eep_drv_sk_edge_preread();				/*	1	0	*	1/0	0						*/
	tmp = R_PI_EEPMW_DO;					/*											*/
	ret_val.BIT.B04 = tmp;					/*											*/
											/*	1	0	D4	0			D4				*/
	eep_drv_sk_edge_preread();				/*	1	0	*	1/0	0						*/
	tmp = R_PI_EEPMW_DO;					/*											*/
	ret_val.BIT.B03 = tmp;					/*											*/
											/*	1	0	D3	0			D3				*/
	eep_drv_sk_edge_preread();				/*	1	0	*	1/0	0						*/
	tmp = R_PI_EEPMW_DO;					/*											*/
	ret_val.BIT.B02 = tmp;					/*											*/
											/*	1	0	D2	0			D2				*/
	eep_drv_sk_edge_preread();				/*	1	0	*	1/0	0						*/
	tmp = R_PI_EEPMW_DO;					/*											*/
	ret_val.BIT.B01 = tmp;					/*											*/
											/*	1	0	D1	0			D1				*/
	eep_drv_sk_edge_preread();				/*	1	0	*	1/0	0						*/
	tmp = R_PI_EEPMW_DO;					/*											*/
	ret_val.BIT.B00 = tmp;					/*											*/
											/*	1	0	D0	0			D0				*/
	return	ret_val.WORD;
}
#endif /* EEPROMサイズ:16K以下[bit] ポートアクセス用関数 終了 */
