/********************************************************************************/
/* 客先名		:	標準モジュール												*/
/* 機種名		:	SSFT														*/
/* ﾏｲｺﾝｿﾌﾄﾃｰﾏ名	:	PF															*/
/*==============================================================================*/
/* 作成ﾌｧｲﾙ名	:	SSFTSTD_FR81_ReloadTimer_Drv.c								*/
/* 				:	ﾘﾛｰﾄﾞﾀｲﾏﾓｼﾞｭｰﾙ												*/
/*==============================================================================*/
/* 対象ﾏｲｺﾝ		:	MB91570 Series												*/
/*==============================================================================*/
/* 作成ﾊﾞｰｼﾞｮﾝ	:	020201														*/
/* 作成年月日	:	2015.12.09													*/
/* 作成者		:	R.Hiroi														*/
/*------------------------------------------------------------------------------*/
/* 変更履歴		:																*/
/* [010101]		:	新規作成													*/
/* [010102]		:	標準IF対応。起動種別の名称変更								*/
/* 2013.11.19	:	アンダーフローフラグ取得IF追加								*/
/* [020101]		:	上記「アンダーフローフラグ取得IF追加」を正式にVM登録		*/
/* [020201]		:	タイマ値取得関数の修正										*/
/********************************************************************************/

/*** START_INC ***/
/********************************************************************************/
/*   Include File                                                               */
/*------------------------------------------------------------------------------*/
/*      ﾍｯﾀﾞｰﾌｧｲﾙのｲﾝｸﾙｰﾄﾞ文は、下記ﾌｧｲﾙに記載すること                          */
/********************************************************************************/
#include "SSFTSTD_Type.h"
#include "SSFTSTD_Macro.h"
#include "mb91570.h"

#define	 __MB91570_RELOADTIMER_DRV_INTERNAL__
#include "SSFTSTD_FR81_ReloadTimer_Drv.h"

/*==============================================================================*/
/*	typedef定義（外部非公開）													*/
/*==============================================================================*/
#define TMCSR_UF_MASK	(0x0004U)	/* ｺﾝﾄﾛｰﾙﾚｼﾞｽﾀ.ｱﾝﾀﾞｰﾌﾛｰﾋﾞｯﾄマスク */
#define TMCSR_UF_OFF	(0xFFFBU)	/* ｺﾝﾄﾛｰﾙﾚｼﾞｽﾀ.ｱﾝﾀﾞｰﾌﾛｰﾋﾞｯﾄをOFF */
#define TMCSR_CNTE_OFF	(0xFFFDU)	/* ｺﾝﾄﾛｰﾙﾚｼﾞｽﾀ.ｶｳﾝﾄ許可ﾋﾞｯﾄをOFF */
#define TMCSR_CNTE_ON	(0x0002U)	/* ｺﾝﾄﾛｰﾙﾚｼﾞｽﾀ.ｶｳﾝﾄ許可ﾋﾞｯﾄをON */

/*==============================================================================*/
/*	関数ﾌﾟﾛﾄﾀｲﾌﾟ宣言（外部非公開)												*/
/*==============================================================================*/
/* なし */

/*==============================================================================*/
/*	内部定数																	*/
/*==============================================================================*/

/* タイマレジスタアドレステーブル */
static __io volatile const T_ReloadTimeDrv_Cnt *const C_TimerReg[RELOADTIMERDRV_CH_NUMBER] =
{
	&(TMR0_),		/* TMR0のアドレス */
	&(TMR1_),		/* TMR1のアドレス */
	&(TMR2_),		/* TMR2のアドレス */
	&(TMR3_),		/* TMR3のアドレス */
	&(TMR4),		/* TMR4のアドレス */
	&(TMR5),		/* TMR5のアドレス */
	&(TMR6)			/* TMR6のアドレス */
};

/* リロードレジスタアドレステーブル */
static __io volatile T_ReloadTimeDrv_Cnt *const C_ReloadReg[RELOADTIMERDRV_CH_NUMBER] =
{
	&(TMRLRA0),		/* TMRLRA0のアドレス */
	&(TMRLRA1),		/* TMRLRA1のアドレス */
	&(TMRLRA2),		/* TMRLRA2のアドレス */
	&(TMRLRA3),		/* TMRLRA3のアドレス */
	&(TMRLRA4),		/* TMRLRA4のアドレス */
	&(TMRLRA5),		/* TMRLRA5のアドレス */
	&(TMRLRA6)		/* TMRLRA6のアドレス */
};

/* リロードタイマ制御ステータスレジスタアドレステーブル */
static __io volatile UI_16 *const C_ReloadTimerCtrlStatusReg[RELOADTIMERDRV_CH_NUMBER] =
{
	&(TMCSR0),		/* TMCSR0のアドレス */
	&(TMCSR1),		/* TMCSR1のアドレス */
	&(TMCSR2),		/* TMCSR2のアドレス */
	&(TMCSR3),		/* TMCSR3のアドレス */
	&(TMCSR4),		/* TMCSR4のアドレス */
	&(TMCSR5),		/* TMCSR5のアドレス */
	&(TMCSR6)		/* TMCSR6のアドレス */
};

/* リロードタイマ制御ステータスレジスタアドレステーブル */
static UI_16 const C_TmcsrSettingTbl[RELOADTIMERDRV_CH_NUMBER] =
{
	DRV_ACT_TMCSR0,	/* TMCSR0の起動設定値 */
	DRV_ACT_TMCSR1,	/* TMCSR1の起動設定値 */
	DRV_ACT_TMCSR2,	/* TMCSR2の起動設定値 */
	DRV_ACT_TMCSR3,	/* TMCSR3の起動設定値 */
	DRV_ACT_TMCSR4,	/* TMCSR4の起動設定値 */
	DRV_ACT_TMCSR5,	/* TMCSR5の起動設定値 */
	DRV_ACT_TMCSR6	/* TMCSR6の起動設定値 */
};

/* リロードタイマ制御ステータスレジスタアドレステーブル */
static UI_16 const C_ReloadTimerCtrlStopReg[RELOADTIMERDRV_CH_NUMBER] =
{
	DRV_STOP_TMCSR0,/* TMCSR0の停止設定値 */
	DRV_STOP_TMCSR1,/* TMCSR1の停止設定値 */
	DRV_STOP_TMCSR2,/* TMCSR2の停止設定値 */
	DRV_STOP_TMCSR3,/* TMCSR3の停止設定値 */
	DRV_STOP_TMCSR4,/* TMCSR4の停止設定値 */
	DRV_STOP_TMCSR5,/* TMCSR5の停止設定値 */
	DRV_STOP_TMCSR6	/* TMCSR6の停止設定値 */
};

/****************************************************************************************/
/*	[モジュール名]	ReloadTmDrv_Ctrl [名称] ﾘﾛｰﾄﾞﾀｲﾏ制御ﾚｼﾞｽﾀの設定／起動処理			*/
/*======================================================================================*/
/*	[処理概要]	リロードタイマ制御レジスタの設定／起動を行う。							*/
/*======================================================================================*/
/*	[記述形式]	void ReloadTmDrv_Ctrl( E_RELOADTIMERDRV_CH ch,							*/
/*												 T_ReloadTimeDrv_Cnt cycle, UI_8 act )	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	E_RELOADTIMERDRV_CH		ch		：リロードタイマCH						*/
/*				T_ReloadTimeDrv_Cnt		cycle	：リロードタイマ設定値					*/
/*				UI_8					act		：リロードタイマ実行状態				*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]																			*/
/*		引数にD_ENABLEを指定した場合、リロードタイマはD_ENABLE指定時の					*/
/*		リロードタイマ設定値から動作開始となります。									*/
/*		すでにD_ENABLEで動作している場合、リロードタイマはリロードタイマ設定値から		*/
/*		再動作開始となります。															*/
/****************************************************************************************/
void ReloadTmDrv_Ctrl( E_RELOADTIMERDRV_CH ch, T_ReloadTimeDrv_Cnt cycle, UI_8 act )
{
	UI_16 tmcsr_work; /* リロードタイマ制御ステータスレジスタ演算用work変数 */
	
	if ( ch < RELOADTIMERDRV_CH_NUMBER ) {
		if ( act != D_ENABLE ) {
			/* タイマの停止 */
			*C_ReloadTimerCtrlStatusReg[ch] = C_ReloadTimerCtrlStopReg[ch];	/* 指定CHのリロードタイマを停止させる */
			*C_ReloadReg[ch] = cycle;	/* 指定CHのリロードタイマのタイマ値を初期化する */
		} else {
			/* タイマの起動 */
			tmcsr_work = *C_ReloadTimerCtrlStatusReg[ch];
			tmcsr_work &= TMCSR_CNTE_OFF;
			*C_ReloadTimerCtrlStatusReg[ch] = tmcsr_work;	/* 指定CHのリロードタイマのカウンタのみを停止させる */

			tmcsr_work = *C_ReloadTimerCtrlStatusReg[ch];
			tmcsr_work &= TMCSR_UF_OFF;
			*C_ReloadTimerCtrlStatusReg[ch] = tmcsr_work ;	/* 指定CHのリロードタイマのアンダーフローフラグをクリアする */
			*C_ReloadReg[ch] = cycle;	/* 指定CHのリロードタイマのタイマ値を初期化する */
			*C_ReloadTimerCtrlStatusReg[ch] = C_TmcsrSettingTbl[ch];	/* 指定CHのリロードタイマを起動させる */
		}
	}
	
}

/****************************************************************************************/
/*	[モジュール名]	ReloadTmDrv_ReqUnderFlowGet [名称] ﾘﾛｰﾄﾞﾀｲﾏ制御ｱﾝﾀﾞｰﾌﾛｰ取得処理		*/
/*======================================================================================*/
/*	[処理概要]	アンダーフローフラグを取得する。										*/
/*======================================================================================*/
/*	[記述形式]	UI_8 ReloadTmDrv_ReqUnderFlowGet( E_RELOADTIMERDRV_CH ch )				*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	E_RELOADTIMERDRV_CH		ch		：リロードタイマCH						*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_8					uf_flag	：アンダーフロー発生フラグ				*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
UI_8 ReloadTmDrv_ReqUnderFlowGet( E_RELOADTIMERDRV_CH ch )
{
	UI_16 tmcsr_work; /* リロードタイマ制御ステータスレジスタ演算用work変数 */
	UI_8 uf_flag = D_OFF;		/* アンダーフローフラグ */
	
	if ( ch < RELOADTIMERDRV_CH_NUMBER ) {
		tmcsr_work = *C_ReloadTimerCtrlStatusReg[ch];
		tmcsr_work &= TMCSR_UF_MASK;
		if ( tmcsr_work == TMCSR_UF_MASK ) {
			uf_flag = D_ON;
		}
	}
	return uf_flag;
}

/****************************************************************************************/
/*	[モジュール名]	ReloadTmDrv_ReqUnderFlowClr [名称] ﾘﾛｰﾄﾞﾀｲﾏ制御ｱﾝﾀﾞｰﾌﾛｰｸﾘｱ処理		*/
/*======================================================================================*/
/*	[処理概要]	割り込み要因のクリアとしてアンダーフローフラグのみをクリアする。		*/
/*======================================================================================*/
/*	[記述形式]	void ReloadTmDrv_ReqUnderFlowClr( E_RELOADTIMERDRV_CH ch )				*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	E_RELOADTIMERDRV_CH		ch		：リロードタイマCH						*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void ReloadTmDrv_ReqUnderFlowClr( E_RELOADTIMERDRV_CH ch )
{
	UI_16 tmcsr_work; /* リロードタイマ制御ステータスレジスタ演算用work変数 */
	
	if ( ch < RELOADTIMERDRV_CH_NUMBER ) {
		tmcsr_work = *C_ReloadTimerCtrlStatusReg[ch];
		tmcsr_work &= TMCSR_UF_OFF;
		*C_ReloadTimerCtrlStatusReg[ch] = tmcsr_work;	/* 指定CHのリロードタイマのアンダーフローフラグをクリアする */
	}
	
}

/****************************************************************************************/
/*	[モジュール名]	ReloadTmDrv_GetTm [名称] ﾘﾛｰﾄﾞﾀｲﾏ制御ﾀｲﾏ値取得処理					*/
/*======================================================================================*/
/*	[処理概要]	リロードタイマのタイマのカウント値を取得する。							*/
/*======================================================================================*/
/*	[記述形式]	T_ReloadTimeDrv_Cnt ReloadTmDrv_GetTm( E_RELOADTIMERDRV_CH ch )			*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	E_RELOADTIMERDRV_CH		ch		：リロードタイマCH						*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	T_ReloadTimeDrv_Cnt		cnt		：指定CHのリロードタイマカウンタ値		*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
T_ReloadTimeDrv_Cnt ReloadTmDrv_GetTm( E_RELOADTIMERDRV_CH ch )
{
	
	T_ReloadTimeDrv_Cnt cnt;
	
	cnt = 0U;
	
	if ( ch < RELOADTIMERDRV_CH_NUMBER ) {
		cnt = *C_TimerReg[ch];
	}
	
	return cnt;
	
}

/****************************************************************************************/
/*	[モジュール名]	ReloadTmDrv_Init		[名称]	ﾘﾛｰﾄﾞﾀｲﾏ制御ﾚｼﾞｽﾀ初期設定処理		*/
/*======================================================================================*/
/*	[処理概要]	レジスタ初期設定時に本関数を呼び、初期化を行う。						*/
/*======================================================================================*/
/*	[記述形式]	void ReloadTmDrv_Init( E_INIT_TYPE req  )								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	E_INIT_TYPE				req		：起動種別								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void ReloadTmDrv_Init( E_INIT_TYPE req )
{
	
	switch ( req ) {
	case E_INIT_RESET:			/* CPUリセットによる起動 */
	case E_INIT_WAKEUP:			/* 省電力解除（WAKEUP）による起動 */
		/* リロードタイマ制御ステータスレジスタを初期設定 */
		TMCSR0 = INIT_TMCSR0;
		TMCSR1 = INIT_TMCSR1;
		TMCSR2 = INIT_TMCSR2;
		TMCSR3 = INIT_TMCSR3;
		TMCSR4 = INIT_TMCSR4;
		TMCSR5 = INIT_TMCSR5;
		TMCSR6 = INIT_TMCSR6;
		
		/* リロードレジスタを初期設定 */
		TMRLRA0 = INIT_TMRLRA0;
		TMRLRA1 = INIT_TMRLRA1;
		TMRLRA2 = INIT_TMRLRA2;
		TMRLRA3 = INIT_TMRLRA3;
		TMRLRA4 = INIT_TMRLRA4;
		TMRLRA5 = INIT_TMRLRA5;
		TMRLRA6 = INIT_TMRLRA6;
		break;
	case E_INIT_IGN_ON:			/* IG ON */
		break;
	case E_INIT_RET_NORMAL_VOL:	/* 低電圧復帰 */
		break;
	case E_INIT_INTERVAL_WAKEUP:/* 間欠起動ウェイクアップ */
		break;
	default:					/* 上記以外 */
		break;
	}
	
}

/****************************************************************************************/
/*	[モジュール名]	ReloadTmDrv_Sleep	[名称]	ﾘﾛｰﾄﾞﾀｲﾏ制御ﾚｼﾞｽﾀ停止設定処理			*/
/*======================================================================================*/
/*	[処理概要]	省電力モード遷移時に本関数を呼び、初期化を行う。						*/
/*======================================================================================*/
/*	[記述形式]	void ReloadTmDrv_Sleep( void )											*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void ReloadTmDrv_Sleep( void )
{
	
	/* リロードタイマ制御ステータスレジスタを停止設定 */
	TMCSR0 = STOP_TMCSR0;
	TMCSR1 = STOP_TMCSR1;
	TMCSR2 = STOP_TMCSR2;
	TMCSR3 = STOP_TMCSR3;
	TMCSR4 = STOP_TMCSR4;
	TMCSR5 = STOP_TMCSR5;
	TMCSR6 = STOP_TMCSR6;
	
	/* リロードレジスタを停止設定 */
	TMRLRA0 = STOP_TMRLRA0;
	TMRLRA1 = STOP_TMRLRA1;
	TMRLRA2 = STOP_TMRLRA2;
	TMRLRA3 = STOP_TMRLRA3;
	TMRLRA4 = STOP_TMRLRA4;
	TMRLRA5 = STOP_TMRLRA5;
	TMRLRA6 = STOP_TMRLRA6;
	
}

/****************************************************************************************/
/*	[モジュール名]	ReloadTmDrv_Refresh	[名称]	ﾘﾛｰﾄﾞﾀｲﾏ制御ﾚｼﾞｽﾀ再設定設定処理			*/
/*======================================================================================*/
/*	[処理概要]	レジスタ再設定時に本関数を呼び、初期化を行う。							*/
/*======================================================================================*/
/*	[記述形式]	void ReloadTmDrv_Refresh( void )										*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void ReloadTmDrv_Refresh( void )
{
	
	/* 空関数 */
	
}

/****************************************************************************************/
/*	[モジュール名]	ReloadTmDrv_GetTmCntEnaStat	[名称]	ﾘﾛｰﾄﾞﾀｲﾏ ﾀｲﾏ動作許可状態取得処理*/
/*======================================================================================*/
/*	[処理概要]	指定chのリロードタイマ タイマ動作許可状態を取得する						*/
/*======================================================================================*/
/*	[記述形式]	UI_8 ReloadTmDrv_GetTmCntEnaStat( E_RELOADTIMERDRV_CH ch )				*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
UI_8 ReloadTmDrv_GetTmCntEnaStat( E_RELOADTIMERDRV_CH ch )
{
	UI_16	tmcsr;
	UI_8	tm_cnt_stat;
	
	if ( ch < RELOADTIMERDRV_CH_NUMBER ) {
		tmcsr = *C_ReloadTimerCtrlStatusReg[ch];			/* 指定chのｺﾝﾄﾛｰﾙｽﾃｰﾀｽﾚｼﾞｽﾀ値を取得 */
		
		if ( (tmcsr & TMCSR_CNTE_ON) == TMCSR_CNTE_ON ) {	/* ﾀｲﾏｶｳﾝﾄ許可ﾋﾞｯﾄがONになっている */
			tm_cnt_stat = D_ENABLE;							/* ﾀｲﾏ動作許可 */
		} else {
			tm_cnt_stat = D_DISABLE;						/* ﾀｲﾏ動作禁止 */
		}
	} else {
		tm_cnt_stat = D_DISABLE;							/* ﾀｲﾏ動作禁止 */
	}
	
	return tm_cnt_stat;
}

/****************************************************************************************/
/*	[モジュール名]	ReloadTmDrv_GetReloadRegAddr	[名称]	ﾘﾛｰﾄﾞﾀｲﾏ ﾘﾛｰﾄﾞﾚｼﾞｽﾀｱﾄﾞﾚｽ値取得処理*/
/*======================================================================================*/
/*	[処理概要]	指定chのリロードレジスタのアドレス値を"実数"で取得する					*/
/*======================================================================================*/
/*	[記述形式]	UI_32 ReloadTmDrv_GetReloadRegAddr( E_RELOADTIMERDRV_CH ch )			*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	ポインタで渡すとアプリでレジスタ操作できるので、アドレス値まで変換する	*/
/****************************************************************************************/
T_ReloadTimeDrv_ReloadRegAddr ReloadTmDrv_GetReloadRegAddr( E_RELOADTIMERDRV_CH ch )
{
	__io volatile T_ReloadTimeDrv_Cnt	*addr;
	UI_32								out_addr;
	
	if ( ch < RELOADTIMERDRV_CH_NUMBER ) {
		addr = C_ReloadReg[ch];								/* 指定chのﾘﾛｰﾄﾞﾚｼﾞｽﾀｱﾄﾞﾚｽを取得 */
		out_addr = (T_ReloadTimeDrv_ReloadRegAddr)addr;		/* ｱﾄﾞﾚｽ値をｺﾋﾟーする */
	} else {
		out_addr = D_NULL;
	}
	
	return out_addr;
}
