/********************************************************************************/
/* 客先名		:	標準モジュール												*/
/* 機種名		:	SSFT														*/
/* ﾏｲｺﾝｿﾌﾄﾃｰﾏ名	:	PF															*/
/*==============================================================================*/
/* 作成ﾌｧｲﾙ名	:	SSFTSTD_FR81_ADC_Drv.c										*/
/* 				:	A/Dﾓｼﾞｭｰﾙ													*/
/*==============================================================================*/
/* 対象ﾏｲｺﾝ		:	MB91570 Series												*/
/*==============================================================================*/
/* 作成ﾊﾞｰｼﾞｮﾝ	:	010103														*/
/* 作成年月日	:	2013.05.23													*/
/* 作成者		:	K.Uchiyama													*/
/*------------------------------------------------------------------------------*/
/* 変更履歴		:																*/
/* [010101]		:	新規作成													*/
/* [010102]		:																*/
/*				:	変換開始時の動作修正										*/
/*				:	START bitを立てるときBUSY bitにもアクセス					*/
/* [010103]		:	Ａ/Ｄ変換値取得処理の戻り値をSI_8化							*/
/* 				:	機種依存ファイルの切り分け									*/
/********************************************************************************/

/*** START_INC ***/
/********************************************************************************/
/*   Include File                                                               */
/*------------------------------------------------------------------------------*/
/*      ﾍｯﾀﾞｰﾌｧｲﾙのｲﾝｸﾙｰﾄﾞ文は、下記ﾌｧｲﾙに記載すること                          */
/********************************************************************************/
#include "SSFTSTD_Type.h"
#include "SSFTSTD_Macro.h"
#include "mb91570.h"

#define	 __MB91570_ADC_DRV_INTERNAL__
#include "SSFTSTD_FR81_ADC_Drv.h"

/*==============================================================================*/
/*	typedef定義（外部非公開）													*/
/*==============================================================================*/
/* なし */

/*==============================================================================*/
/*	関数ﾌﾟﾛﾄﾀｲﾌﾟ宣言（外部非公開)												*/
/*==============================================================================*/
/* なし */

/*==============================================================================*/
/*	内部定数																	*/
/*==============================================================================*/
#define ADDRV_10BIT_MASK	(0x03FFU)		/* 10bit ADﾃﾞｰﾀﾏｽｸ定義 */
#define ADCS1_START			(0x82U)			/* 変換開始時のADCS1の設定値*/
#define SHIFT_DATA			(0x00000001UL)	/* シフト用データ */
#define ADDRV_8BIT_MASK		(0xFFU)			/* 8ビットマスクデータ */
#define ADDRV_32BIT_MASK	(0xFFFFFFFFUL)	/* 32ビットマスクデータ */

/****************************************************************************************/
/*	[モジュール名]	ADCDrv_GetDataLevel		[名称]	A/D変換値取得処理					*/
/*======================================================================================*/
/*	[処理概要]	A/D変換値取得処理														*/
/*======================================================================================*/
/*	[記述形式]	SI_8 ADCDrv_GetDataLevel( E_ADCDRV_CH ch,								*/
/*												T_ADCDrv_DataLevel *p_datalevel )		*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	E_ADCDRV_CH				ch				: A/D CH						*/
/*				T_ADCDrv_DataLevel *	p_datalevel		: 取得するﾃﾞｰﾀの格納先			*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	SI_8					state			: 実行処理ｽﾃｰﾀｽ					*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
SI_8 ADCDrv_GetDataLevel( E_ADCDRV_CH ch, T_ADCDrv_DataLevel *p_datalevel )
{
	
	SI_8 state;
	UI_8 cnt;
	UI_8 adcs_work; /* A/D制御ステータスレジスタ(上位)演算用work変数 */
	
	state = D_NG;				/* 変換値取得状態 異常 */

	if ( ( ch < ADCDRV_CH_NUMBER ) && ( p_datalevel != D_NULL ) ) {	/* 指定のA/D CHが範囲内かつ、取得するデータの格納先のアドレスがNULL以外 */
		AD_ADCS1_BUSY	= D_OFF;			/* A/D制御ステータスレジスタ(上位  A/D強制停止指示ビット クリア */
		AD_ADCS1_INTE	= D_OFF;			/* A/D制御ステータスレジスタ(上位) A/D割込み要求許可ビット クリア */
		AD_ADCS1_INT	= D_OFF;			/* A/D制御ステータスレジスタ(上位  A/D変換終了フラグビット クリア */
		AD_ADSCH_ANS	= ( UI_8 )ch;		/* A/D開始チャネル設定レジスタ A/D ch */
		AD_ADECH_ANE	= ( UI_8 )ch;		/* A/D終了チャネル設定レジスタ A/D ch */
		adcs_work		= AD_ADCS1;
		adcs_work		|= ADCS1_START;
		AD_ADCS1		= adcs_work;		/* A/D制御ステータスレジスタ(上位) A/D変換のソフトトリガ セット BUSYセット*/
		for ( cnt = 0U ; ( cnt < D_ADWAIT ) && ( AD_ADCS1_INT == D_OFF ) ; cnt++ ) {	/* ループ条件: 変換待ちカウンタ < A/D変換時間 かつ A/D制御ステータスレジスタ(上位)のA/D変換終了フラグ クリア */
			SysClkDrv_UsecWait(D_ADWATCH);
		}
		if ( AD_ADCS1_INT == D_ON ) {			/* A/D制御ステータスレジスタ(上位) 割込み要求あり */
			state = D_OK;						/* 変換値取得状態 正常 */
		}
		/* 正常・異常にかかわらずA/D値は取得*/
		*p_datalevel = AD_ADCR01;
		*p_datalevel &= ADDRV_10BIT_MASK;		/* 取得するデータの格納先にデータレジスタ(A/D値)を10bitマスクしたデータを入れる */
	}

	return state;			/* 変換値取得状態を返す */
}

/****************************************************************************************/
/*	[モジュール名]	ADCDrv_EnableCtrl		[名称]	アナログ入力許可制御処理			*/
/*======================================================================================*/
/*	[処理概要]	アナログ入力許可制御処理												*/
/*======================================================================================*/
/*	[記述形式]	void ADCDrv_EnableCtrl( E_ADCDRV_CH ch, UI_8 req )						*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	E_ADCDRV_CH				ch				: A/Dチャネル					*/
/*				UI_8					req				: アナログ入力許可要求			*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void ADCDrv_EnableCtrl( E_ADCDRV_CH ch, UI_8 req )
{
	UI_8 work_eader; /* 拡張アナログ入力許可レジスタ演算用work変数 */
	UI_32 work_ader; /* アナログ入力許可レジス演算用work変数 */

	if ( ch < ADCDRV_CH32 ) {				/* 指定のA/DチャネルがA/Dチャネル32より小さい */
		work_ader = AD_ADER;
		if ( req == ANALOG_MODE ) {
			/* アナログ入力モード */
			work_ader |= ( SHIFT_DATA << ch );
		} else {
			/* ポート入力/出力モード */
			work_ader &= ( ( SHIFT_DATA << ch ) ^ ADDRV_32BIT_MASK );
		}
		AD_ADER = work_ader;
	} else if ( ch < ADCDRV_CH_NUMBER ) {	/* 指定のA/DチャネルがA/Dチャネル数 最大より小さい */
		work_eader = AD_EADERLL;
		if ( req == ANALOG_MODE ) {
			/* アナログ入力モード */
			work_eader |= ( UI_8 )( SHIFT_DATA << ( ch - ADCDRV_CH32 ) );
		} else {
			/* ポート入力/出力モード */
			work_eader &= ( UI_8 )( ( SHIFT_DATA << ( ch - ADCDRV_CH32 ) ) ^ ADDRV_8BIT_MASK );
		}
		AD_EADERLL = work_eader;
	} else {								/* 指定のA/Dチャネルが範囲外 */
		/* 何もしない */
	}
}

/****************************************************************************************/
/*	[モジュール名]	ADCDrv_Init		[名称]	A/Dﾄﾞﾗｲﾊﾞﾚｼﾞｽﾀ初期設定処理					*/
/*======================================================================================*/
/*	[処理概要]	レジスタ初期設定時に本関数を呼び、初期化を行う。						*/
/*======================================================================================*/
/*	[記述形式]	void ADCDrv_Init( E_INIT_TYPE req  )									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	E_INIT_TYPE				req		：起動種別								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void ADCDrv_Init( E_INIT_TYPE req )
{
	
	switch ( req ) {
	case E_INIT_RESET:			/* CPUリセットによる起動 */
	case E_INIT_WAKEUP:			/* 省電力解除（WAKEUP）による起動 */
		/* A/Dドライバレジスタの初期設定処理 */
		AD_ADCT01_ADCT0 = INIT_ADCT0;
		AD_ADCT01_ADCT1 = INIT_ADCT1;
		AD_ADCS0		= INIT_ADCS0;
		AD_ADCS1		= INIT_ADCS1;
		AD_ADER_ADERL	= INIT_ADERL;
		AD_ADER_ADERH	= INIT_ADERH;
		AD_EADERLL		= INIT_EADERLL;
		AD_ADSCH		= INIT_ADSCH;
		AD_ADECH		= INIT_ADECH;
		break;
	case E_INIT_IGN_ON:			/* IGN ON */
		break;
	case E_INIT_RET_NORMAL_VOL:	/* 低電圧復帰 */
		break;
	case E_INIT_INTERVAL_WAKEUP:/* 間欠起動ウェイクアップ */
		break;
	default:					/* 上記以外 */
		break;
	}
	
}

/****************************************************************************************/
/*	[モジュール名]	ADCDrv_Sleep	[名称]	A/Dﾄﾞﾗｲﾊﾞﾚｼﾞｽﾀ停止設定処理					*/
/*======================================================================================*/
/*	[処理概要]	省電力モード遷移時に本関数を呼び、初期化を行う。						*/
/*======================================================================================*/
/*	[記述形式]	void ADCDrv_Sleep( void )												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void ADCDrv_Sleep( void )
{
	
	/* A/Dドライバレジスタの停止設定処理 */
	AD_ADCT01_ADCT0 = STOP_ADCT0;
	AD_ADCT01_ADCT1 = STOP_ADCT1;	
	AD_ADCS0		= STOP_ADCS0;
	AD_ADCS1		= STOP_ADCS1;
	AD_ADER_ADERL	= STOP_ADERL;
	AD_ADER_ADERH	= STOP_ADERH;
	AD_EADERLL		= STOP_EADERLL;
	AD_ADSCH		= STOP_ADSCH;
	AD_ADECH		= STOP_ADECH;
	
}

/****************************************************************************************/
/*	[モジュール名]	ADCDrv_Refresh	[名称]	A/Dﾄﾞﾗｲﾊﾞﾚｼﾞｽﾀ再設定処理					*/
/*======================================================================================*/
/*	[処理概要]	レジスタ再設定時に本関数を呼び、初期化を行う。							*/
/*======================================================================================*/
/*	[記述形式]	void ADCDrv_Refresh( void )												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void ADCDrv_Refresh( void )
{
	
	/* 空関数 */
	
}

