/********************************************************************************/
/* 客先名		:	標準モジュール												*/
/* 機種名		:	SSFT														*/
/* ﾏｲｺﾝｿﾌﾄﾃｰﾏ名	:	PF															*/
/*==============================================================================*/
/* 作成ﾌｧｲﾙ名	:	SSFTSTD_FR81_RstDrv.c										*/
/* 				:	ﾘｾｯﾄﾄﾞﾗｲﾊﾞﾓｼﾞｭｰﾙ											*/
/*==============================================================================*/
/* 対象ﾏｲｺﾝ		:	MB91570 Series												*/
/*==============================================================================*/
/* 作成ﾊﾞｰｼﾞｮﾝ	:	010101														*/
/* 作成年月日	:	2012.07.17													*/
/* 作成者		:	K.Horikawa													*/
/*------------------------------------------------------------------------------*/
/* 変更履歴		:																*/
/* [010101]		:	新規作成													*/
/********************************************************************************/

/*** START_INC ***/
/********************************************************************************/
/*   Include File                                                               */
/*------------------------------------------------------------------------------*/
/*      ﾍｯﾀﾞｰﾌｧｲﾙのｲﾝｸﾙｰﾄﾞ文は、下記ﾌｧｲﾙに記載すること                          */
/********************************************************************************/
#include "SSFTSTD_Type.h"
#include "SSFTSTD_Macro.h"
#include "SSFTSTD_MacroFunc.h"
#include "mb91570.h"

#define	 __MB91570_RST_DRV_INTERNAL__
#include "SSFTSTD_FR81_Rst_Drv.h"

/*==============================================================================*/
/*	typedef定義（外部非公開）													*/
/*==============================================================================*/
typedef struct {
	UI_8	rstrr;							/* RSTRRレジスタ */
	UI_8	pmustr;							/* PMUSTRレジスタ */
	UI_8	cpuar;							/* CPUARレジスタ */
	UI_8	csvcr_mm			:1;			/* CSVCR_MMビット */
	UI_8	lvd_f				:1;			/* LVD.LVD_Fビット */
	UI_8	lvd5f_f				:1;			/* LVD5F.LVD5F_Fビット */
	UI_8	shutdown_state		:1;			/* 電源遮断からの復帰(D_ON：電源遮断からの復帰、D_OFF：リセット) */
	UI_8	reserve				:4;			/* 予約領域 */
} T_RstFactor;

/*==============================================================================*/
/*	関数ﾌﾟﾛﾄﾀｲﾌﾟ宣言（外部非公開)												*/
/*==============================================================================*/
static void set_csvcr( UI_8 set_data );		/* ｸﾛｯｸｽｰﾊﾟﾊﾞｲｻﾞ制御ﾚｼﾞｽﾀ設定処理 */

/*==============================================================================*/
/*	内部変数																	*/
/*==============================================================================*/
static	T_RstFactor S_rst_factor;			/* リセット要因 */

/*==============================================================================*/
/*	内部定数																	*/
/*==============================================================================*/
#define CSVCR_MM_MASK			(0x40U)			/* CSVCR.MMビット用のマスク定義 */
#define CSVCR_MM_POSITION		(6U)			/* CSVCR_MMビットの位置 */
#define CLR_CSVCR_MM			(0x3EU)			/* CSVCR.MMビットクリア用定義 */
#define CSVCR_RCE_MASK			(0x10U)			/* CSVCR.RCEビット用のマスク定義 */

#define RST_RSTRR_POSITION		(0U)			/* RSTRRのリセット要因位置	*/
#define RST_CPUAR_POSITION		(8U)			/* CPUARのリセット要因位置	*/
#define RST_PMUSTR_POSITION		(16U)			/* PMUSTRのリセット要因位置	*/
#define RST_LVD_F_POSITION		(24U)			/* LVD_Fのリセット要因位置	*/
#define RST_LVD5F_F_POSITION	(25U)			/* LVD5F_Fのリセット要因位置	*/
#define RST_CSVCR_MM_POSITION	(26U)			/* CSVCR_MMのリセット要因位置	*/

#define RSTRR_RESET_MASK		(0xF3U)			/*	RSTRRのリセット要因以外のbitをOFFにする */
#define CPUAR_RESET_MASK		(0x07U)			/*	CPUARのリセット要因以外のbitをOFFにする */

#define RSTRR_SHUTDOWN_MASK		(0xC0U)			/* RSTRRレジスタ(ShutDown判定用)マスク */

#define PMUSTR_MASK				(0x83U)			/* PMUSTRマスク値 */
#define PMUSTR_SHUTDOWN_MASK	(0x80U)			/* PMUSTR_PMUST(ShutDwon)のマスク値 */

#define LOW_VOLT_FLAG			(0x01U)			/* 低電圧検出 */

#define CPUAR_PSTF_MASK			(0x02U)			/* CPUAR.PSTFビット用マスク */
/****************************************************************************************/
/*	[モジュール名]	RstDrv_GetRstFlg		[名称]	ﾘｾｯﾄ要因ﾌﾗｸﾞﾚｼﾞｽﾀ値の取得処理		*/
/*======================================================================================*/
/*	[処理概要]	RSTRR、CPUAR、PMUSTRのﾚｼﾞｽﾀを読出し、発生しているﾘｾｯﾄ状態を返す。		*/
/*																 ﾘｾｯﾄ要因を返す。		*/
/*======================================================================================*/
/*	[記述形式]	SI_8 RstDrv_GetRstFlg( UI_32 *reg_data )								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_32 *		reg_data													*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	SI_8		rst_state													*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
SI_8 RstDrv_GetRstFlg( UI_32 *reg_data )
{
	UI_8 work;
	SI_8 rst_state;						/* リセット状態(NG：リセット、OK：ウェイクアップ) */
	
	S_rst_factor.pmustr = PMUSTR;		/* PMUステータスレジスタを参照 */
	PMUSTR_PMUST = D_OFF;				/* シャットダウン要因クリア */
	PMUCTLR_SHDE = D_OFF;				/* シャットダウン要求クリア */
	
	S_rst_factor.csvcr_mm = (CSVCR & CSVCR_MM_MASK) >> CSVCR_MM_POSITION;	/* CSVCR.MM(メインクロック停止検出) */
	
	S_rst_factor.rstrr = RSTRR;					/* RSTRRレジスタの要因保持&初期化 */
	S_rst_factor.cpuar = CPUAR;					/* CPUARレジスタの要因保持 */
	S_rst_factor.lvd_f = LVD_LVD_F;				/* LVD.LVD_Fビットの要因保持 */
	S_rst_factor.lvd5f_f = LVD5F_LVD5F_F;		/* LVD5F.LVD5F_Fビットの要因保持 */
	
	*reg_data = 0U;
	rst_state = D_NG;							/* 戻り値：リセット起動 */
	S_rst_factor.shutdown_state = D_OFF;		/* リセット起動 */
	
	/* クロックスーパバイザリセット要因消去 */
	if (D_ON == S_rst_factor.csvcr_mm) {
		/* メインクロック停止検出した場合 */	
		
		/* CSVCR.MMビットがクリアされるまでポーリング */
		do {
			work = CSVCR;
			work = work & CLR_CSVCR_MM;				/* CSVCR.MMビットをクリア */
			CSVCR = work;
		} while ((CSVCR & CSVCR_MM_MASK) == CSVCR_MM_MASK);
		
		/* クロックスーパバイザによるリセットを検出した場合、戻り値をリセット起動のままとする */
	} else {
		/* リセット要因の判定 */
		
		if (((S_rst_factor.rstrr & RSTRR_SHUTDOWN_MASK) == RSTRR_SHUTDOWN_MASK) &&
			((S_rst_factor.pmustr & PMUSTR_MASK) == PMUSTR_SHUTDOWN_MASK)) {
			/* シャットダウンからの復帰 */
			if ((S_rst_factor.lvd5f_f != LOW_VOLT_FLAG) &&
				(S_rst_factor.lvd_f != LOW_VOLT_FLAG) &&
				((S_rst_factor.cpuar & CPUAR_PSTF_MASK) != CPUAR_PSTF_MASK)) {
				/* 内部/外部低電圧リセット、不正スタンバイ移行リセット発生していない */
				rst_state = D_OK;					/* 戻り値：ウェイクアップ起動 */
				S_rst_factor.shutdown_state = D_ON;	/* ウェイクアップ起動 */
			}
		}
	}
	
	return rst_state;
	
}

/****************************************************************************************/
/*	[モジュール名]	RstDrv_GetRstFactor		[名称]	ﾘｾｯﾄ要因保持値の取得処理			*/
/*======================================================================================*/
/*	[処理概要]	保持しているﾘｾｯﾄ要因を返す。											*/
/*======================================================================================*/
/*	[記述形式]	UI_32 RstDrv_GetRstFactor( void )										*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	UI_32	RstFactor														*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
UI_32 RstDrv_GetRstFactor( void )
{
	UI_32 rst_ret;
	UI_8 rst_data;						/* レジスタ退避先 */
	

	rst_data = S_rst_factor.rstrr;
	rst_data &= RSTRR_RESET_MASK;		/* RSTRR :リセット要因ビット以外は見ない 		*/
	rst_ret = rst_data;					/* RSTRRデータの位置を合わせて保存*/
	
	rst_data = S_rst_factor.cpuar;
	rst_data &= CPUAR_RESET_MASK;			/* CPUAR :リセット要因ビット以外は見ない 		*/
	rst_ret |= (UI_32)(rst_data) << RST_CPUAR_POSITION;		/* CPUARデータの位置を合わせて保存*/
	
	rst_data = S_rst_factor.pmustr;
	rst_data &= PMUSTR_MASK;				/* PMUSTR :リセット要因ビット以外は見ない 		*/
	rst_ret |= (UI_32)(rst_data) << RST_PMUSTR_POSITION;	/* PMUSTRデータの位置を合わせて保存*/
	
	rst_ret |= ((UI_32)S_rst_factor.lvd_f << RST_LVD_F_POSITION);	/* 内部低電圧検出リセット */
	rst_ret |= ((UI_32)S_rst_factor.lvd5f_f << RST_LVD5F_F_POSITION);	/* 外部低電圧検出リセット */
	
	rst_ret |= ((UI_32)S_rst_factor.csvcr_mm << RST_CSVCR_MM_POSITION);	/* クロックスーパバイザリセット */
	
	return rst_ret;				/* ﾘｾｯﾄ要因*/
	
}

/****************************************************************************************/
/*	[モジュール名]	RstDrv_ReqSoftRst		[名称]	ﾘｾｯﾄﾄﾞﾗｲﾊﾞｿﾌﾄﾘｾｯﾄ発行処理			*/
/*======================================================================================*/
/*	[処理概要]	ｿﾌﾄｳｪｱﾘｾｯﾄを発行する。													*/
/*======================================================================================*/
/*	[記述形式]	void RstDrv_ReqSoftRst( void )											*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void RstDrv_ReqSoftRst( void )
{
	
	UI_8 dummy;
	
	dummy = RSTRR;					/* RSTRRクリア前にソフトウェアリセットが発生した場合に */
									/* 前回のRSTRRが保持されてしまうため、リセット発行前に */
									/* クリアしておく。 */
	
	RSTCR_SRST = D_ON;
	
	dummy = RSTCR;					/* 読み出すことによりソフトウェアリセット要求を発生させる */
	
	D_NOP10();						/* パイプライン処理用にNOP×10 */
	
}

/****************************************************************************************/
/*	[モジュール名]	RstDrv_Init		[名称]	ﾘｾｯﾄﾄﾞﾗｲﾊﾞﾚｼﾞｽﾀ初期化処理					*/
/*======================================================================================*/
/*	[処理概要]	レジスタ初期設定時に本関数を呼び、初期化を行う。						*/
/*======================================================================================*/
/*	[記述形式]	void RstDrv_Init( E_INIT_TYPE req  )									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	E_INIT_TYPE				req		：起動種別								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void RstDrv_Init( E_INIT_TYPE req )
{
	UI_8 dummy;
	
	switch ( req ) {
	case E_INIT_RESET:				/* CPUリセットによる起動 */
	case E_INIT_WAKEUP:				/* 省電力解除（WAKEUP）による起動 */
		/* リセットドライバレジスタ初期化処理 */
		dummy			= RSTRR;			/* RSTRRはリードによってすべてのビットがクリアされる */
		RSTCR			= INIT_RSTCR;
		CPUAR_PMDF		= INIT_CPUAR_PMDF;
		CPUAR_PSTF		= INIT_CPUAR_PSTF;
		CPUAR_HWDF		= INIT_CPUAR_HWDF;
		CPUAR_PSTRE		= INIT_CPUAR_PSTRE;
		PMUSTR			= INIT_PMUSTR;
		set_csvcr(INIT_CSVCR);
		LVD_LVD_OE		= D_OFF;
		LVD				= INIT_LVD;
		LVD5R			= INIT_LVD5R;
		LVD5F_LVD5F_OE	= D_OFF;
		LVD5F			= INIT_LVD5F;
		break;
	case E_INIT_IGN_ON:				/* IGN ON */
		break;
	case E_INIT_RET_NORMAL_VOL:		/* 低電圧復帰 */
		break;
	case E_INIT_INTERVAL_WAKEUP:	/* 間欠起動ウェイクアップ */
		break;
	default:						/* 上記以外 */
		break;
	}
	
}

/****************************************************************************************/
/*	[モジュール名]	RstDrv_Sleep	[名称]	ﾘｾｯﾄﾄﾞﾗｲﾊﾞﾚｼﾞｽﾀ停止処理						*/
/*======================================================================================*/
/*	[処理概要]	省電力モード遷移時に本関数を呼び、初期化を行う。						*/
/*======================================================================================*/
/*	[記述形式]	void RstDrv_Sleep( void )												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void RstDrv_Sleep( void )
{
	set_csvcr(STOP_CSVCR);
	LVD_LVD_OE		= D_OFF;
	LVD				= STOP_LVD;
	LVD5R			= STOP_LVD5R;
	LVD5F_LVD5F_OE	= D_OFF;
	LVD5F			= STOP_LVD5F;
	
}

/****************************************************************************************/
/*	[モジュール名]	RstDrv_Refresh	[名称]	ﾘｾｯﾄﾄﾞﾗｲﾊﾞﾚｼﾞｽﾀ再設定処理					*/
/*======================================================================================*/
/*	[処理概要]	レジスタ再設定時に本関数を呼び、初期化を行う。							*/
/*======================================================================================*/
/*	[記述形式]	void RstDrv_Refresh( void )												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void RstDrv_Refresh( void )
{
	
	/* 空関数 */
	
}

/****************************************************************************************/
/*	[モジュール名]	set_csvcr	[名称]	ｸﾛｯｸｽｰﾊﾟﾊﾞｲｻﾞ制御ﾚｼﾞｽﾀ設定処理					*/
/*======================================================================================*/
/*	[処理概要]	ｸﾛｯｸｽｰﾊﾟﾊﾞｲｻﾞ制御ﾚｼﾞｽﾀの設定を行う。									*/
/*======================================================================================*/
/*	[記述形式]	static void set_csvcr( UI_8 set_data )									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	UI_8	set_data	: ﾚｼﾞｽﾀ設定値										*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
static void set_csvcr( UI_8 set_data )
{
	UI_8	work;
	
	work = CSVCR;
	
	if (((work & CSVCR_RCE_MASK) == CSVCR_RCE_MASK) && 
		((set_data & CSVCR_RCE_MASK) != CSVCR_RCE_MASK)) {
		/* CSVCR.RCEを 1 ⇒ 0 に変更する場合 */
		
		work = set_data | CSVCR_RCE_MASK | CSVCR_MM_MASK;		/* CSVCR.RCE,CSVCR.MM以外を設定 */
		CSVCR = work;
		
		work = CSVCR;
		
		if ((work & CSVCR_MM_MASK) != CSVCR_MM_MASK) {
			/* CSVCR.MM = 0(メインクロック正常)なら、CSVCR.RCE = 0にする */
			
			CSVCR = set_data;									/* CSVCR.RCE,CSVCR.MMを含めて設定 */
		}
	} else {
		/* CSVCR.RCEを 0 ⇒ 1 に変更 又は、変更しない場合 */
		
		CSVCR = set_data;										/* そのまま設定 */
	}
}
