/********************************************************************************/
/* 客先名		:	標準モジュール												*/
/* 機種名		:	SSFT														*/
/* ﾏｲｺﾝｿﾌﾄﾃｰﾏ名	:	PF															*/
/*==============================================================================*/
/* 作成ﾌｧｲﾙ名	:	SSFTSTD_FR81_Flash_Drv.c									*/
/* 				:	ﾌﾗｯｼｭ書き換えﾄﾞﾗｲﾊﾞ											*/
/*==============================================================================*/
/* 対象ﾏｲｺﾝ		:	MB91570 Series												*/
/*==============================================================================*/
/* 作成ﾊﾞｰｼﾞｮﾝ	:	010101														*/
/* 作成年月日	:	2012.07.13													*/
/* 作成者		:	K.Horikawa													*/
/*------------------------------------------------------------------------------*/
/* 変更履歴		:																*/
/* [040101]		:	データフラッシュドライバ作成に伴い、						*/
/*					ワークフラッシュ用のレジスタアクセスの処理を削除			*/
/********************************************************************************/

/*** START_INC ***/
/********************************************************************************/
/*   Include File                                                               */
/*------------------------------------------------------------------------------*/
/*      ﾍｯﾀﾞｰﾌｧｲﾙのｲﾝｸﾙｰﾄﾞ文は、下記ﾌｧｲﾙに記載すること                          */
/********************************************************************************/
#include "SSFTSTD_Type.h"
#include "SSFTSTD_Macro.h"
#include "mb91570.h"

#define	 __MB91570_FLASH_DRV_INTERNAL__
#include "SSFTSTD_FR81_Flash_Drv.h"

/*==============================================================================*/
/*	typedef定義（外部非公開）													*/
/*==============================================================================*/
#ifdef FLASH_DRV_REPRGM_ENABLE
/* ﾌﾗｯｼｭ動作情報の構造体 */
typedef struct t_flashdrv_t {
	E_FLASHDRV_STATE		state;					/* ｽﾃｰﾀｽ					*/
	T_FlashDrv_Addr			addr;					/* 書き込み/消去ｱﾄﾞﾚｽ		*/
	UI_16					wrdata;					/* 書き込みﾃﾞｰﾀ				*/
}T_FlashDrv;
#endif	/* FLASH_DRV_REPRGM_ENABLE */

/*==============================================================================*/
/*	関数ﾌﾟﾛﾄﾀｲﾌﾟ宣言（外部非公開)												*/
/*==============================================================================*/
#ifdef FLASH_DRV_REPRGM_ENABLE
static E_FLASHDRV_STATE flash_drv_write_polling( void );
static E_FLASHDRV_STATE flash_drv_erase_toggle( void );
static void flash_drv_reset( E_FLASHDRV_STATE state );
#endif	/* FLASH_DRV_REPRGM_ENABLE */

/*==============================================================================*/
/*	内部定数																	*/
/*==============================================================================*/
/* なし */

/*==============================================================================*/
/*	内部マクロ																	*/
/*==============================================================================*/
#define MASK_LAST_HALFWORD			(0x00000002U)	/* 書き込みｱﾄﾞﾚｽﾏｽｸ:後半のﾊｰﾌﾜｰﾄﾞ	*/
#define BIT_SHIFT_8					(8U)			/* ﾋﾞｯﾄｼﾌﾄ用				*/

/*==============================================================================*/
/*	内部変数																	*/
/*==============================================================================*/
#ifdef FLASH_DRV_REPRGM_ENABLE
static T_FlashDrv				FlashDrvInfo;
#endif	/* FLASH_DRV_REPRGM_ENABLE */

/****************************************************************************************/
/*	[モジュール名]	FlashDrv_Init		[名称]	ﾌﾗｯｼｭ書き換えﾄﾞﾗｲﾊﾞﾚｼﾞｽﾀ初期設定処理	*/
/*======================================================================================*/
/*	[処理概要]	ﾚｼﾞｽﾀ初期設定時に本関数を呼び、初期化を行う。							*/
/*======================================================================================*/
/*	[記述形式]	void FlashDrv_Init( E_INIT_TYPE req  )									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	E_INIT_TYPE				req		：起動種別								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void FlashDrv_Init( E_INIT_TYPE req )
{
	
	switch ( req ) {
	case E_INIT_RESET:			/* CPUﾘｾｯﾄによる起動 */
	case E_INIT_WAKEUP:			/* 省電力解除（WAKEUP）による起動 */
		/* ﾌﾗｯｼｭ書き換えﾄﾞﾗｲﾊﾞﾚｼﾞｽﾀの初期設定 */
		FCTLR		= INIT_FCTLR;
		FSTR		= INIT_FSTR;
		FLIFCTLR	= INIT_FLIFCTLR;

#ifdef FLASH_DRV_REPRGM_ENABLE
		/* ﾌﾗｯｼｭ動作情報の初期設定 */
		FlashDrvInfo.state	= E_FLASHDRV_IDLE;
		FlashDrvInfo.addr	= 0U;
		FlashDrvInfo.wrdata	= 0U;
#endif	/* FLASH_DRV_REPRGM_ENABLE */

		break;
	case E_INIT_IGN_ON:			/* IGN ON */
		break;
	case E_INIT_RET_NORMAL_VOL:	/* 低電圧復帰 */
		break;
	case E_INIT_INTERVAL_WAKEUP:	/* 間欠起動ｳｪｲｸｱｯﾌﾟ */
		break;
	default:					/* 上記以外 */
		break;
	}
	
}

/****************************************************************************************/
/*	[モジュール名]	FlashDrv_Sleep	[名称]	ﾌﾗｯｼｭ書き換えﾄﾞﾗｲﾊﾞﾚｼﾞｽﾀ停止設定処理		*/
/*======================================================================================*/
/*	[処理概要]	省電力ﾓｰﾄﾞ遷移時に本関数を呼び、初期化を行う。							*/
/*======================================================================================*/
/*	[記述形式]	void FlashDrv_Sleep( void )												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void FlashDrv_Sleep( void )
{
	
	/* ﾌﾗｯｼｭ書き換えﾄﾞﾗｲﾊﾞﾚｼﾞｽﾀの停止設定処理 */
	FCTLR		= STOP_FCTLR;
	FSTR		= STOP_FSTR;
	FLIFCTLR	= STOP_FLIFCTLR;
	
}

/****************************************************************************************/
/*	[モジュール名]	FlashDrv_Refresh	[名称]	ﾌﾗｯｼｭ書き換えﾄﾞﾗｲﾊﾞﾚｼﾞｽﾀ再設定処理		*/
/*======================================================================================*/
/*	[処理概要]	ﾚｼﾞｽﾀ再設定時に本関数を呼び、初期化を行う。								*/
/*======================================================================================*/
/*	[記述形式]	void FlashDrv_Refresh( void )											*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void FlashDrv_Refresh( void )
{
	
	/* 空関数 */
	
}

#ifdef FLASH_DRV_REPRGM_ENABLE
/****************************************************************************************/
/*	[モジュール名]	FlashDrv_Read		[名称]	ﾌﾗｯｼｭ書き換えﾄﾞﾗｲﾊﾞﾌﾗｯｼｭ読み込み処理	*/
/*======================================================================================*/
/*	[処理概要]	指定されたｱﾄﾞﾚｽからﾃﾞｰﾀを読み込む。										*/
/*======================================================================================*/
/*	[記述形式]	SI_8 FlashDrv_Read( T_FlashDrv_Addr read_addr,							*/
/*									 UI_8 *read_data, UI_16 data_size )					*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	T_FlashDrv_Addr		read_addr	：読み込みｱﾄﾞﾚｽ							*/
/*				UI_8				*read_data	：読み込みﾃﾞｰﾀ							*/
/*				UI_16				data_size	：読み込みﾃﾞｰﾀのｻｲｽﾞ(byte)				*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	SI_8				ret			：読み込みOK(D_OK)						*/
/*												：読み込みNG(D_NG)						*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
SI_8 FlashDrv_Read( T_FlashDrv_Addr read_addr, UI_8 *read_data, UI_16 data_size )
{
	UI_8	count;
	UI_8	*temp_addr;
	SI_8	ret = D_NG;

	/* 読み込みｱﾄﾞﾚｽ範囲、ｱﾗｲﾝﾄﾞとﾃﾞｰﾀｻｲｽﾞをﾁｪｯｸする */
	if ( ( ( FLASH_START_ADDR <= read_addr ) && ( read_addr <= FLASH_END_ADDR ) ) &&
		 ( ( read_addr % D_FLASHDRV_DATASIZE ) == 0U ) &&
		 ( data_size == D_FLASHDRV_DATASIZE ) ) {

		temp_addr = (UI_8 *)read_addr;

		for ( count = 0U; count < D_FLASHDRV_DATASIZE; count++ ) {
			/* 指定ｱﾄﾞﾚｽのﾃﾞｰﾀを読み込む */
			read_data[count] = temp_addr[count];
		}

		ret = D_OK;
	}

	return ret;
}

/****************************************************************************************/
/*	[モジュール名]	FlashDrv_Write		[名称]	ﾌﾗｯｼｭ書き換えﾄﾞﾗｲﾊﾞﾌﾗｯｼｭ書き込み処理	*/
/*======================================================================================*/
/*	[処理概要]	指定されたｱﾄﾞﾚｽにﾃﾞｰﾀを書き込む。										*/
/*======================================================================================*/
/*	[記述形式]	SI_8 FlashDrv_Write( T_FlashDrv_Addr write_addr,						*/
/*									 UI_8 *write_data, UI_16 data_size )				*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	T_FlashDrv_Addr		write_addr	：書き込みｱﾄﾞﾚｽ							*/
/*				UI_8				*write_data	：書き込みﾃﾞｰﾀ							*/
/*				UI_16				data_size	：書き込みﾃﾞｰﾀのｻｲｽﾞ(byte)				*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	SI_8				ret			：書き込みOK(D_OK)						*/
/*												：書き込みNG(D_NG)						*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
SI_8 FlashDrv_Write( T_FlashDrv_Addr write_addr, const UI_8 *write_data, UI_16 data_size )
{
	T_FlashDrv_Addr		flash_algo1_addr;
	T_FlashDrv_Addr		flash_algo2_addr;
	T_FlashDrv_Addr		flash_algo3_addr;
	T_FlashDrv_Addr		temp_addr;
	UI_16				temp_data;
	UI_8				dummy;
	SI_8				ret = D_NG;

	/* 書き込みｱﾄﾞﾚｽ範囲、ｱﾗｲﾝﾄﾞとﾃﾞｰﾀｻｲｽﾞをﾁｪｯｸする */
	if ( ( FLASH_START_ADDR <= write_addr ) && ( write_addr <= FLASH_END_ADDR ) &&
		 ( ( write_addr % D_FLASHDRV_DATASIZE ) == 0U ) &&
		 ( data_size == D_FLASHDRV_DATASIZE ) ) {
		/* CPUﾓｰﾄﾞと書き込み許可ﾋﾞｯﾄをﾁｪｯｸする */
		if ( ( FCTLR_FWE == D_ON ) && ( FSTR_FRDY == D_ON ) ) {
			/* 1ﾜｰﾄﾞﾃﾞｰﾀ書き込み開始時にECCｴﾗｰ訂正ﾌﾗｸﾞをｸﾘｱする */
			if ( ( write_addr & MASK_LAST_HALFWORD ) != MASK_LAST_HALFWORD ) {
				/* 前半のﾊｰﾌﾜｰﾄﾞの場合は、ECCｴﾗｰ訂正ﾌﾗｸﾞをｸﾘｱする */
				FSTR_FECCERR = D_OFF;
			}

			/* 書き込みｺﾏﾝﾄﾞｱﾄﾞﾚｽを算出する */
			temp_data = (UI_16)((UI_16)(((UI_16)write_data[0]) << BIT_SHIFT_8) + write_data[1]);
			temp_addr = write_addr & FLASH_ALGO_OFFSET_MASK;
			flash_algo1_addr	= temp_addr + FLASH_ALGO1_OFFSET;
			flash_algo2_addr	= temp_addr + FLASH_ALGO2_OFFSET;
			flash_algo3_addr	= temp_addr + FLASH_ALGO3_OFFSET;

			/* ﾊｰﾌﾜｰﾄﾞの書き込み */
			(*(volatile UI_16*)flash_algo1_addr)	= FLASH_ALGO1_VALUE;	/* 第1書き込みｻｲｸﾙ */
			(*(volatile UI_16*)flash_algo2_addr)	= FLASH_ALGO2_VALUE;	/* 第2書き込みｻｲｸﾙ */
			(*(volatile UI_16*)flash_algo3_addr)	= FLASH_ALGOW_VALUE;	/* 第3書き込みｻｲｸﾙ */
			(*(volatile UI_16*)write_addr)			= temp_data;			/* data書き込みｻｲｸﾙ */

			/* ﾌﾗｯｼｭ動作情報の格納 */
			FlashDrvInfo.state	= E_FLASHDRV_WRITE;
			FlashDrvInfo.addr	= write_addr;
			FlashDrvInfo.wrdata	= temp_data;

			/* FSTRﾚｼﾞｽﾀﾀﾞﾐｰﾘｰﾄﾞ */
			dummy = FSTR;

			ret = D_OK;
		}
	}

	return ret;
}

/****************************************************************************************/
/*	[モジュール名]	FlashDrv_Erase		[名称]	ﾌﾗｯｼｭ書き換えﾄﾞﾗｲﾊﾞﾌﾗｯｼｭ消去処理		*/
/*======================================================================================*/
/*	[処理概要]	指定されたｱﾄﾞﾚｽのﾃﾞｰﾀを消去する。										*/
/*======================================================================================*/
/*	[記述形式]	SI_8 FlashDrv_Erase( T_FlashDrv_Addr erase_addr )						*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	T_FlashDrv_Addr		erase_addr	：消去ｱﾄﾞﾚｽ								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	SI_8				ret			：消去OK(D_OK)、消去NG(D_NG)			*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
SI_8 FlashDrv_Erase( T_FlashDrv_Addr erase_addr )
{
	T_FlashDrv_Addr	flash_algo1_addr;
	T_FlashDrv_Addr	flash_algo2_addr;
	T_FlashDrv_Addr	flash_algo3_addr;
	T_FlashDrv_Addr	flash_algo4_addr;
	T_FlashDrv_Addr	flash_algo5_addr;
	T_FlashDrv_Addr	flash_algo6_addr;
	T_FlashDrv_Addr	temp_addr;
	UI_8			dummy;
	SI_8			ret = D_NG;

	/* 消去ｱﾄﾞﾚｽ範囲をﾁｪｯｸする */
	if ( ( FLASH_START_ADDR <= erase_addr ) && ( erase_addr <= FLASH_END_ADDR ) ) {
		/* CPUﾓｰﾄﾞと消去許可ﾋﾞｯﾄをﾁｪｯｸする */
		if ( ( FCTLR_FWE == D_ON ) && ( FSTR_FRDY == D_ON ) ) {
			/* 自動ｱﾙｺﾞﾘｽﾞﾑ消去ｺﾏﾝﾄﾞｱﾄﾞﾚｽを算出する */
			temp_addr = erase_addr & FLASH_ALGO_OFFSET_MASK;
			flash_algo1_addr	= temp_addr + FLASH_ALGO1_OFFSET;
			flash_algo2_addr	= temp_addr + FLASH_ALGO2_OFFSET;
			flash_algo3_addr	= temp_addr + FLASH_ALGO3_OFFSET;
			flash_algo4_addr	= temp_addr + FLASH_ALGO4_OFFSET;
			flash_algo5_addr	= temp_addr + FLASH_ALGO5_OFFSET;
			flash_algo6_addr	= erase_addr;

			/* 指定ﾌﾞﾛｯｸの前半ｾｸﾀに自動ｱﾙｺﾞﾘｽﾞﾑ消去ｺﾏﾝﾄﾞを実行する */
			(*(volatile UI_16*)flash_algo1_addr)	= FLASH_ALGO1_VALUE;
			(*(volatile UI_16*)flash_algo2_addr)	= FLASH_ALGO2_VALUE;
			(*(volatile UI_16*)flash_algo3_addr)	= FLASH_ALGO3_VALUE;
			(*(volatile UI_16*)flash_algo4_addr)	= FLASH_ALGO4_VALUE;
			(*(volatile UI_16*)flash_algo5_addr)	= FLASH_ALGO5_VALUE;
			(*(volatile UI_16*)flash_algo6_addr)	= FLASH_ALGOE_VALUE;

			flash_algo6_addr = erase_addr + FLASH_SC_UNIT;
			/* 指定ﾌﾞﾛｯｸの後半ｾｸﾀに自動ｱﾙｺﾞﾘｽﾞﾑ消去ｺﾏﾝﾄﾞを実行する */
			if ( ( (*(volatile UI_16*)flash_algo6_addr) & FLASH_SETI ) == FLASH_SETI ) {
				/* 指定ﾌﾞﾛｯｸの前半ｾｸﾀの消去ｳｪｲﾄ期間を超過している */
				(*(volatile UI_16*)flash_algo1_addr)	= FLASH_ALGO1_VALUE;
				(*(volatile UI_16*)flash_algo2_addr)	= FLASH_ALGO2_VALUE;
				(*(volatile UI_16*)flash_algo3_addr)	= FLASH_ALGO3_VALUE;
				(*(volatile UI_16*)flash_algo4_addr)	= FLASH_ALGO4_VALUE;
				(*(volatile UI_16*)flash_algo5_addr)	= FLASH_ALGO5_VALUE;
				(*(volatile UI_16*)flash_algo6_addr)	= FLASH_ALGOE_VALUE;
			} else {
				/* 指定ﾌﾞﾛｯｸの前半ｾｸﾀの消去ｳｪｲﾄ期間中 */
				(*(volatile UI_16*)flash_algo6_addr)	= FLASH_ALGOE_VALUE;
			}

			/* ﾌﾗｯｼｭ動作情報の格納 */
			FlashDrvInfo.state	= E_FLASHDRV_ERASE;
			FlashDrvInfo.addr	= erase_addr;

			/* FSTRﾚｼﾞｽﾀﾀﾞﾐｰﾘｰﾄﾞ */
			dummy = FSTR;

			ret = D_OK;
		}
	}

	return ret;
}

/****************************************************************************************/
/*	[モジュール名]	FlashDrv_CheckStatus	[名称]	ﾌﾗｯｼｭ書き換えﾄﾞﾗｲﾊﾞﾌﾗｯｼｭｽﾃｰﾀｽﾁｪｯｸ	*/
/*======================================================================================*/
/*	[処理概要]	ﾌﾗｯｼｭ書き換えﾄﾞﾗｲﾊﾞの動作によって、ﾌﾗｯｼｭｽﾃｰﾀｽをﾁｪｯｸする。				*/
/*======================================================================================*/
/*	[記述形式]	E_FLASHDRV_STATE FlashDrv_CheckStatus( void )							*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	E_FLASHDRV_STATE	ret	：												*/
/*					ﾌﾗｯｼｭﾄﾞﾗｲﾊﾞのｽﾃｰﾀｽ	：	ｱｲﾄﾞﾙ(E_FLASHDRV_IDLE)						*/
/*										：	書き込み中(E_FLASHDRV_WRITE)				*/
/*										：	書き込み失敗(E_FLASHDRV_WRITE_ERROR)		*/
/*										：	消去中(E_FLASHDRV_ERASE)					*/
/*										：	消去失敗(E_FLASHDRV_ERASE_ERROR)			*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
E_FLASHDRV_STATE FlashDrv_CheckStatus( void )
{
	switch ( FlashDrvInfo.state ) {
	case E_FLASHDRV_WRITE:					/* ﾌﾗｯｼｭ書き込み後のﾃﾞｰﾀﾎﾟｰﾘﾝｸﾞ */
		/* ﾌﾗｯｼｭ書込みが完了したかをﾁｪｯｸする*/
		FlashDrvInfo.state = flash_drv_write_polling();

		/* ﾌﾗｯｼｭ書込みが失敗した場合、ﾘｾｯﾄｺﾏﾝﾄﾞを発行する */
		flash_drv_reset(FlashDrvInfo.state);

		break;
	case E_FLASHDRV_ERASE:					/* ﾌﾗｯｼｭ消去後のﾄｸﾞﾙﾁｪｯｸ */
		/* ﾌﾗｯｼｭ消去が完了したかをﾁｪｯｸする*/
		FlashDrvInfo.state = flash_drv_erase_toggle();

		/* ﾌﾗｯｼｭ消去が失敗した場合、ﾘｾｯﾄｺﾏﾝﾄﾞを発行する */
		flash_drv_reset(FlashDrvInfo.state);

		break;
	default:								/* 上記以外 */
		break;
	}

	return FlashDrvInfo.state;
}

/****************************************************************************************/
/*	[モジュール名]	FlashDrv_Enable		[名称]	ﾌﾗｯｼｭ書き換えﾄﾞﾗｲﾊﾞﾌﾗｯｼｭｱｸｾｽ許可		*/
/*======================================================================================*/
/*	[処理概要]	FCTLRﾚｼﾞｽﾀのFWEﾋﾞｯﾄを設定して、ﾌﾗｯｼｭｱｸｾｽを許可する。					*/
/*======================================================================================*/
/*	[記述形式]	SI_8 FlashDrv_Enable( void )											*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	SI_8				ret			：ｱｸｾｽ許可OK(D_OK)、ｱｸｾｽ許可NG(D_NG)	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
SI_8 FlashDrv_Enable( void )
{
	SI_8	ret = D_NG;

	/* CPUﾓｰﾄﾞとﾌﾗｯｼｭHANGｴﾗｰをﾁｪｯｸする */
	if ( ( FCTLR_FWE == D_OFF ) && ( FSTR_FHANG == D_OFF ) ) {
		/* ﾌﾗｯｼｭｱｸｾｽの許可を設定する */
		FCTLR_FWE	= D_ON;

		if ( FSTR_FRDY == D_ON ) {
			/* ﾌﾗｯｼｭｱｸｾｽ許可設定成功 */
			ret = D_OK;
		}
	}

	return ret;
}

/****************************************************************************************/
/*	[モジュール名]	FlashDrv_Disable	[名称]	ﾌﾗｯｼｭ書き換えﾄﾞﾗｲﾊﾞﾌﾗｯｼｭｱｸｾｽ禁止		*/
/*======================================================================================*/
/*	[処理概要]	FCTLRﾚｼﾞｽﾀのFWEﾋﾞｯﾄを設定して、ﾌﾗｯｼｭｱｸｾｽを禁止する。					*/
/*======================================================================================*/
/*	[記述形式]	SI_8 FlashDrv_Disable( void )											*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	SI_8				ret			：ｱｸｾｽ禁止OK(D_OK)、ｱｸｾｽ禁止NG(D_NG)	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
SI_8 FlashDrv_Disable( void )
{
	SI_8	ret = D_NG;

	/* CPUﾓｰﾄﾞと書き込み/消去許可ﾋﾞｯﾄをﾁｪｯｸする */
	if ( ( FCTLR_FWE == D_ON ) && ( FSTR_FRDY == D_ON ) ) {
		/* ﾌﾗｯｼｭｱｸｾｽの禁止を設定する */
		FCTLR_FWE	= D_OFF;

		/* ﾌﾗｯｼｭｱｸｾｽ禁止設定成功 */
		ret = D_OK;
	}

	return ret;
}

/****************************************************************************************/
/*	[モジュール名]	flash_drv_write_polling	[名称]	ﾌﾗｯｼｭ書き込み後のﾃﾞｰﾀﾎﾟｰﾘﾝｸﾞ		*/
/*======================================================================================*/
/*	[処理概要]	ﾌﾗｯｼｭへﾃﾞｰﾀを書込み後、DPOLLﾋﾞｯﾄをﾁｪｯｸする。							*/
/*======================================================================================*/
/*	[記述形式]	E_FLASHDRV_STATE flash_drv_write_polling( void )						*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	E_FLASHDRV_STATE	ret_value	：										*/
/*					ﾌﾗｯｼｭﾄﾞﾗｲﾊﾞのｽﾃｰﾀｽ	：	ｱｲﾄﾞﾙ(E_FLASHDRV_IDLE)						*/
/*										：	書き込み中(E_FLASHDRV_WRITE)				*/
/*										：	書き込み失敗(E_FLASHDRV_WRITE_ERROR)		*/
/*										：	消去中(E_FLASHDRV_ERASE)					*/
/*										：	消去失敗(E_FLASHDRV_ERASE_ERROR)			*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
static E_FLASHDRV_STATE flash_drv_write_polling( void )
{
	E_FLASHDRV_STATE	ret_value;
	UI_32				dummy_data;
	volatile UI_16		hd_seq_f1;

	/* 戻り値を初期化する */
	ret_value = E_FLASHDRV_WRITE;

	/* ﾊｰﾄﾞｳｪｱｺﾏﾝﾄﾞｼｰｹﾝｽ状態取得 */
	hd_seq_f1	= *(volatile UI_16*)(FlashDrvInfo.addr);

	/* DPOLLﾋﾞｯﾄﾁｪｯｸ */
	if (( hd_seq_f1 & FLASH_DPOLL ) == ( ( FlashDrvInfo.wrdata ) & FLASH_DPOLL ) ) {
		/* ｺﾏﾝﾄﾞｼｰｹﾝｽ正常終了 */
		ret_value = E_FLASHDRV_IDLE;
	} else {
		/* TLOVﾋﾞｯﾄﾁｪｯｸ */
		if ( ( hd_seq_f1 & FLASH_TLOV ) == FLASH_TLOV ) {
			/* 再度ﾊｰﾄﾞｳｪｱｺﾏﾝﾄﾞｼｰｹﾝｽ状態取得 */
			hd_seq_f1	= *(volatile UI_16*)(FlashDrvInfo.addr);

			/* DPOLLﾋﾞｯﾄﾁｪｯｸ */
			if ( ( hd_seq_f1 & FLASH_DPOLL ) == ( ( FlashDrvInfo.wrdata ) & FLASH_DPOLL ) ) {
				/* ｺﾏﾝﾄﾞｼｰｹﾝｽ正常終了 */
				ret_value = E_FLASHDRV_IDLE;
			} else {
				/* ｺﾏﾝﾄﾞｼｰｹﾝｽ実行失敗 */
				ret_value = E_FLASHDRV_WRITE_ERROR;
			}
		}
	}

	/* 書込みが完了したかのﾁｪｯｸを行う */
	if (ret_value == E_FLASHDRV_IDLE) {
		/* 後半のﾊｰﾌﾜｰﾄﾞの場合のみECCｴﾗｰ訂正ﾌﾗｸﾞのﾁｪｯｸを行う */
		if ( (FlashDrvInfo.addr & MASK_LAST_HALFWORD) == MASK_LAST_HALFWORD ) {
			/* 1ﾜｰﾄﾞ書込み後のﾃﾞｰﾀを読み出す */
			dummy_data = *(volatile UI_32*)(FlashDrvInfo.addr - D_FLASHDRV_DATASIZE);

			/* ECCｴﾗｰ訂正ﾌﾗｸﾞがｾｯﾄされているかのﾁｪｯｸを行う */
			if (FSTR_FECCERR == D_ON) {
				ret_value = E_FLASHDRV_WRITE_ERROR;
			}
		}
	}

	return ret_value;
}

/****************************************************************************************/
/*	[モジュール名]	flash_drv_erase_toggle	[名称]	ﾌﾗｯｼｭ消去後のﾃﾞｰﾀﾄｸﾞﾙﾁｪｯｸ			*/
/*======================================================================================*/
/*	[処理概要]	ﾌﾗｯｼｭ消去後、TOGG1ﾋﾞｯﾄをﾁｪｯｸする。										*/
/*======================================================================================*/
/*	[記述形式]	E_FLASHDRV_STATE flash_drv_erase_toggle( void )							*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	E_FLASHDRV_STATE	ret_value	：										*/
/*					ﾌﾗｯｼｭﾄﾞﾗｲﾊﾞのｽﾃｰﾀｽ	：	ｱｲﾄﾞﾙ(E_FLASHDRV_IDLE)						*/
/*										：	書き込み中(E_FLASHDRV_WRITE)				*/
/*										：	書き込み失敗(E_FLASHDRV_WRITE_ERROR)		*/
/*										：	消去中(E_FLASHDRV_ERASE)					*/
/*										：	消去失敗(E_FLASHDRV_ERASE_ERROR)			*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
static E_FLASHDRV_STATE flash_drv_erase_toggle( void )
{
	E_FLASHDRV_STATE	ret_value;
	volatile UI_16		hd_seq_f1;
	volatile UI_16		hd_seq_f2;
	UI_8				count;

	/* 戻り値を初期化する */
	ret_value = E_FLASHDRV_ERASE;

	/* ﾙｰﾌﾟでﾌﾞﾛｯｸ消去結果をﾁｪｯｸする */
	for ( count = 0U; ( ( count < FLASH_TOGCHK_LOOPMAX ) &&
					 ( ret_value == E_FLASHDRV_ERASE ) ); count++ ) {
		/* 二回ﾊｰﾄﾞｳｪｱｺﾏﾝﾄﾞｼｰｹﾝｽ状態取得 */
		hd_seq_f1	= *(volatile UI_16*)(FlashDrvInfo.addr);
		hd_seq_f2	= *(volatile UI_16*)(FlashDrvInfo.addr);

		/* ﾄｸﾞﾙﾌﾗｸﾞﾋﾞｯﾄをﾁｪｯｸ */
		if ( ( hd_seq_f1 & FLASH_TOGG1 ) == (hd_seq_f2 & FLASH_TOGG1 ) ) {
			/* 指定ｱﾄﾞﾚｽﾁｪｯｸ */
			if ( ( FlashDrvInfo.addr & FLASH_SC_UNIT ) == FLASH_SC_UNIT ) {
				/* 後半ｾｸﾀ消去成功 */
				ret_value = E_FLASHDRV_IDLE;
			} else {
				/* 前半ｾｸﾀ消去成功 */
				/* ﾁｪｯｸｱﾄﾞﾚｽ:前半ｾｸﾀ -> 後半ｾｸﾀ */
				FlashDrvInfo.addr += FLASH_SC_UNIT;
			}
		} else if ( ( hd_seq_f2 & FLASH_TLOV ) == FLASH_TLOV ) {
			/* 再度二回ﾊｰﾄﾞｳｪｱｺﾏﾝﾄﾞｼｰｹﾝｽ状態取得 */
			hd_seq_f1	= *(volatile UI_16*)(FlashDrvInfo.addr);
			hd_seq_f2	= *(volatile UI_16*)(FlashDrvInfo.addr);

			/* ﾄｸﾞﾙﾌﾗｸﾞﾋﾞｯﾄと指定ｱﾄﾞﾚｽﾁｪｯｸをﾁｪｯｸ */
			if ( ( ( hd_seq_f1 & FLASH_TOGG1 ) == ( hd_seq_f2 & FLASH_TOGG1 ) ) &&
				 ( ( FlashDrvInfo.addr & FLASH_SC_UNIT ) == FLASH_SC_UNIT ) ) {
				/* 後半ｾｸﾀ消去成功 */
				ret_value = E_FLASHDRV_IDLE;
			} else if ( ( ( hd_seq_f1 & FLASH_TOGG1 ) == ( hd_seq_f2 & FLASH_TOGG1 ) ) &&
					  ( ( FlashDrvInfo.addr & FLASH_SC_UNIT ) != FLASH_SC_UNIT ) ) {
				/* 前半ｾｸﾀ消去成功 */
				/* ﾁｪｯｸｱﾄﾞﾚｽ:前半ｾｸﾀ -> 後半ｾｸﾀ */
				FlashDrvInfo.addr += FLASH_SC_UNIT;
			} else {
				/* ｺﾏﾝﾄﾞｼｰｹﾝｽ実行失敗 */
				ret_value = E_FLASHDRV_ERASE_ERROR;
			}
		} else {
			/* ｺﾏﾝﾄﾞｼｰｹﾝｽ実行中 */
			break;
		}
	}

	return ret_value;
}

/****************************************************************************************/
/*	[モジュール名]	flash_drv_reset			[名称]	ﾌﾗｯｼｭﾍのｱｸｾｽ異常時、ﾘｾｯﾄｺﾏﾝﾄﾞ発行	*/
/*======================================================================================*/
/*	[処理概要]	ﾌﾗｯｼｭﾍのｱｸｾｽ異常時、ﾘｾｯﾄｺﾏﾝﾄﾞを発行する。								*/
/*======================================================================================*/
/*	[記述形式]	void flash_drv_reset( E_FLASHDRV_STATE state )							*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
static void flash_drv_reset( E_FLASHDRV_STATE state )
{
	T_FlashDrv_Addr		flash_algor_addr;
	UI_8				dummy;

	if ( ( state == E_FLASHDRV_WRITE_ERROR ) ||
		 ( state == E_FLASHDRV_ERASE_ERROR ) ) {
		/* ﾘｾｯﾄｺﾏﾝﾄﾞのｱﾄﾞﾚｽを設定する */
		flash_algor_addr = FLASH_START_ADDR;

		/* ﾘｾｯﾄｺﾏﾝﾄﾞを発行する */
		(*(volatile UI_16*)flash_algor_addr) = FLASH_ALGOR_VALUE;

		/* FSTRﾚｼﾞｽﾀﾀﾞﾐｰﾘｰﾄﾞ */
		dummy = FSTR;
	}

}
#endif	/* FLASH_DRV_REPRGM_ENABLE */
