/********************************************************************************/
/* 客先名		:	標準モジュール												*/
/* 機種名		:	SSFT														*/
/* ﾏｲｺﾝｿﾌﾄﾃｰﾏ名	:	PF															*/
/*==============================================================================*/
/* 作成ﾌｧｲﾙ名	:	SSFTSTD_FR81_PWM_Drv.c										*/
/* 				:	PWMモジュール												*/
/*==============================================================================*/
/* 対象ﾏｲｺﾝ		:	MB91570 Series												*/
/*==============================================================================*/
/* 作成ﾊﾞｰｼﾞｮﾝ	:	010104														*/
/* 作成年月日	:	2013.05.23													*/
/* 作成者		:	K.Uchiyama													*/
/*------------------------------------------------------------------------------*/
/* 変更履歴		:																*/
/* [010101]		:	新規作成													*/
/* [010102]		:																*/
/*	12.11.27	:	極性、トリガーなどのPWM設定の変更なし時に					*/
/*				:		PWMが再スタートとならないように対応						*/
/* [010103]		:																*/
/* 	13.2.8		:	FR81S対応													*/
/* [010104]		:	標準IF対応。起動種別の名称変更								*/
/********************************************************************************/

/*** START_INC ***/
/********************************************************************************/
/*   Include File                                                               */
/*------------------------------------------------------------------------------*/
/*      ﾍｯﾀﾞｰﾌｧｲﾙのｲﾝｸﾙｰﾄﾞ文は、下記ﾌｧｲﾙに記載すること                          */
/********************************************************************************/
#include "SSFTSTD_Type.h"
#include "SSFTSTD_Macro.h"
#include "mb91570.h"

#define	 __MB91570_PWM_DRV_INTERNAL__
#include "SSFTSTD_FR81_PWM_Drv.h"

/*==============================================================================*/
/*	typedef定義（外部非公開）													*/
/*==============================================================================*/



/*==============================================================================*/
/*	関数ﾌﾟﾛﾄﾀｲﾌﾟ宣言（外部非公開)												*/
/*==============================================================================*/


/*==============================================================================*/
/*	内部定数																	*/
/*==============================================================================*/
/* PPG制御ステータスレジスタ・OSEL ビット位置マスク */
#define PCN_OSEL_BIT_MASK		(0x0001U)
/* PPG制御ステータスレジスタ・IRS ビット位置マスク */
#define PCN_IRS_BIT_MASK		(0x000CU)
/* PPG制御ステータスレジスタ・PGMS ビット位置マスク */
#define PCN_PGMS_BIT_MASK		(0x0200U)
/* PPG制御ステータスレジスタ・STRG ビット位置マスク */
#define PCN_STRG_BIT_MASK		(0x4000U)
/* PPG制御ステータスレジスタ・CNTE ビット位置マスク */
#define PCN_CNTE_BIT_MASK		(0x8000U)
/* PPG制御ステータスレジスタ・CKS ビット位置マスク */
#define PCN_CKS_BIT_MASK		(0x0C00U)
/* PPG制御ステータスレジスタ・IRQF ビットクリア用マスク */
#define PCN_IRQF_CLR_MASK		(0xFFEFU)
/* PPG制御ステータスレジスタ・IREN,IRQF ビットクリア用マスク */
#define PCN_IREN_IRQF_CLR_MASK	(0xFFCFU)
/* PPG制御ステータスレジスタ・IRENビットセット */
#define PCN_IREN_SET			(0x0020U)
/* PPG制御ステータスレジスタ PWM（出力マスク無し）時の起動設定 */
#define PCN_RUN_WITH_PWM		( PCN_CNTE_BIT_MASK | PCN_STRG_BIT_MASK )
/* PPG制御ステータスレジスタ 固定出力（出力マスク）時の起動設定 */
#define PCN_RUN_WITH_MASK		( PCN_CNTE_BIT_MASK | PCN_STRG_BIT_MASK  | PCN_PGMS_BIT_MASK )
/* PPG制御ステータスレジスタ 有効ビットマスク */
#define PCN_USED_BIT_MASK		( PCN_CNTE_BIT_MASK | PCN_STRG_BIT_MASK  | PCN_PGMS_BIT_MASK  | PCN_CKS_BIT_MASK | PCN_OSEL_BIT_MASK | PCN_IRS_BIT_MASK)
/* PPG制御ステータスレジスタ設定値 */
#define PCN_SET_VALUE			(0xFFFFU)
/* 周期設定値判定定数 */
#define CYCLE_JUDGMENT			(0x0001)
/* Duty設定値判定定数 */
#define DUTY_JUDGMENT			(0x0000)
/* 減算定数 */
#define PWM_SUBTRACTION			(0x0001)
/* PPGデューティ設定レジスタクリア定数 */
#define DUTY_CLEA				(0x0000)


/* PPG制御ステータスレジスタ起動設定テーブル */
static UI_16 const C_PcnSettingTbl[PPG_CH_NUMBER] = 
{
	INIT_PCN_CH0,	/* PPG制御ステータスレジスタ0 初期設定値 */
	INIT_PCN_CH1,	/* PPG制御ステータスレジスタ1 初期設定値 */
	INIT_PCN_CH2,	/* PPG制御ステータスレジスタ2 初期設定値 */
	INIT_PCN_CH3,	/* PPG制御ステータスレジスタ3 初期設定値 */
	INIT_PCN_CH4,	/* PPG制御ステータスレジスタ4 初期設定値 */
	INIT_PCN_CH5,	/* PPG制御ステータスレジスタ5 初期設定値 */
	INIT_PCN_CH6,	/* PPG制御ステータスレジスタ6 初期設定値 */
	INIT_PCN_CH7,	/* PPG制御ステータスレジスタ7 初期設定値 */
	INIT_PCN_CH8,	/* PPG制御ステータスレジスタ8 初期設定値 */
	INIT_PCN_CH9,	/* PPG制御ステータスレジスタ9 初期設定値 */
	INIT_PCN_CH10,	/* PPG制御ステータスレジスタ10 初期設定値 */
	INIT_PCN_CH11,	/* PPG制御ステータスレジスタ11 初期設定値 */
	INIT_PCN_CH12,	/* PPG制御ステータスレジスタ12 初期設定値 */
	INIT_PCN_CH13,	/* PPG制御ステータスレジスタ13 初期設定値 */
	INIT_PCN_CH14,	/* PPG制御ステータスレジスタ14 初期設定値 */
	INIT_PCN_CH15,	/* PPG制御ステータスレジスタ15 初期設定値 */
	INIT_PCN_CH16,	/* PPG制御ステータスレジスタ16 初期設定値 */
	INIT_PCN_CH17,	/* PPG制御ステータスレジスタ17 初期設定値 */
	INIT_PCN_CH18,	/* PPG制御ステータスレジスタ18 初期設定値 */
	INIT_PCN_CH19,	/* PPG制御ステータスレジスタ19 初期設定値 */
	INIT_PCN_CH20,	/* PPG制御ステータスレジスタ20 初期設定値 */
	INIT_PCN_CH21,	/* PPG制御ステータスレジスタ21 初期設定値 */
	INIT_PCN_CH22,	/* PPG制御ステータスレジスタ22 初期設定値 */
	INIT_PCN_CH23	/* PPG制御ステータスレジスタ23 初期設定値 */
};

/* PPG制御ステータスレジスタ停止設定テーブル */
static UI_16 const C_PcnCtrlStopRegTbl[PPG_CH_NUMBER] = 
{
	STOP_PCN_CH0,	/* PPG制御ステータスレジスタ0 停止設定値 */
	STOP_PCN_CH1,	/* PPG制御ステータスレジスタ1 停止設定値 */
	STOP_PCN_CH2,	/* PPG制御ステータスレジスタ2 停止設定値 */
	STOP_PCN_CH3,	/* PPG制御ステータスレジスタ3 停止設定値 */
	STOP_PCN_CH4,	/* PPG制御ステータスレジスタ4 停止設定値 */
	STOP_PCN_CH5,	/* PPG制御ステータスレジスタ5 停止設定値 */
	STOP_PCN_CH6,	/* PPG制御ステータスレジスタ6 停止設定値 */
	STOP_PCN_CH7,	/* PPG制御ステータスレジスタ7 停止設定値 */
	STOP_PCN_CH8,	/* PPG制御ステータスレジスタ8 停止設定値 */
	STOP_PCN_CH9,	/* PPG制御ステータスレジスタ9 停止設定値 */
	STOP_PCN_CH10,	/* PPG制御ステータスレジスタ10 停止設定値 */
	STOP_PCN_CH11,	/* PPG制御ステータスレジスタ11 停止設定値 */
	STOP_PCN_CH12,	/* PPG制御ステータスレジスタ12 停止設定値 */
	STOP_PCN_CH13,	/* PPG制御ステータスレジスタ13 停止設定値 */
	STOP_PCN_CH14,	/* PPG制御ステータスレジスタ14 停止設定値 */
	STOP_PCN_CH15,	/* PPG制御ステータスレジスタ15 停止設定値 */
	STOP_PCN_CH16,	/* PPG制御ステータスレジスタ16 停止設定値 */
	STOP_PCN_CH17,	/* PPG制御ステータスレジスタ17 停止設定値 */
	STOP_PCN_CH18,	/* PPG制御ステータスレジスタ18 停止設定値 */
	STOP_PCN_CH19,	/* PPG制御ステータスレジスタ19 停止設定値 */
	STOP_PCN_CH20,	/* PPG制御ステータスレジスタ20 停止設定値 */
	STOP_PCN_CH21,	/* PPG制御ステータスレジスタ21 停止設定値 */
	STOP_PCN_CH22,	/* PPG制御ステータスレジスタ22 停止設定値 */
	STOP_PCN_CH23	/* PPG制御ステータスレジスタ23 停止設定値 */
};

/* PPG制御ステータスレジスタ出力開始設定テーブル */
static UI_16 const C_PcnSettingActTbl[PPG_CH_NUMBER] = 
{
	PWM_DRV_ACT_PCN_CH0,			/* PPG制御ステータスレジスタ0 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH1,			/* PPG制御ステータスレジスタ1 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH2,			/* PPG制御ステータスレジスタ2 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH3,			/* PPG制御ステータスレジスタ3 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH4,			/* PPG制御ステータスレジスタ4 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH5,			/* PPG制御ステータスレジスタ5 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH6,			/* PPG制御ステータスレジスタ6 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH7,			/* PPG制御ステータスレジスタ7 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH8,			/* PPG制御ステータスレジスタ8 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH9,			/* PPG制御ステータスレジスタ9 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH10,			/* PPG制御ステータスレジスタ10 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH11,			/* PPG制御ステータスレジスタ11 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH12,			/* PPG制御ステータスレジスタ12 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH13,			/* PPG制御ステータスレジスタ13 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH14,			/* PPG制御ステータスレジスタ14 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH15,			/* PPG制御ステータスレジスタ15 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH16,			/* PPG制御ステータスレジスタ16 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH17,			/* PPG制御ステータスレジスタ17 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH18,			/* PPG制御ステータスレジスタ18 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH19,			/* PPG制御ステータスレジスタ19 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH20,			/* PPG制御ステータスレジスタ20 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH21,			/* PPG制御ステータスレジスタ21 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH22,			/* PPG制御ステータスレジスタ22 ドライバ起動設定値 */
	PWM_DRV_ACT_PCN_CH23			/* PPG制御ステータスレジスタ23 ドライバ起動設定値 */
};

/* PPG制御ステータスレジスタ出力停止設定テーブル */
static UI_16 const C_PcnSettingStopTbl[PPG_CH_NUMBER] = 
{
	PWM_DRV_STOP_PCN_CH0,			/* PPG制御ステータスレジスタ0 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH1,			/* PPG制御ステータスレジスタ1 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH2,			/* PPG制御ステータスレジスタ2 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH3,			/* PPG制御ステータスレジスタ3 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH4,			/* PPG制御ステータスレジスタ4 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH5,			/* PPG制御ステータスレジスタ5 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH6,			/* PPG制御ステータスレジスタ6 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH7,			/* PPG制御ステータスレジスタ7 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH8,			/* PPG制御ステータスレジスタ8 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH9,			/* PPG制御ステータスレジスタ9 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH10,			/* PPG制御ステータスレジスタ10 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH11,			/* PPG制御ステータスレジスタ11 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH12,			/* PPG制御ステータスレジスタ12 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH13,			/* PPG制御ステータスレジスタ13 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH14,			/* PPG制御ステータスレジスタ14 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH15,			/* PPG制御ステータスレジスタ15 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH16,			/* PPG制御ステータスレジスタ16 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH17,			/* PPG制御ステータスレジスタ17 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH18,			/* PPG制御ステータスレジスタ18 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH19,			/* PPG制御ステータスレジスタ19 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH20,			/* PPG制御ステータスレジスタ20 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH21,			/* PPG制御ステータスレジスタ21 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH22,			/* PPG制御ステータスレジスタ22 ドライバ停止設定値 */
	PWM_DRV_STOP_PCN_CH23			/* PPG制御ステータスレジスタ23 ドライバ停止設定値 */
};

/* PPG周期設定レジスタ起動設定テーブル */
static UI_16 const	C_PcsrSettingTbl[PPG_CH_NUMBER] = 
{
	INIT_PCSR_CH0,	/* PPG周期設定レジスタ0 初期設定値 */
	INIT_PCSR_CH1,	/* PPG周期設定レジスタ1 初期設定値 */
	INIT_PCSR_CH2,	/* PPG周期設定レジスタ2 初期設定値 */
	INIT_PCSR_CH3,	/* PPG周期設定レジスタ3 初期設定値 */
	INIT_PCSR_CH4,	/* PPG周期設定レジスタ4 初期設定値 */
	INIT_PCSR_CH5,	/* PPG周期設定レジスタ5 初期設定値 */
	INIT_PCSR_CH6,	/* PPG周期設定レジスタ6 初期設定値 */
	INIT_PCSR_CH7,	/* PPG周期設定レジスタ7 初期設定値 */
	INIT_PCSR_CH8,	/* PPG周期設定レジスタ8 初期設定値 */
	INIT_PCSR_CH9,	/* PPG周期設定レジスタ9 初期設定値 */
	INIT_PCSR_CH10,	/* PPG周期設定レジスタ10 初期設定値 */
	INIT_PCSR_CH11, /* PPG周期設定レジスタ11 初期設定値 */
	INIT_PCSR_CH12,	/* PPG周期設定レジスタ12 初期設定値 */
	INIT_PCSR_CH13,	/* PPG周期設定レジスタ13 初期設定値 */
	INIT_PCSR_CH14,	/* PPG周期設定レジスタ14 初期設定値 */
	INIT_PCSR_CH15,	/* PPG周期設定レジスタ15 初期設定値 */
	INIT_PCSR_CH16,	/* PPG周期設定レジスタ16 初期設定値 */
	INIT_PCSR_CH17,	/* PPG周期設定レジスタ17 初期設定値 */
	INIT_PCSR_CH18,	/* PPG周期設定レジスタ18 初期設定値 */
	INIT_PCSR_CH19,	/* PPG周期設定レジスタ19 初期設定値 */
	INIT_PCSR_CH20,	/* PPG周期設定レジスタ20 初期設定値 */
	INIT_PCSR_CH21,	/* PPG周期設定レジスタ21 初期設定値 */
	INIT_PCSR_CH22,	/* PPG周期設定レジスタ22 初期設定値 */
	INIT_PCSR_CH23	/* PPG周期設定レジスタ23 初期設定値 */
};

/* PPG周期設定レジスタ停止設定テーブル */
static UI_16 const	C_PcsrRegStopTbl[PPG_CH_NUMBER] = 
{
	STOP_PCSR_CH0,	/* PPG周期設定レジスタ0 停止設定値 */
	STOP_PCSR_CH1,	/* PPG周期設定レジスタ1 停止設定値 */
	STOP_PCSR_CH2,	/* PPG周期設定レジスタ2 停止設定値 */
	STOP_PCSR_CH3,	/* PPG周期設定レジスタ3 停止設定値 */
	STOP_PCSR_CH4,	/* PPG周期設定レジスタ4 停止設定値 */
	STOP_PCSR_CH5,	/* PPG周期設定レジスタ5 停止設定値 */
	STOP_PCSR_CH6,	/* PPG周期設定レジスタ6 停止設定値 */
	STOP_PCSR_CH7,	/* PPG周期設定レジスタ7 停止設定値 */
	STOP_PCSR_CH8,	/* PPG周期設定レジスタ8 停止設定値 */
	STOP_PCSR_CH9,	/* PPG周期設定レジスタ9 停止設定値 */
	STOP_PCSR_CH10,	/* PPG周期設定レジスタ10 停止設定値 */
	STOP_PCSR_CH11, /* PPG周期設定レジスタ11 停止設定値 */
	STOP_PCSR_CH12,	/* PPG周期設定レジスタ12 停止設定値 */
	STOP_PCSR_CH13,	/* PPG周期設定レジスタ13 停止設定値 */
	STOP_PCSR_CH14,	/* PPG周期設定レジスタ14 停止設定値 */
	STOP_PCSR_CH15,	/* PPG周期設定レジスタ15 停止設定値 */
	STOP_PCSR_CH16,	/* PPG周期設定レジスタ16 停止設定値 */
	STOP_PCSR_CH17,	/* PPG周期設定レジスタ17 停止設定値 */
	STOP_PCSR_CH18,	/* PPG周期設定レジスタ18 停止設定値 */
	STOP_PCSR_CH19,	/* PPG周期設定レジスタ19 停止設定値 */
	STOP_PCSR_CH20,	/* PPG周期設定レジスタ20 停止設定値 */
	STOP_PCSR_CH21,	/* PPG周期設定レジスタ21 停止設定値 */
	STOP_PCSR_CH22,	/* PPG周期設定レジスタ22 停止設定値 */
	STOP_PCSR_CH23	/* PPG周期設定レジスタ23 停止設定値 */
};

/* PPGデューティ設定レジスタ起動設定テーブル */
static UI_16 const	C_PdutSettingTbl[PPG_CH_NUMBER] = 
{
	INIT_PDUT_CH0,	/* PPGデューティ設定レジスタ0 初期設定値 */
	INIT_PDUT_CH1,	/* PPGデューティ設定レジスタ1 初期設定値 */
	INIT_PDUT_CH2,	/* PPGデューティ設定レジスタ2 初期設定値 */
	INIT_PDUT_CH3,	/* PPGデューティ設定レジスタ3 初期設定値 */
	INIT_PDUT_CH4,	/* PPGデューティ設定レジスタ4 初期設定値 */
	INIT_PDUT_CH5,	/* PPGデューティ設定レジスタ5 初期設定値 */
	INIT_PDUT_CH6,	/* PPGデューティ設定レジスタ6 初期設定値 */
	INIT_PDUT_CH7,	/* PPGデューティ設定レジスタ7 初期設定値 */
	INIT_PDUT_CH8,	/* PPGデューティ設定レジスタ8 初期設定値 */
	INIT_PDUT_CH9,	/* PPGデューティ設定レジスタ9 初期設定値 */
	INIT_PDUT_CH10,	/* PPGデューティ設定レジスタ10 初期設定値 */
	INIT_PDUT_CH11,	/* PPGデューティ設定レジスタ11 初期設定値 */
	INIT_PDUT_CH12,	/* PPGデューティ設定レジスタ12 初期設定値 */
	INIT_PDUT_CH13,	/* PPGデューティ設定レジスタ13 初期設定値 */
	INIT_PDUT_CH14,	/* PPGデューティ設定レジスタ14 初期設定値 */
	INIT_PDUT_CH15,	/* PPGデューティ設定レジスタ15 初期設定値 */
	INIT_PDUT_CH16,	/* PPGデューティ設定レジスタ16 初期設定値 */
	INIT_PDUT_CH17,	/* PPGデューティ設定レジスタ17 初期設定値 */
	INIT_PDUT_CH18,	/* PPGデューティ設定レジスタ18 初期設定値 */
	INIT_PDUT_CH19,	/* PPGデューティ設定レジスタ19 初期設定値 */
	INIT_PDUT_CH20,	/* PPGデューティ設定レジスタ20 初期設定値 */
	INIT_PDUT_CH21,	/* PPGデューティ設定レジスタ21 初期設定値 */
	INIT_PDUT_CH22,	/* PPGデューティ設定レジスタ22 初期設定値 */
	INIT_PDUT_CH23	/* PPGデューティ設定レジスタ23 初期設定値 */
};

/* PPGデューティ設定レジスタ停止設定テーブル */
static UI_16 const	C_PdutRegStopTbl[PPG_CH_NUMBER] = 
{
	STOP_PDUT_CH0,	/* PPGデューティ設定レジスタ0 停止設定値 */
	STOP_PDUT_CH1,	/* PPGデューティ設定レジスタ1 停止設定値 */
	STOP_PDUT_CH2,	/* PPGデューティ設定レジスタ2 停止設定値 */
	STOP_PDUT_CH3,	/* PPGデューティ設定レジスタ3 停止設定値 */
	STOP_PDUT_CH4,	/* PPGデューティ設定レジスタ4 停止設定値 */
	STOP_PDUT_CH5,	/* PPGデューティ設定レジスタ5 停止設定値 */
	STOP_PDUT_CH6,	/* PPGデューティ設定レジスタ6 停止設定値 */
	STOP_PDUT_CH7,	/* PPGデューティ設定レジスタ7 停止設定値 */
	STOP_PDUT_CH8,	/* PPGデューティ設定レジスタ8 停止設定値 */
	STOP_PDUT_CH9,	/* PPGデューティ設定レジスタ9 停止設定値 */
	STOP_PDUT_CH10,	/* PPGデューティ設定レジスタ10 停止設定値 */
	STOP_PDUT_CH11,	/* PPGデューティ設定レジスタ11 停止設定値 */
	STOP_PDUT_CH12,	/* PPGデューティ設定レジスタ12 停止設定値 */
	STOP_PDUT_CH13,	/* PPGデューティ設定レジスタ13 停止設定値 */
	STOP_PDUT_CH14,	/* PPGデューティ設定レジスタ14 停止設定値 */
	STOP_PDUT_CH15,	/* PPGデューティ設定レジスタ15 停止設定値 */
	STOP_PDUT_CH16,	/* PPGデューティ設定レジスタ16 停止設定値 */
	STOP_PDUT_CH17,	/* PPGデューティ設定レジスタ17 停止設定値 */
	STOP_PDUT_CH18,	/* PPGデューティ設定レジスタ18 停止設定値 */
	STOP_PDUT_CH19,	/* PPGデューティ設定レジスタ19 停止設定値 */
	STOP_PDUT_CH20,	/* PPGデューティ設定レジスタ20 停止設定値 */
	STOP_PDUT_CH21,	/* PPGデューティ設定レジスタ21 停止設定値 */
	STOP_PDUT_CH22,	/* PPGデューティ設定レジスタ22 停止設定値 */
	STOP_PDUT_CH23	/* PPGデューティ設定レジスタ23 停止設定値 */
};

/* PPG制御ステータスレジスタアドレステーブル */
static __io volatile UI_16 *const C_PcnReg[PPG_CH_NUMBER] = 
{
	&(PCN0),	/* PPG制御ステータスレジスタ0 */
	&(PCN1),	/* PPG制御ステータスレジスタ1 */
	&(PCN2),	/* PPG制御ステータスレジスタ2 */
	&(PCN3),	/* PPG制御ステータスレジスタ3 */
	&(PCN4),	/* PPG制御ステータスレジスタ4 */
	&(PCN5),	/* PPG制御ステータスレジスタ5 */
	&(PCN6),	/* PPG制御ステータスレジスタ6 */
	&(PCN7),	/* PPG制御ステータスレジスタ7 */
	&(PCN8),	/* PPG制御ステータスレジスタ8 */
	&(PCN9),	/* PPG制御ステータスレジスタ9 */
	&(PCN10),	/* PPG制御ステータスレジスタ10 */
	&(PCN11),	/* PPG制御ステータスレジスタ11 */
	&(PCN12),	/* PPG制御ステータスレジスタ12 */
	&(PCN13),	/* PPG制御ステータスレジスタ13 */
	&(PCN14),	/* PPG制御ステータスレジスタ14 */
	&(PCN15),	/* PPG制御ステータスレジスタ15 */
	&(PCN16),	/* PPG制御ステータスレジスタ16 */
	&(PCN17),	/* PPG制御ステータスレジスタ17 */
	&(PCN18),	/* PPG制御ステータスレジスタ18 */
	&(PCN19),	/* PPG制御ステータスレジスタ19 */
	&(PCN20),	/* PPG制御ステータスレジスタ20 */
	&(PCN21),	/* PPG制御ステータスレジスタ21 */
	&(PCN22),	/* PPG制御ステータスレジスタ22 */
	&(PCN23)	/* PPG制御ステータスレジスタ23 */
};

/* PPG周期設定レジスタアドレステーブル */
static __io volatile UI_16 *const C_PcsrReg[PPG_CH_NUMBER] = 
{
	&(PCSR0_),	/* PPG周期設定レジスタ0 */
	&(PCSR1_),	/* PPG周期設定レジスタ1 */
	&(PCSR2),	/* PPG周期設定レジスタ2 */
	&(PCSR3),	/* PPG周期設定レジスタ3 */
	&(PCSR4),	/* PPG周期設定レジスタ4 */
	&(PCSR5),	/* PPG周期設定レジスタ5 */
	&(PCSR6),	/* PPG周期設定レジスタ6 */
	&(PCSR7),	/* PPG周期設定レジスタ7 */
	&(PCSR8),	/* PPG周期設定レジスタ8 */
	&(PCSR9),	/* PPG周期設定レジスタ9 */
	&(PCSR10),	/* PPG周期設定レジスタ10 */
	&(PCSR11),	/* PPG周期設定レジスタ11 */
	&(PCSR12),	/* PPG周期設定レジスタ12 */
	&(PCSR13),	/* PPG周期設定レジスタ13 */
	&(PCSR14),	/* PPG周期設定レジスタ14 */
	&(PCSR15),	/* PPG周期設定レジスタ15 */
	&(PCSR16),	/* PPG周期設定レジスタ16 */
	&(PCSR17),	/* PPG周期設定レジスタ17 */
	&(PCSR18),	/* PPG周期設定レジスタ18 */
	&(PCSR19),	/* PPG周期設定レジスタ19 */
	&(PCSR20),	/* PPG周期設定レジスタ20 */
	&(PCSR21),	/* PPG周期設定レジスタ21 */
	&(PCSR22),	/* PPG周期設定レジスタ22 */
	&(PCSR23)	/* PPG周期設定レジスタ23 */
};

/* PPGデューティ設定レジスタアドレステーブル */
static __io volatile UI_16 *const C_PdutReg[PPG_CH_NUMBER] = 
{
	&(PDUT0_),	/* PPGデューティ設定レジスタ0 */
	&(PDUT1_),	/* PPGデューティ設定レジスタ1 */
	&(PDUT2),	/* PPGデューティ設定レジスタ2 */
	&(PDUT3),	/* PPGデューティ設定レジスタ3 */
	&(PDUT4),	/* PPGデューティ設定レジスタ4 */
	&(PDUT5),	/* PPGデューティ設定レジスタ5 */
	&(PDUT6),	/* PPGデューティ設定レジスタ6 */
	&(PDUT7),	/* PPGデューティ設定レジスタ7 */
	&(PDUT8),	/* PPGデューティ設定レジスタ8 */
	&(PDUT9),	/* PPGデューティ設定レジスタ9 */
	&(PDUT10),	/* PPGデューティ設定レジスタ10 */
	&(PDUT11),	/* PPGデューティ設定レジスタ11 */
	&(PDUT12),	/* PPGデューティ設定レジスタ12 */
	&(PDUT13),	/* PPGデューティ設定レジスタ13 */
	&(PDUT14),	/* PPGデューティ設定レジスタ14 */
	&(PDUT15),	/* PPGデューティ設定レジスタ15 */
	&(PDUT16),	/* PPGデューティ設定レジスタ16 */
	&(PDUT17),	/* PPGデューティ設定レジスタ17 */
	&(PDUT18),	/* PPGデューティ設定レジスタ18 */
	&(PDUT19),	/* PPGデューティ設定レジスタ19 */
	&(PDUT20),	/* PPGデューティ設定レジスタ20 */
	&(PDUT21),	/* PPGデューティ設定レジスタ21 */
	&(PDUT22),	/* PPGデューティ設定レジスタ22 */
	&(PDUT23)	/* PPGデューティ設定レジスタ23 */
};


/****************************************************************************************/
/*	[モジュール名]	PWMDrv_SetDutyCycle		[名称]	周期/DUTY設定処理					*/
/*======================================================================================*/
/*	[処理概要]	引数で指定されたチャネルに対し、指定された周期、DUTYのPPG出力を行う。	*/
/*======================================================================================*/
/*	[記述形式]	SI_8 PWMDrv_SetDutyCycle(E_PWM_DRV_PPG_CH ch,UI_16 cycle,UI_16 duty)	*/
/*																						*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	E_PWM_DRV_PPG_CH		ch		：PPGチャネル							*/
/*				UI_16					cycle	：周期設定値							*/
/*				UI_16					duty	：Duty設定値							*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	SI_8		rc_out	: 正常(D_OK)、異常(D_NG)を返す						*/
/*======================================================================================*/
/*	[ 備  考 ]																			*/
/*	・周期が1以下、または周期よりもDutyの値が大きい場合は異常な設定と判断して、			*/
/*    停止・消灯させる																	*/
/*  ・100％出力可能																		*/
/*	・0％(Duty=0)を指定した場合、出力マスクに1を入れて0％出力設定を行い、				*/
/*    停止・消灯させる																	*/
/*	・チャネル間違い(存在しないチャネルを選択)は処理を行わず終了する					*/
/****************************************************************************************/
SI_8 PWMDrv_SetDutyCycle( E_PWM_DRV_PPG_CH ch, UI_16 cycle, UI_16 duty )
{
	SI_8  rc_out;           /* 戻り値 */
	UI_16 pcn_val;          /* PPG制御ステータスレジスタに設定する値 */
	UI_16 pcn_crr;         	/* PPG制御ステータスレジスタの現在の設定値(レジスタから値を設定) */

	pcn_val = PCN_SET_VALUE;			
	
	/* チャネル正常 */	
	if ( ch < (UI_8)PPG_CH_NUMBER ) {
		
		/* 周期、Dutyが正常範囲内である */
		if ( ( cycle > CYCLE_JUDGMENT ) && ( cycle >= duty ) ) {
			pcn_val=C_PcnSettingTbl[ch];
			
			/* Duty=0%の場合 */
			if ( duty == DUTY_JUDGMENT ) {
				/* PPG制御ステータスレジスタ 固定出力（出力マスク）時の起動設定  */
				pcn_val |= PCN_RUN_WITH_MASK;
			} else {
				/* PPG制御ステータスレジスタ PWM（出力マスク無し）時の起動設定 */
				pcn_val |= PCN_RUN_WITH_PWM;
			}
			
		}
		
		/* 現在のレジスタ設定値を格納設定値 */
		pcn_crr = *C_PcnReg[ch];
		/* 有効ビットマスク設定(タイマ動作許可、ソフトウェアトリガ、カウンタクロック選択、PPG 出力マスク選択、割込み要因選択、PPG 出力極性) */
		pcn_crr &= PCN_USED_BIT_MASK;
		/* PPG制御ステータスレジスタ 固定出力（出力マスク）時の起動設定 */
		pcn_crr |= PCN_RUN_WITH_PWM;
			
		if ( ( pcn_val != pcn_crr ) || ( pcn_val == PCN_SET_VALUE ) ) {
			/* PPG制御ステータスレジスタ停止設定 */
			*C_PcnReg[ch] = C_PcnCtrlStopRegTbl[ch];
			/* PPG周期設定レジスタ停止設定 */
			*C_PcsrReg[ch] = C_PcsrRegStopTbl[ch];
			/* PPGデューティ設定レジスタ */
			*C_PdutReg[ch] = C_PdutRegStopTbl[ch];
		}
		
		/* Output enabled? */
		if ( pcn_val != PCN_SET_VALUE ) {
			*C_PcsrReg[ch] = ( cycle - PWM_SUBTRACTION );
			
			if ( duty > DUTY_JUDGMENT ) {
				*C_PdutReg[ch] = ( duty - PWM_SUBTRACTION );
			} else {
				*C_PdutReg[ch] = DUTY_CLEA;
			}
			
			*C_PcnReg[ch] = pcn_val;
			rc_out = D_OK;
			
		} else {
			rc_out = D_NG;
		}
		
		
	} else {
		rc_out = D_NG;
	}
	return rc_out;
}

/****************************************************************************************/
/*	[モジュール名]	PWMDrv_SetDutyCycleSync	[名称]	周期/DUTY設定処理(同期)				*/
/*======================================================================================*/
/*	[処理概要]	引数で指定された2つのチャネルに対し、指定された周期、					*/
/*              DUTYのPPG出力を同期させて行う。											*/
/*======================================================================================*/
/*	[記述形式]	UI_8 PWMDrv_SetDutyCycleSync(UI_8 ch1,UI_16 cycle,						*/
/*	                                         UI_16 duty1,UI_8 ch2,UI_16 duty2)			*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	E_PWM_DRV_PPG_CH	ch1		：PPGチャネル								*/
/*				UI_16				cycle	：周期設定値								*/
/*				UI_16				duty1	：Duty設定値								*/
/*				E_PWM_DRV_PPG_CH	ch2	    ：PPGチャネル								*/
/*				UI_16				duty2	：Duty設定									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	SI_8		rc_out	: 正常(D_OK)、異常(D_NG)を返す						*/
/*======================================================================================*/
/*	[ 備  考 ]																			*/
/*																						*/
/****************************************************************************************/
SI_8 PWMDrv_SetDutyCycleSync( E_PWM_DRV_PPG_CH ch1, UI_16 cycle, UI_16 duty1, E_PWM_DRV_PPG_CH ch2, UI_16 duty2)
{
	SI_8  rc_out;
	UI_16 mask_level;
	UI_16 pcn_val1;
	UI_16 pcn_val2;
	
	/* チャネル指定が正常 */
	if ( (ch1 < PPG_CH_NUMBER) && (ch2 < PPG_CH_NUMBER) && (ch1 != ch2) ) {
		rc_out = D_OK;
		if ((cycle > 1) && (cycle >= duty1) && (cycle >= duty2) && (duty1 > 0) && (duty2 > 0)) {
			/* PPG制御ステータスレジスタ:カウント開始/トリガONを設定 */
			pcn_val1 = C_PcnSettingActTbl[ch1] | PCN_RUN_WITH_PWM;
			pcn_val2 = C_PcnSettingActTbl[ch2] | PCN_RUN_WITH_PWM;
			
			/* 位相差を最小にするために、割込み禁止設定を行う */
			(void)IntrDrv_GetMaskLevel( &mask_level );				/* 割り込みマスクレベルの取得 */
			(void)IntrDrv_SetMaskLevel( INTR_DISABLE_LEVEL );		/* 割り込みマスクレベルの設定 */
			
			/* ch1 周期/デューティの設定 */
			*C_PcsrReg[ch1] = ( cycle - PWM_SUBTRACTION );
			*C_PdutReg[ch1] = ( duty1 - PWM_SUBTRACTION );
			
			/* ch2 周期/デューティの設定 */
			*C_PcsrReg[ch2] = ( cycle - PWM_SUBTRACTION );
			*C_PdutReg[ch2] = ( duty2 - PWM_SUBTRACTION );
			
			/* PPG制御ステータスレジスタを設定 */
			*C_PcnReg[ch1] = pcn_val1;
			*C_PcnReg[ch2] = pcn_val2;
			
			(void)IntrDrv_SetMaskLevel( mask_level );				/* 割り込みマスクレベルの設定 */
			
		} else {
			
			*C_PcnReg[ch1] = C_PcnSettingStopTbl[ch1];
			*C_PcnReg[ch2] = C_PcnSettingStopTbl[ch2];
			
			/* ch1 周期/デューティの設定 */
			*C_PcsrReg[ch1] = 0;
			*C_PdutReg[ch1] = 0;
			
			/* ch2 周期/デューティの設定 */
			*C_PcsrReg[ch2] = 0;
			*C_PdutReg[ch2] = 0;
			
		}
	} else {
		rc_out = D_NG;
	}
	
	
	return rc_out;
}

/****************************************************************************************/
/*	[モジュール名]	PWMDrv_ReqIntrClr	[名称]	PWMドライバの割り込み要因クリア処理		*/
/*======================================================================================*/
/*	[処理概要]	引数で指定されたチャネルの割込み要因をクリアする						*/
/*              																		*/
/*======================================================================================*/
/*	[記述形式]	SI_8 PWMDrv_ReqIntrClr(E_PWM_DRV_PPG_CH ch)								*/
/*	                                     												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	E_PWM_DRV_PPG_CH		ch		：PPGチャネル						    */
/*--------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	SI_8		rc_out	: 正常(D_OK)、異常(D_NG)を返す						*/
/*======================================================================================*/
/*	[ 備  考 ]																			*/
/*		チャネル間違い(存在しないチャネルを選択)は処理を行わず終了する					*/
/****************************************************************************************/
SI_8 PWMDrv_ReqIntrClr( E_PWM_DRV_PPG_CH ch )
{
	SI_8  rc_out;   /* 戻り値 */
	UI_16 pcn_work; /* PPG制御ステータスレジスタ演算用work変数 */
	
	/* チャネル正常の場合 */
	if ( ch < (UI_8)PPG_CH_NUMBER ) {
		pcn_work = *C_PcnReg[ch];
		pcn_work &= PCN_IRQF_CLR_MASK;
		*C_PcnReg[ch] = pcn_work;
		rc_out = D_OK;
	} else {
	/* チャネル異常の場合 */
		rc_out = D_NG;
	}
	
	return rc_out;
}

/****************************************************************************************/
/*	[モジュール名]	PWMDrv_ReqIntrDisable	[名称]	PWMドライバの割り込み禁止処理		*/
/*======================================================================================*/
/*	[処理概要]	引数で指定されたチャネルの割り込み要因クリア、割込み禁止を行う			*/
/*              																		*/
/*======================================================================================*/
/*	[記述形式]	SI_8 PWMDrv_ReqIntrDisable(E_PWM_DRV_PPG_CH  ch)						*/
/*	                                     												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	E_PWM_DRV_PPG_CH 		ch		：PPGチャネル						    */
/*--------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	SI_8		rc_out	: 正常(D_OK)、異常(D_NG)を返す						*/
/*======================================================================================*/
/*	[ 備  考 ]																			*/
/*		チャネル間違い(存在しないチャネルを選択)は処理を行わず終了する					*/
/****************************************************************************************/
SI_8 PWMDrv_ReqIntrDisable( E_PWM_DRV_PPG_CH  ch )
{
	SI_8  rc_out;   /* 戻り値 */
	UI_16 pcn_work; /* PPG制御ステータスレジスタ演算用work変数 */
	
	/* チャネル正常の場合 */
	if ( ch < ( UI_8 )PPG_CH_NUMBER ) {
		pcn_work = *C_PcnReg[ch];
		pcn_work &= PCN_IREN_IRQF_CLR_MASK;
		*C_PcnReg[ch] = pcn_work;
		rc_out = D_OK;
	} else {
	/* チャネル異常の場合 */
		rc_out = D_NG;
	}
	
	return rc_out;
}

/****************************************************************************************/
/*	[モジュール名]	PWMDrv_ReqIntrEnable	[名称]	PWMドライバの割り込み許可処理		*/
/*======================================================================================*/
/*	[処理概要]	引数で指定されたチャネルの割り込み要因の割込み許可を行う				*/
/*              																		*/
/*======================================================================================*/
/*	[記述形式]	SI_8 PWMDrv_ReqIntrEnable(E_PWM_DRV_PPG_CH  ch)							*/
/*	                                     												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	E_PWM_DRV_PPG_CH 		ch		：PPGチャネル						    */
/*--------------------------------------------------------------------------------------*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	SI_8		rc_out	: 正常(D_OK)、異常(D_NG)を返す						*/
/*======================================================================================*/
/*	[ 備  考 ]																			*/
/*		チャネル間違い(存在しないチャネルを選択)は処理を行わず終了する					*/
/****************************************************************************************/
SI_8 PWMDrv_ReqIntrEnable( E_PWM_DRV_PPG_CH  ch )
{
	SI_8  rc_out;   /* 戻り値 */
	UI_16 pcn_work; /* PPG制御ステータスレジスタ演算用work変数 */
	
	/* チャネル正常の場合 */
	if ( ch < ( UI_8 )PPG_CH_NUMBER ) {
		pcn_work = *C_PcnReg[ch];
		pcn_work |= PCN_IREN_SET;
		*C_PcnReg[ch] = pcn_work;
		rc_out = D_OK;
	} else {
	/* チャネル異常の場合 */
		rc_out = D_NG;
	}
	
	return rc_out;
}


/****************************************************************************************/
/*	[モジュール名]	PWM_Drv_Init		[名称]PWMドライバレジスタ初期設定処理			*/
/*======================================================================================*/
/*	[処理概要]	レジスタ初期設定時に本関数を呼び、初期化を行う。						*/
/*======================================================================================*/
/*	[記述形式]	void PWM_Drv_Init( E_INIT_TYPE req  )									*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	E_INIT_TYPE				req		：起動種別								*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void PWMDrv_Init( E_INIT_TYPE req )
{
	UI_8	ch;	/* PPGチャネル番号 */
	
	switch ( req ) {
	case E_INIT_RESET:			/* CPUリセットによる起動 */
	case E_INIT_WAKEUP:			/* 省電力解除（WAKEUP）による起動 */
		
		/* PPG周期設定レジスタ,PPGデューティ設定レジスタ,PPG制御ステータスレジスタ 初期設定 */
		for ( ch = 0; ch < PPG_CH_NUMBER; ch++ ) {
			*C_PcsrReg[ch] = C_PcsrSettingTbl[ch];
			*C_PdutReg[ch] = C_PdutSettingTbl[ch];
			*C_PcnReg[ch] = C_PcnSettingTbl[ch];
		}
		
		PPGDIV = INIT_PPGDIV;	/* PPG0出力分周設定レジスタ 初期設定 */
		
		GCN10 = INIT_GCN10;	/* ジェネラル制御レジスタ10 初期設定 */
		GCN11 = INIT_GCN11;	/* ジェネラル制御レジスタ11 初期設定 */
		GCN12 = INIT_GCN12;	/* ジェネラル制御レジスタ12 初期設定 */
		GCN13 = INIT_GCN13;	/* ジェネラル制御レジスタ13 初期設定 */
		GCN14 = INIT_GCN14;	/* ジェネラル制御レジスタ14 初期設定 */
		GCN15 = INIT_GCN15;	/* ジェネラル制御レジスタ15 初期設定 */
		GCN20 = INIT_GCN20;	/* ジェネラル制御レジスタ20 初期設定 */
		GCN21 = INIT_GCN21;	/* ジェネラル制御レジスタ21 初期設定 */
		GCN22 = INIT_GCN22;	/* ジェネラル制御レジスタ22 初期設定 */
		GCN23 = INIT_GCN23;	/* ジェネラル制御レジスタ23 初期設定 */
		GCN24 = INIT_GCN24;	/* ジェネラル制御レジスタ24 初期設定 */
		GCN25 = INIT_GCN25;	/* ジェネラル制御レジスタ25 初期設定 */
		
		break;
	case E_INIT_IGN_ON:			/* IGN ON */
		break;
	case E_INIT_RET_NORMAL_VOL:	/* 低電圧復帰 */
		break;
	case E_INIT_INTERVAL_WAKEUP:	/* 間欠起動ウェイクアップ */
		break;
	default:					/* 上記以外 */
		break;
	}
	
}

/****************************************************************************************/
/*	[モジュール名]	PWMDrv_Sleep	[名称]	PWMドライバレジスタ停止設定処理				*/
/*======================================================================================*/
/*	[処理概要]	省電力モード遷移時に本関数を呼び、初期化を行う。						*/
/*======================================================================================*/
/*	[記述形式]	void PWMDrv_Sleep( void )												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void PWMDrv_Sleep( void )
{
	UI_8	ch;	/* PPGチャネル番号 */
	
	/* PPG制御ステータスレジスタ,PPG周期設定レジスタ,PPGデューティ設定レジスタ 停止設定 */
	for ( ch = 0; ch < PPG_CH_NUMBER; ch++ ) {
		*C_PcnReg[ch] = C_PcnCtrlStopRegTbl[ch];
		*C_PcsrReg[ch] = C_PcsrRegStopTbl[ch];
		*C_PdutReg[ch] = C_PdutRegStopTbl[ch];
	}
	
	PPGDIV = STOP_PPGDIV;	/* PPG0出力分周設定レジスタ 停止設定 */
	
	GCN10 = STOP_GCN10;	/* ジェネラル制御レジスタ10 停止設定 */
	GCN11 = STOP_GCN11;	/* ジェネラル制御レジスタ11 停止設定 */
	GCN12 = STOP_GCN12;	/* ジェネラル制御レジスタ12 停止設定 */
	GCN13 = STOP_GCN13;	/* ジェネラル制御レジスタ13 停止設定 */
	GCN14 = STOP_GCN14;	/* ジェネラル制御レジスタ14 停止設定 */
	GCN15 = STOP_GCN15;	/* ジェネラル制御レジスタ15 停止設定 */
	GCN20 = STOP_GCN20;	/* ジェネラル制御レジスタ20 停止設定 */
	GCN21 = STOP_GCN21;	/* ジェネラル制御レジスタ21 停止設定 */
	GCN22 = STOP_GCN22;	/* ジェネラル制御レジスタ22 停止設定 */
	GCN23 = STOP_GCN23;	/* ジェネラル制御レジスタ23 停止設定 */
	GCN24 = STOP_GCN24;	/* ジェネラル制御レジスタ24 停止設定 */
	GCN25 = STOP_GCN25;	/* ジェネラル制御レジスタ25 停止設定 */
}

/****************************************************************************************/
/*	[モジュール名]	PWMDrv_Refresh	[名称]	PWMドライバレジスタ再設定処理				*/
/*======================================================================================*/
/*	[処理概要]	レジスタ再設定時に本関数を呼び、初期化を行う。							*/
/*======================================================================================*/
/*	[記述形式]	void PWMDrv_Refresh( void )												*/
/*--------------------------------------------------------------------------------------*/
/*	[ 引  数 ]	無し																	*/
/*--------------------------------------------------------------------------------------*/
/*	[ 戻り値 ]	無し																	*/
/*======================================================================================*/
/*	[ 備  考 ]	無し																	*/
/****************************************************************************************/
void PWMDrv_Refresh( void )
{
	/* 空関数 */
}

